sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#endif /* _PHY_H_ */
/* ENET definitions */
#define ENET                          ENET_BASE                                        /*!< ENET base address */

/* registers definitions */
#define ENET_MAC_CONFIGURATION                  REG32((ENET) + 0x00000000U)            /*!< ethernet MAC configuration register */
#define ENET_MAC_EXT_CONFIGURATION              REG32((ENET) + 0x00000004U)            /*!< ethernet MAC extended configuration register */
#define ENET_MAC_PACKET_FILTER                  REG32((ENET) + 0x00000008U)            /*!< ethernet MAC packet filter register */
#define ENET_MAC_WATCHDOG_TIMEOUT               REG32((ENET) + 0x0000000CU)            /*!< ethernet MAC watchdog timeout register */
#define ENET_MAC_HASH_TABLE_REG0                REG32((ENET) + 0x00000010U)            /*!< ethernet MAC hash table register 0 */
#define ENET_MAC_HASH_TABLE_REG1                REG32((ENET) + 0x00000014U)            /*!< ethernet MAC hash table register 1 */
#define ENET_MAC_VLAN_TAG_CTRL                  REG32((ENET) + 0x00000050U)            /*!< ethernet MAC vlan tag control register */
#define ENET_MAC_VLAN_TAG_DATA                  REG32((ENET) + 0x00000054U)            /*!< ethernet MAC vlan tag data register */
#define ENET_MAC_VLAN_TAG_FILTERx               REG32((ENET) + 0x00000054U)            /*!< ethernet MAC vlan tag filter register */
#define ENET_MAC_VLAN_HASH_TABLE                REG32((ENET) + 0x00000058U)            /*!< ethernet MAC vlan hash table register */
#define ENET_MAC_VLAN_INCL                      REG32((ENET) + 0x00000060U)            /*!< ethernet MAC Tx queue vlan inclusion register */
#define ENET_MAC_VLAN_INCLx                     REG32((ENET) + 0x00000060U)            /*!< ethernet MAC Tx queue x vlan inclusion register */
#define ENET_MAC_INNER_VLAN_INCL                REG32((ENET) + 0x00000064U)            /*!< ethernet MAC inner vlan tag inclusion or replacement register */
#define ENET_MAC_Q0_TX_FLOW_CTRL                REG32((ENET) + 0x00000070U)            /*!< ethernet MAC queue 0 transmit flow control register */
#define ENET_MAC_RX_FLOW_CTRL                   REG32((ENET) + 0x00000090U)            /*!< ethernet MAC receive flow control register */
#define ENET_MAC_RXQ_CTRL4                      REG32((ENET) + 0x00000094U)            /*!< ethernet MAC receive queue control 4 register */
#define ENET_MAC_RXQ_CTRL0                      REG32((ENET) + 0x000000A0U)            /*!< ethernet MAC receive queue control 0 register */
#define ENET_MAC_RXQ_CTRL1                      REG32((ENET) + 0x000000A4U)            /*!< ethernet MAC receive queue control 1 register */
#define ENET_MAC_RXQ_CTRL2                      REG32((ENET) + 0x000000A8U)            /*!< ethernet MAC receive queue control 2 register */
#define ENET_MAC_INTERRUPT_STATUS               REG32((ENET) + 0x000000B0U)            /*!< ethernet MAC interrupt status register */
#define ENET_MAC_INTERRUPT_ENABLE               REG32((ENET) + 0x000000B4U)            /*!< ethernet MAC interrupt enable register */
#define ENET_MAC_RX_TX_STATUS                   REG32((ENET) + 0x000000B8U)            /*!< ethernet MAC receive transmit status register */
#define ENET_MAC_PMT_CONTROL_STATUS             REG32((ENET) + 0x000000C0U)            /*!< ethernet MAC PMT control and status register */
#define ENET_MAC_RWK_PACKET_FILTER              REG32((ENET) + 0x000000C4U)            /*!< ethernet MAC remote wakeup filter register */
#define ENET_MAC_RWK_FILTERi_BYTE_MASK          REG32((ENET) + 0x000000C4U)            /*!< ethernet MAC remote wakeup filter byte mask register */
#define ENET_MAC_RWK_FILTER0123_COMMAND         REG32((ENET) + 0x000000C4U)            /*!< ethernet MAC remote wakeup filter command register */
#define ENET_MAC_RWK_FILTER0123_OFFSET          REG32((ENET) + 0x000000C4U)            /*!< ethernet MAC remote wakeup filter offset register */
#define ENET_MAC_RWK_FILTERi_CRC                REG32((ENET) + 0x000000C4U)            /*!< ethernet MAC remote wakeup filter crc register */
#define ENET_MAC_LPI_CONTROL_STATUS             REG32((ENET) + 0x000000D0U)            /*!< ethernet MAC LPI control and status register */
#define ENET_MAC_LPI_TIMERS_CONTROL             REG32((ENET) + 0x000000D4U)            /*!< ethernet MAC LPI timers control register */
#define ENET_MAC_LPI_ENTRY_TIMER                REG32((ENET) + 0x000000D4U)            /*!< ethernet MAC LPI timers control register */
#define ENET_MAC_1US_TIC_COUNTER                REG32((ENET) + 0x000000DCU)            /*!< ethernet MAC 1us tic counter register */
#define ENET_MAC_VERSION                        REG32((ENET) + 0x00000110U)            /*!< ethernet MAC version register */
#define ENET_MAC_DEBUG                          REG32((ENET) + 0x00000114U)            /*!< ethernet MAC debug register */
#define ENET_MAC_HW_FEATURE0                    REG32((ENET) + 0x0000011CU)            /*!< ethernet MAC hardware feature 0 register */
#define ENET_MAC_HW_FEATURE1                    REG32((ENET) + 0x00000120U)            /*!< ethernet MAC hardware feature 1 register */
#define ENET_MAC_HW_FEATURE2                    REG32((ENET) + 0x00000124U)            /*!< ethernet MAC hardware feature 2 register */
#define ENET_MAC_HW_FEATURE3                    REG32((ENET) + 0x00000128U)            /*!< ethernet MAC hardware feature 3 register */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS       REG32((ENET) + 0x00000140U)            /*!< ethernet MAC DPP FSM interrupt status register */
#define ENET_MAC_FSM_CONTROL                    REG32((ENET) + 0x00000148U)            /*!< ethernet MAC FSM control register */
#define ENET_MAC_FSM_ACT_TIMER                  REG32((ENET) + 0x0000014CU)            /*!< ethernet MAC FSM act timer register */
#define ENET_MAC_MDIO_ADDRESS                   REG32((ENET) + 0x00000200U)            /*!< ethernet MAC MDIO address register */
#define ENET_MAC_MDIO_DATA                      REG32((ENET) + 0x00000204U)            /*!< ethernet MAC MDIO data register */
#define ENET_MAC_ARP_ADDRESS                    REG32((ENET) + 0x00000210U)            /*!< ethernet MAC ARP adress register */
#define ENET_MAC_CSR_SW_CTRL                    REG32((ENET) + 0x00000230U)            /*!< ethernet MAC CSR software control register */
#define ENET_MAC_FPE_CTRL_STS                   REG32((ENET) + 0x00000234U)            /*!< ethernet MAC FPE control and status register */
#define ENET_MAC_PRESN_TIME_NS                  REG32((ENET) + 0x00000240U)            /*!< ethernet MAC presentation time in ns register */
#define ENET_MAC_PRESN_TIME_UPDT                REG32((ENET) + 0x00000244U)            /*!< ethernet MAC presentation time update register */
#define ENET_MAC_ADDRESS0_HIGH                  REG32((ENET) + 0x00000300U)            /*!< ethernet MAC address0 low register */
#define ENET_MAC_ADDRESS0_LOW                   REG32((ENET) + 0x00000304U)            /*!< ethernet MAC address0 high register */
#define ENET_MAC_ADDRESS1_HIGH                  REG32((ENET) + 0x00000308U)            /*!< ethernet MAC address1 low register */
#define ENET_MAC_ADDRESS1_LOW                   REG32((ENET) + 0x0000030CU)            /*!< ethernet MAC address1 low register */
#define ENET_MAC_ADDRESS2_HIGH                  REG32((ENET) + 0x00000310U)            /*!< ethernet MAC address2 high register */
#define ENET_MAC_ADDRESS2_LOW                   REG32((ENET) + 0x00000314U)            /*!< ethernet MAC address2 low register */
#define ENET_MMC_CONTROL                        REG32((ENET) + 0x00000700U)            /*!< ethernet MMC control register */
#define ENET_MMC_RX_INTERRUPT                   REG32((ENET) + 0x00000704U)            /*!< ethernet MMC receive interrupt register */
#define ENET_MMC_TX_INTERRUPT                   REG32((ENET) + 0x00000708U)            /*!< ethernet MMC transmit interrupt register */
#define ENET_MMC_RX_INTERRUPT_MASK              REG32((ENET) + 0x0000070CU)            /*!< ethernet MMC receive interrupt mask register */
#define ENET_MMC_TX_INTERRUPT_MASK              REG32((ENET) + 0x00000710U)            /*!< ethernet MMC transmit interrupt mask register */
#define ENET_TX_OCTET_COUNT_GOOD_BAD            REG32((ENET) + 0x00000714U)            /*!< ethernet transmit octet count good bad register */
#define ENET_TX_PACKET_COUNT_GOOD_BAD           REG32((ENET) + 0x00000718U)            /*!< ethernet transmit packet count good bad register */
#define ENET_TX_BROADCAST_PACKETS_GOOD          REG32((ENET) + 0x0000071CU)            /*!< ethernet transmit broadcast packets good register */
#define ENET_TX_MULTICAST_PACKETS_GOOD          REG32((ENET) + 0x00000720U)            /*!< ethernet transmit multicast packets good register */
#define ENET_TX_64OCTET_PACKETS_GOOD_BAD        REG32((ENET) + 0x00000724U)            /*!< ethernet transmit 64 octet packets good bad register */
#define ENET_TX_65TO127OCTET_PACKETS_GOOD_BAD   REG32((ENET) + 0x00000728U)            /*!< ethernet transmit 65 to 127 octet packets good bad register */
#define ENET_TX_128TO255OCTET_PACKETS_GOOD_BAD  REG32((ENET) + 0x0000072CU)            /*!< ethernet transmit 128 to 255 octet packets good bad register */
#define ENET_TX_256TO511OCTET_PACKETS_GOOD_BAD  REG32((ENET) + 0x00000730U)            /*!< ethernet transmit 256 to 511 octet packets good bad register */
#define ENET_TX_512TO1023OCTET_PACKETS_GOOD_BAD REG32((ENET) + 0x00000734U)            /*!< ethernet transmit 512 to 1023 octet packets good bad register */
#define ENET_TX_1024TOMAXOCTET_PACKETS_GOOD_BAD REG32((ENET) + 0x00000738U)            /*!< ethernet transmit 1024 to max octet packets good bad register */
#define ENET_TX_UNICAST_PACKETS_GOOD_BAD        REG32((ENET) + 0x0000073CU)            /*!< ethernet transmit unicast packets good bad register */
#define ENET_TX_MULTICAST_PACKETS_GOOD_BAD      REG32((ENET) + 0x00000740U)            /*!< ethernet transmit multicast packets good bad register */
#define ENET_TX_BROADCAST_PACKETS_GOOD_BAD      REG32((ENET) + 0x00000744U)            /*!< ethernet transmit broadcast packets good bad register */
#define ENET_TX_UNDERFLOW_ERROR_PACKETS         REG32((ENET) + 0x00000748U)            /*!< ethernet transmit underflow error packets register */
#define ENET_TX_SINGLE_COLLISION_GOOD_PACKETS   REG32((ENET) + 0x0000074CU)            /*!< ethernet transmit single collision good packets register */
#define ENET_TX_MULTIPLE_COLLISION_GOOD_PACKETS REG32((ENET) + 0x00000750U)            /*!< ethernet transmit multiple collision good packets register */
#define ENET_TX_DEFERRED_PACKETS                REG32((ENET) + 0x00000754U)            /*!< ethernet transmit deferred packets register */
#define ENET_TX_LATE_COLLISION_PACKETS          REG32((ENET) + 0x00000758U)            /*!< ethernet transmit late collision packets register */
#define ENET_TX_EXCESSIVE_COLLISION_PACKETS     REG32((ENET) + 0x0000075CU)            /*!< ethernet transmit excessive collision packets register */
#define ENET_TX_CARRIER_ERROR_PACKETS           REG32((ENET) + 0x00000760U)            /*!< ethernet transmit carrier error packets register */
#define ENET_TX_OCTET_COUNT_GOOD                REG32((ENET) + 0x00000764U)            /*!< ethernet transmit octet count good register */
#define ENET_TX_PACKET_COUNT_GOOD               REG32((ENET) + 0x00000768U)            /*!< ethernet transmit packet count good register */
#define ENET_TX_EXCESSIVE_DEFERRAL_ERROR        REG32((ENET) + 0x0000076CU)            /*!< ethernet transmit excessive deferral error register */
#define ENET_TX_PAUSE_PACKETS                   REG32((ENET) + 0x00000770U)            /*!< ethernet transmit pause packets register */
#define ENET_TX_VLAN_PACKETS_GOOD               REG32((ENET) + 0x00000774U)            /*!< ethernet transmit vlan packets good register */
#define ENET_TX_OSIZE_PACKETS_GOOD              REG32((ENET) + 0x00000778U)            /*!< ethernet transmit oversize packets good register */
#define ENET_RX_PACKETS_COUNT_GOOD_BAD          REG32((ENET) + 0x00000780U)            /*!< ethernet receive packet count good bad register */
#define ENET_RX_OCTET_COUNT_GOOD_BAD            REG32((ENET) + 0x00000784U)            /*!< ethernet receive octet count good bad register */
#define ENET_RX_OCTET_COUNT_GOOD                REG32((ENET) + 0x00000788U)            /*!< ethernet receive octet count good register */
#define ENET_RX_BROADCAST_PACKETS_GOOD          REG32((ENET) + 0x0000078CU)            /*!< ethernet receive broadcast packets good register */
#define ENET_RX_MULTICAST_PACKETS_GOOD          REG32((ENET) + 0x00000790U)            /*!< ethernet receive multicast packets good register */
#define ENET_RX_CRC_ERROR_PACKETS               REG32((ENET) + 0x00000794U)            /*!< ethernet receive crc error packets register */
#define ENET_RX_ALIGNMENT_ERROR_PACKETS         REG32((ENET) + 0x00000798U)            /*!< ethernet receive alignment error packets register */
#define ENET_RX_RUNT_ERROR_PACKETS              REG32((ENET) + 0x0000079CU)            /*!< ethernet receive runt error packets register */
#define ENET_RX_JABBER_ERROR_PACKETS            REG32((ENET) + 0x000007A0U)            /*!< ethernet receive jabber error packets register */
#define ENET_RX_UNDERSIZE_PACKETS_GOOD          REG32((ENET) + 0x000007A4U)            /*!< ethernet receive undersize packets good register */
#define ENET_RX_OVERSIZE_PACKETS_GOOD           REG32((ENET) + 0x000007A8U)            /*!< ethernet receive oversize packets good register */
#define ENET_RX_64OCTET_PACKETS_GOOD_BAD        REG32((ENET) + 0x000007ACU)            /*!< ethernet receive 64 octet packets good bad register */
#define ENET_RX_65TO127OCTET_PACKETS_GOOD_BAD   REG32((ENET) + 0x000007B0U)            /*!< ethernet receive 65 to 127 octet packets good bad register */
#define ENET_RX_128TO255OCTET_PACKETS_GOOD_BAD  REG32((ENET) + 0x000007B4U)            /*!< ethernet receive 128 to 255 octet packets good bad register */
#define ENET_RX_256TO511OCTET_PACKETS_GOOD_BAD  REG32((ENET) + 0x000007B8U)            /*!< ethernet receive 256 to 511 octet packets good bad register */
#define ENET_RX_512TO1023OCTET_PACKETS_GOOD_BAD REG32((ENET) + 0x000007BCU)            /*!< ethernet receive 512 to 1023 octet packets good bad register */
#define ENET_RX_1024TOMAXOCTET_PACKETS_GOOD_BAD REG32((ENET) + 0x000007C0U)            /*!< ethernet receive 1024 to max octet packets good bad register */
#define ENET_RX_UNICAST_PACKETS_GOOD            REG32((ENET) + 0x000007C4U)            /*!< ethernet receive unicast packets good register */
#define ENET_RX_LENGTH_ERROR_PACKETS            REG32((ENET) + 0x000007C8U)            /*!< ethernet receive length error packets register */
#define ENET_RX_OUT_OF_RANGE_TYPE_PACKETS       REG32((ENET) + 0x000007CCU)            /*!< ethernet receive out of range type packets register */
#define ENET_RX_PAUSE_PACKETS                   REG32((ENET) + 0x000007D0U)            /*!< ethernet receive pause packets register */
#define ENET_RX_FIFO_OVERFLOW_PACKETS           REG32((ENET) + 0x000007D4U)            /*!< ethernet receive fifo overflow packets register */
#define ENET_RX_VLAN_PACKETS_GOOD_BAD           REG32((ENET) + 0x000007D8U)            /*!< ethernet receive vlan packets good bad register */
#define ENET_RX_WATCHDOG_ERROR_PACKETS          REG32((ENET) + 0x000007DCU)            /*!< ethernet receive watchdog error packets register */
#define ENET_RX_ERROR_PACKETS                   REG32((ENET) + 0x000007E0U)            /*!< ethernet receive error packets register */
#define ENET_RX_CONTROL_PACKETS_GOOD            REG32((ENET) + 0x000007E4U)            /*!< ethernet receive control packets good register */
#define ENET_TX_LPI_USEC_CNTR                   REG32((ENET) + 0x000007ECU)            /*!< ethernet transmit LPI microseconds counter register */
#define ENET_TX_LPI_TRAN_CNTR                   REG32((ENET) + 0x000007F0U)            /*!< ethernet transmit LPI transition counter register */
#define ENET_RX_LPI_USEC_CNTR                   REG32((ENET) + 0x000007F4U)            /*!< ethernet receive LPI microseconds counter register */
#define ENET_RX_LPI_TRAN_CNTR                   REG32((ENET) + 0x000007F8U)            /*!< ethernet receive LPI transition counter register */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK          REG32((ENET) + 0x00000800U)            /*!< ethernet MMC IPC receive interrupt mask register */
#define ENET_MMC_IPC_RX_INTERRUPT               REG32((ENET) + 0x00000808U)            /*!< ethernet MMC IPC receive interrupt register */
#define ENET_RXIPV4_GOOD_PACKETS                REG32((ENET) + 0x00000810U)            /*!< ethernet receive ipv4 good packets register */
#define ENET_RXIPV4_HEADER_ERROR_PACKETS        REG32((ENET) + 0x00000814U)            /*!< ethernet receive ipv4 header error packets register */
#define ENET_RXIPV4_NO_PAYLOAD_PACKETS          REG32((ENET) + 0x00000818U)            /*!< ethernet receive ipv4 no payload packets register */
#define ENET_RXIPV4_FRAGMENTED_PACKETS          REG32((ENET) + 0x0000081CU)            /*!< ethernet receive ipv4 fragmented packets register */
#define ENET_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS REG32((ENET) + 0x00000820U)            /*!< ethernet receive ipv4 udp checksum disabled packets register */
#define ENET_RXIPV6_GOOD_PACKETS                REG32((ENET) + 0x00000824U)            /*!< ethernet receive ipv6 good packets register */
#define ENET_RXIPV6_HEADER_ERROR_PACKETS        REG32((ENET) + 0x00000828U)            /*!< ethernet receive ipv6 header error packets register */
#define ENET_RXIPV6_NO_PAYLOAD_PACKETS          REG32((ENET) + 0x0000082CU)            /*!< ethernet receive ipv6 no payload packets register */
#define ENET_RXUDP_GOOD_PACKETS                 REG32((ENET) + 0x00000830U)            /*!< ethernet receive udp good packets register */
#define ENET_RXUDP_ERROR_PACKETS                REG32((ENET) + 0x00000834U)            /*!< ethernet receive udp error packets register */
#define ENET_RXTCP_GOOD_PACKETS                 REG32((ENET) + 0x00000838U)            /*!< ethernet receive tcp good packets register */
#define ENET_RXTCP_ERROR_PACKETS                REG32((ENET) + 0x0000083CU)            /*!< ethernet receive tcp error packets register */
#define ENET_RXICMP_GOOD_PACKETS                REG32((ENET) + 0x00000840U)            /*!< ethernet receive icmp good packets register */
#define ENET_RXICMP_ERROR_PACKETS               REG32((ENET) + 0x00000844U)            /*!< ethernet receive icmp error packets register */
#define ENET_RXIPV4_GOOD_OCTETS                 REG32((ENET) + 0x00000850U)            /*!< ethernet receive ipv4 good octets register */
#define ENET_RXIPV4_HEADER_ERROR_OCTETS         REG32((ENET) + 0x00000854U)            /*!< ethernet receive ipv4 header error octets register */
#define ENET_RXIPV4_NO_PAYLOAD_OCTETS           REG32((ENET) + 0x00000858U)            /*!< ethernet receive ipv4 no payload octets register */
#define ENET_RXIPV4_FRAGMENTED_OCTETS           REG32((ENET) + 0x0000085CU)            /*!< ethernet receive ipv4 fragmented octets register */
#define ENET_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS REG32((ENET) + 0x00000860U)            /*!< ethernet receive ipv4 udp checksum disabled octets register */
#define ENET_RXIPV6_GOOD_OCTETS                 REG32((ENET) + 0x00000864U)            /*!< ethernet receive ipv6 good octets register */
#define ENET_RXIPV6_HEADER_ERROR_OCTETS         REG32((ENET) + 0x00000868U)            /*!< ethernet receive ipv6 header error octets register */
#define ENET_RXIPV6_NO_PAYLOAD_OCTETS           REG32((ENET) + 0x0000086CU)            /*!< ethernet receive ipv6 no payload octets register */
#define ENET_RXUDP_GOOD_OCTETS                  REG32((ENET) + 0x00000870U)            /*!< ethernet receive udp good octets register */
#define ENET_RXUDP_ERROR_OCTETS                 REG32((ENET) + 0x00000874U)            /*!< ethernet receive udp error octets register */
#define ENET_RXTCP_GOOD_OCTETS                  REG32((ENET) + 0x00000878U)            /*!< ethernet receive tcp good octets register */
#define ENET_RXTCP_ERROR_OCTETS                 REG32((ENET) + 0x0000087CU)            /*!< ethernet receive tcp error octets register */
#define ENET_RXICMP_GOOD_OCTETS                 REG32((ENET) + 0x00000880U)            /*!< ethernet receive icmp good octets register */
#define ENET_RXICMP_ERROR_OCTETS                REG32((ENET) + 0x00000884U)            /*!< ethernet receive icmp error octets register */
#define ENET_MMC_FPE_TX_INTERRUPT               REG32((ENET) + 0x000008A0U)            /*!< ethernet MMC FPE transmit interrupt register */
#define ENET_MMC_FPE_TX_INTERRUPT_MASK          REG32((ENET) + 0x000008A4U)            /*!< ethernet MMC FPE transmit interrupt mask register */
#define ENET_MMC_FPE_TX_FRAGMENT_CNTR           REG32((ENET) + 0x000008A8U)            /*!< ethernet MMC FPE transmit fragment counter register */
#define ENET_MMC_TX_HOLD_REQ_CNTR               REG32((ENET) + 0x000008ACU)            /*!< ethernet MMC FPE hold request counter register */
#define ENET_MMC_FPE_RX_INTERRUPT               REG32((ENET) + 0x000008C0U)            /*!< ethernet MMC FPE receive interrupt register */
#define ENET_MMC_FPE_RX_INTERRUPT_MASK          REG32((ENET) + 0x000008C4U)            /*!< ethernet MMC FPE receive interrupt mask register */
#define ENET_MMC_RX_PACKETS_ASSEMBLY_ERR_CNTR   REG32((ENET) + 0x000008C8U)            /*!< ethernet MMC receive packets assembly error counter register */
#define ENET_MMC_RX_PACKETS_SMD_ERR_CNTR        REG32((ENET) + 0x000008CCU)            /*!< ethernet MMC receive packets SMD error counter register */
#define ENET_MMC_RX_PACKETS_ASSEMBLY_OK_CNTR    REG32((ENET) + 0x000008D0U)            /*!< ethernet MMC receive packets assembly ok counter register */
#define ENET_MMC_RX_FPE_FRAGMENT_CNTR           REG32((ENET) + 0x000008D4U)            /*!< ethernet MMC receive FPE fragment counter register */
#define ENET_MAC_L3_L4_CONTROL0                 REG32((ENET) + 0x00000900U)            /*!< ethernet MAC layer 3 and layer 4 control register, x = 0,1,2,3 */
#define ENET_MAC_LAYER4_ADDRESS0                REG32((ENET) + 0x00000904U)            /*!< ethernet MAC layer 4 address register 0 */
#define ENET_MAC_LAYER3_ADDR0_REG0              REG32((ENET) + 0x00000910U)            /*!< ethernet MAC layer 3 address 0 register 0 */
#define ENET_MAC_LAYER3_ADDR1_REG0              REG32((ENET) + 0x00000914U)            /*!< ethernet MAC layer 3 address 1 register 0 */
#define ENET_MAC_LAYER3_ADDR2_REG0              REG32((ENET) + 0x00000918U)            /*!< ethernet MAC layer 3 address 2 register 0 */
#define ENET_MAC_LAYER3_ADDR3_REG0              REG32((ENET) + 0x0000091CU)            /*!< ethernet MAC layer 3 address 3 register 0 */
#define ENET_MAC_L3_L4_CONTROL1                 REG32((ENET) + 0x00000930U)            /*!< ethernet MAC layer 3 and layer 4 control register 1 */
#define ENET_MAC_LAYER4_ADDRESS1                REG32((ENET) + 0x00000934U)            /*!< ethernet MAC layer 4 address register 1 */
#define ENET_MAC_LAYER3_ADDR0_REG1              REG32((ENET) + 0x00000940U)            /*!< ethernet MAC layer 3 address 0 register 1 */
#define ENET_MAC_LAYER3_ADDR1_REG1              REG32((ENET) + 0x00000944U)            /*!< ethernet MAC layer 3 address 1 register 1 */
#define ENET_MAC_LAYER3_ADDR2_REG1              REG32((ENET) + 0x00000948U)            /*!< ethernet MAC layer 3 address 2 register 1 */
#define ENET_MAC_LAYER3_ADDR3_REG1              REG32((ENET) + 0x0000094CU)            /*!< ethernet MAC layer 3 address 3 register 1 */
#define ENET_MAC_L3_L4_CONTROL2                 REG32((ENET) + 0x00000960U)            /*!< ethernet MAC layer 3 and layer 4 control register 2 */
