sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_MAC_LAYER4_ADDRESS2                REG32((ENET) + 0x00000964U)            /*!< ethernet MAC layer 4 address register 2 */
#define ENET_MAC_LAYER3_ADDR0_REG2              REG32((ENET) + 0x00000970U)            /*!< ethernet MAC layer 3 address 0 register 2 */
#define ENET_MAC_LAYER3_ADDR1_REG2              REG32((ENET) + 0x00000974U)            /*!< ethernet MAC layer 3 address 1 register 2 */
#define ENET_MAC_LAYER3_ADDR2_REG2              REG32((ENET) + 0x00000978U)            /*!< ethernet MAC layer 3 address 2 register 2 */
#define ENET_MAC_LAYER3_ADDR3_REG2              REG32((ENET) + 0x0000097CU)            /*!< ethernet MAC layer 3 address 3 register 2 */
#define ENET_MAC_L3_L4_CONTROL3                 REG32((ENET) + 0x00000990U)            /*!< ethernet MAC layer 3 and layer 4 control register 3 */
#define ENET_MAC_LAYER4_ADDRESS3                REG32((ENET) + 0x00000994U)            /*!< ethernet MAC layer 4 address register 3 */
#define ENET_MAC_LAYER3_ADDR0_REG3              REG32((ENET) + 0x000009A0U)            /*!< ethernet MAC layer 3 address 0 register 3 */
#define ENET_MAC_LAYER3_ADDR1_REG3              REG32((ENET) + 0x000009A4U)            /*!< ethernet MAC layer 3 address 1 register 3 */
#define ENET_MAC_LAYER3_ADDR2_REG3              REG32((ENET) + 0x000009A8U)            /*!< ethernet MAC layer 3 address 2 register 3 */
#define ENET_MAC_LAYER3_ADDR3_REG3              REG32((ENET) + 0x000009ACU)            /*!< ethernet MAC layer 3 address 3 register 3 */
#define ENET_MAC_INDIR_ACCESS_CTRL              REG32((ENET) + 0x00000A70U)            /*!< ethernet MAC indirect access control register */
#define ENET_MAC_INDIR_ACCESS_DATA              REG32((ENET) + 0x00000A74U)            /*!< ethernet MAC indirect access data register */
#define ENET_MAC_TMRQ_REGSx                     REG32((ENET) + 0x00000A74U)            /*!< ethernet MAC type match receive queue number register */
#define ENET_MAC_TIMESTAMP_CONTROL              REG32((ENET) + 0x00000B00U)            /*!< ethernet MAC timestamp control register */
#define ENET_MAC_SUB_SECOND_INCREMENT           REG32((ENET) + 0x00000B04U)            /*!< ethernet MAC timestamp control register */
#define ENET_MAC_SYSTEM_TIME_SECONDS            REG32((ENET) + 0x00000B08U)            /*!< ethernet MAC system time sencond register */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS        REG32((ENET) + 0x00000B0CU)            /*!< ethernet MAC system time nanosencond register */
#define ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE     REG32((ENET) + 0x00000B10U)            /*!< ethernet MAC system time sencond update register */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE REG32((ENET) + 0x00000B14U)            /*!< ethernet MAC system time nanosencond update register */
#define ENET_MAC_TIMESTAMP_ADDEND               REG32((ENET) + 0x00000B18U)            /*!< ethernet MAC timestamp addend register */
#define ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS REG32((ENET) + 0x00000B1CU)           /*!< ethernet MAC system time higher word sencond register */
#define ENET_MAC_TIMESTAMP_STATUS               REG32((ENET) + 0x00000B20U)            /*!< ethernet MAC timestamp status register */
#define ENET_MAC_RX_DOMAIN_TIME_INCR            REG32((ENET) + 0x00000B24U)            /*!< ethernet MAC receive domain time increment register */
#define ENET_MAC_TX_DOMAIN_TIME_INCR            REG32((ENET) + 0x00000B28U)            /*!< ethernet MAC transmit domain time increment register */
#define ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS REG32((ENET) + 0x00000B30U)           /*!< ethernet MAC transmit timestamp status nanoseconds register */
#define ENET_MAC_TX_TIMESTAMP_STATUS_SECONDS    REG32((ENET) + 0x00000B34U)            /*!< ethernet MAC transmit timestamp status seconds register */
#define ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR    REG32((ENET) + 0x00000B50U)            /*!< ethernet MAC timestamp ingress asymmetry correction register */
#define ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR     REG32((ENET) + 0x00000B54U)            /*!< ethernet MAC timestamp egress asymmetry correction register */
#define ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND REG32((ENET) + 0x00000B58U)         /*!< ethernet MAC timestamp ingress correction nanoseconds register */
#define ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND REG32((ENET) + 0x00000B5CU)          /*!< ethernet MAC timestamp egress correction nanoseconds register */
#define ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC REG32((ENET) + 0x00000B60U)         /*!< ethernet MAC timestamp ingress correction subnanoseconds register */
#define ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC REG32((ENET) + 0x00000B64U)          /*!< ethernet MAC timestamp egress correction subnanoseconds register */
#define ENET_MAC_TIMESTAMP_INGRESS_LATENCY    REG32((ENET) + 0x00000B68U)              /*!< ethernet MAC timestamp ingress latency register */
#define ENET_MAC_TIMESTAMP_EGRESS_LATENCY     REG32((ENET) + 0x00000B6CU)              /*!< ethernet MAC timestamp egress latency correction register */
#define ENET_MAC_PPS_CONTROL                  REG32((ENET) + 0x00000B70U)              /*!< ethernet MAC PPS control register */
#define ENET_MAC_PPS0_TARGET_TIME_SECONDS     REG32((ENET) + 0x00000B80U)              /*!< ethernet MAC PPS 0 target time seconds register */
#define ENET_MAC_PPS0_TARGET_TIME_NANOSECONDS REG32((ENET) + 0x00000B84U)              /*!< ethernet MAC PPS 0 target time nanoseconds register */
#define ENET_MAC_PPS0_INTERVAL                REG32((ENET) + 0x00000B88U)              /*!< ethernet MAC PPS 0 interval register */
#define ENET_MAC_PPS0_WIDTH                   REG32((ENET) + 0x00000B8CU)              /*!< ethernet MAC PPS 0 width register */
#define ENET_MAC_PPS1_TARGET_TIME_SECONDS     REG32((ENET) + 0x00000B90U)              /*!< ethernet MAC PPS 1 target time seconds register */
#define ENET_MAC_PPS1_TARGET_TIME_NANOSECONDS REG32((ENET) + 0x00000B94U)              /*!< ethernet MAC PPS 1 target time nanoseconds register */
#define ENET_MAC_PPS1_INTERVAL                REG32((ENET) + 0x00000B98U)              /*!< ethernet MAC PPS 1 interval register */
#define ENET_MAC_PPS1_WIDTH                   REG32((ENET) + 0x00000B9CU)              /*!< ethernet MAC PPS 1 width register */
#define ENET_MAC_PPS2_TARGET_TIME_SECONDS     REG32((ENET) + 0x00000BA0U)              /*!< ethernet MAC PPS 2 target time seconds register */
#define ENET_MAC_PPS2_TARGET_TIME_NANOSECONDS REG32((ENET) + 0x00000BA4U)              /*!< ethernet MAC PPS 2 target time nanoseconds register */
#define ENET_MAC_PPS2_INTERVAL                REG32((ENET) + 0x00000BA8U)              /*!< ethernet MAC PPS 2 interval register */
#define ENET_MAC_PPS2_WIDTH                   REG32((ENET) + 0x00000BACU)              /*!< ethernet MAC PPS 2 width register */
#define ENET_MAC_PPS3_TARGET_TIME_SECONDS     REG32((ENET) + 0x00000BB0U)              /*!< ethernet MAC PPS 3 target time seconds register */
#define ENET_MAC_PPS3_TARGET_TIME_NANOSECONDS REG32((ENET) + 0x00000BB4U)              /*!< ethernet MAC PPS 3 target time nanoseconds register */
#define ENET_MAC_PPS3_INTERVAL                REG32((ENET) + 0x00000BB8U)              /*!< ethernet MAC PPS 3 interval register */
#define ENET_MAC_PPS3_WIDTH                   REG32((ENET) + 0x00000BBCU)              /*!< ethernet MAC PPS 3 width register */
#define ENET_MTL_OPERATION_MODE               REG32((ENET) + 0x00000C00U)              /*!< ethernet MTL operation mode register */
#define ENET_MTL_DBG_CTL                      REG32((ENET) + 0x00000C08U)              /*!< ethernet MTL debug control register */
#define ENET_MTL_DBG_STS                      REG32((ENET) + 0x00000C0CU)              /*!< ethernet MTL debug status register */
#define ENET_MTL_FIFO_DEBUG_DATA              REG32((ENET) + 0x00000C10U)              /*!< ethernet MTL debug status register */
#define ENET_MTL_INTERRUPT_STATUS             REG32((ENET) + 0x00000C20U)              /*!< ethernet MTL interrupt status register */
#define ENET_MTL_RXQ_DMA_MAP0                 REG32((ENET) + 0x00000C30U)              /*!< ethernet MTL receive queue and dma channel map 0 register */
#define ENET_MTL_TBS_CTRL                     REG32((ENET) + 0x00000C40U)              /*!< ethernet MTL TBS control register */
#define ENET_MTL_EST_CONTROL                  REG32((ENET) + 0x00000C50U)              /*!< ethernet MTL EST control register */
#define ENET_MTL_EST_EXT_CONTROL              REG32((ENET) + 0x00000C54U)              /*!< ethernet MTL EST extention control register */
#define ENET_MTL_EST_STATUS                   REG32((ENET) + 0x00000C58U)              /*!< ethernet MTL EST status register */
#define ENET_MTL_EST_SCH_ERROR                REG32((ENET) + 0x00000C60U)              /*!< ethernet MTL EST schedule error register */
#define ENET_MTL_EST_FRM_SIZE_ERROR           REG32((ENET) + 0x00000C64U)              /*!< ethernet MTL EST frame size error register */
#define ENET_MTL_EST_FRM_SIZE_CAPTURE         REG32((ENET) + 0x00000C68U)              /*!< ethernet MTL EST frame size capture register */
#define ENET_MTL_EST_INTR_ENABLE              REG32((ENET) + 0x00000C70U)              /*!< ethernet MTL EST interrupt enable register */
#define ENET_MTL_EST_GCL_CONTROL              REG32((ENET) + 0x00000C80U)              /*!< ethernet MTL EST GCL control register */
#define ENET_MTL_EST_GCL_DATA                 REG32((ENET) + 0x00000C84U)              /*!< ethernet MTL EST GCL data register */
#define ENET_MTL_FPE_CTRL_STS                 REG32((ENET) + 0x00000C90U)              /*!< ethernet MTL EST FPE control and status register */
#define ENET_MTL_FPE_ADVANCE                  REG32((ENET) + 0x00000C94U)              /*!< ethernet MTL EST FPE advance register */
#define ENET_MTL_RXP_CONTROL_STATUS           REG32((ENET) + 0x00000CA0U)              /*!< ethernet MTL receive parser control and status register */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS REG32((ENET) + 0x00000CA4U)              /*!< ethernet MTL receive parser interrupt control and status register */
#define ENET_MTL_RXP_DROP_CNT                 REG32((ENET) + 0x00000CA8U)              /*!< ethernet MTL receive parser drop counter register */
#define ENET_MTL_RXP_ERROR_CNT                REG32((ENET) + 0x00000CACU)              /*!< ethernet MTL receive parser error counter register */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS REG32((ENET) + 0x00000CB0U)           /*!< ethernet MTL receive parser indirect access control and status register */
#define ENET_MTL_RXP_INDIRECT_ACC_DATA        REG32((ENET) + 0x00000CB4U)              /*!< ethernet MTL receive parser indirect access data register */
#define ENET_MTL_RXP_BYPASS_CNT               REG32((ENET) + 0x00000CB8U)              /*!< ethernet MTL receive parser bypass counter register */
#define ENET_MTL_ECC_CONTROL                  REG32((ENET) + 0x00000CC0U)              /*!< ethernet MTL ECC control register */
#define ENET_MTL_SAFETY_INTERRUPT_STATUS      REG32((ENET) + 0x00000CC4U)              /*!< ethernet MTL safety interrupt status register */
#define ENET_MTL_ECC_INTERRUPT_ENABLE         REG32((ENET) + 0x00000CC8U)              /*!< ethernet MTL ECC interrupt enable register */
#define ENET_MTL_ECC_INTERRUPT_STATUS         REG32((ENET) + 0x00000CCCU)              /*!< ethernet MTL ECC interrupt status register */
#define ENET_MTL_ECC_ERR_STS_RCTL             REG32((ENET) + 0x00000CD0U)              /*!< ethernet MTL ECC error status and control register */
#define ENET_MTL_ECC_ERR_ADDR_STATUS          REG32((ENET) + 0x00000CD4U)              /*!< ethernet MTL ECC error address status register */
#define ENET_MTL_ECC_ERR_CNTR_STATUS          REG32((ENET) + 0x00000CD8U)              /*!< ethernet MTL ECC error counter status register */
#define ENET_MTL_DPP_CONTROL                  REG32((ENET) + 0x00000CE0U)              /*!< ethernet MTL DPP control register */
#define ENET_MTL_DPP_ECC_EIC                  REG32((ENET) + 0x00000CE4U)              /*!< ethernet MTL DPP and ECC error injection register */
#define ENET_MTL_TXQ0_OPERATION_MODE          REG32((ENET) + 0x00000D00U)              /*!< ethernet MTL transmit queue 0 operation mode register */
#define ENET_MTL_TXQ0_UNDERFLOW               REG32((ENET) + 0x00000D04U)              /*!< ethernet MTL transmit queue 0 underflow register */
#define ENET_MTL_TXQ0_DEBUG                   REG32((ENET) + 0x00000D08U)              /*!< ethernet MTL transmit queue 0 debug register */
#define ENET_MTL_TXQ0_ETS_STATUS              REG32((ENET) + 0x00000D14U)              /*!< ethernet MTL transmit queue 0 ETS status register */
#define ENET_MTL_TXQ0_QUANTUM_WEIGHT          REG32((ENET) + 0x00000D18U)              /*!< ethernet MTL transmit queue 0 quantum weight register */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS  REG32((ENET) + 0x00000D2CU)              /*!< ethernet MTL queue 0 interrupt control and status register */
#define ENET_MTL_RXQ0_OPERATION_MODE          REG32((ENET) + 0x00000D30U)              /*!< ethernet MTL receive queue 0 operation mode register */
#define ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT REG32((ENET) + 0x00000D34U)           /*!< ethernet MTL receive queue 0 missed packet overflow counter register */
#define ENET_MTL_RXQ0_DEBUG                   REG32((ENET) + 0x00000D38U)              /*!< ethernet MTL receive queue 0 debug register */
#define ENET_MTL_RXQ0_CONTROL                 REG32((ENET) + 0x00000D3CU)              /*!< ethernet MTL receive queue 0 control register */
#define ENET_MTL_TXQ1_OPERATION_MODE          REG32((ENET) + 0x00000D40U)              /*!< ethernet MTL transmit queue 1 operation mode register */
#define ENET_MTL_TXQ1_UNDERFLOW               REG32((ENET) + 0x00000D44U)              /*!< ethernet MTL transmit queue 1 underflow register */
#define ENET_MTL_TXQ1_DEBUG                   REG32((ENET) + 0x00000D48U)              /*!< ethernet MTL transmit queue 1 debug register */
#define ENET_MTL_TXQ1_ETS_CONTROL             REG32((ENET) + 0x00000D50U)              /*!< ethernet MTL transmit queue 1 ETS control register */
#define ENET_MTL_TXQ1_ETS_STATUS              REG32((ENET) + 0x00000D54U)              /*!< ethernet MTL transmit queue 1 ETS status register */
#define ENET_MTL_TXQ1_QUANTUM_WEIGHT          REG32((ENET) + 0x00000D58U)              /*!< ethernet MTL transmit queue 1 quantum weight register */
#define ENET_MTL_TXQ1_SENDSLOPECREDIT         REG32((ENET) + 0x00000D5CU)              /*!< ethernet MTL transmit queue 1 send slope credit register */
#define ENET_MTL_TXQ1_HICREDIT                REG32((ENET) + 0x00000D60U)              /*!< ethernet MTL transmit queue 1 high credit register */
#define ENET_MTL_TXQ1_LOCREDIT                REG32((ENET) + 0x00000D64U)              /*!< ethernet MTL transmit queue 1 low credit register */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS  REG32((ENET) + 0x00000D6CU)              /*!< ethernet MTL queue 1 interrupt control and status register */
#define ENET_MTL_RXQ1_OPERATION_MODE          REG32((ENET) + 0x00000D70U)              /*!< ethernet MTL receive queue 1 operation mode register */
#define ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT REG32((ENET) + 0x00000D74U)           /*!< ethernet MTL receive queue 1 missed packet overflow counter register */
#define ENET_MTL_RXQ1_DEBUG                   REG32((ENET) + 0x00000D78U)              /*!< ethernet MTL receive queue 1 debug register */
#define ENET_MTL_RXQ1_CONTROL                 REG32((ENET) + 0x00000D7CU)              /*!< ethernet MTL receive queue 1 control register */
#define ENET_DMA_MODE                         REG32((ENET) + 0x00001000U)              /*!< ethernet DMA mode register */
#define ENET_DMA_SYSBUS_MODE                  REG32((ENET) + 0x00001004U)              /*!< ethernet DMA sysbus mode register */
#define ENET_DMA_INTERRUPT_STATUS             REG32((ENET) + 0x00001008U)              /*!< ethernet DMA interrupt status register */
#define ENET_DMA_DEBUG_STATUS0                REG32((ENET) + 0x0000100CU)              /*!< ethernet DMA debug status 0 register */
#define ENET_DMA_TBS_CTRL0                    REG32((ENET) + 0x00001050U)              /*!< ethernet DMA TBS control 0 register */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS      REG32((ENET) + 0x00001080U)              /*!< ethernet DMA safety interrupt status register */
#define ENET_DMA_CH0_CONTROL                  REG32((ENET) + 0x00001100U)              /*!< ethernet DMA channel 0 control register */
#define ENET_DMA_CH0_TX_CONTROL               REG32((ENET) + 0x00001104U)              /*!< ethernet DMA channel 0 transmit control register */
#define ENET_DMA_CH0_RX_CONTROL               REG32((ENET) + 0x00001108U)              /*!< ethernet DMA channel 0 receive control register */
#define ENET_DMA_CH0_TXDESC_ADDRESS           REG32((ENET) + 0x00001114U)              /*!< ethernet DMA channel 0 transmit descriptor address register */
#define ENET_DMA_CH0_RXDESC_ADDRESS           REG32((ENET) + 0x0000111CU)              /*!< ethernet DMA channel 0 receive descriptor address register */
#define ENET_DMA_CH0_TXDESC_TAIL_POINTER      REG32((ENET) + 0x00001120U)              /*!< ethernet DMA channel 0 transmit descriptor tail pointer register */
#define ENET_DMA_CH0_RXDESC_TAIL_POINTER      REG32((ENET) + 0x00001128U)              /*!< ethernet DMA channel 0 receive descriptor tail pointer register */
#define ENET_DMA_CH0_TXDESC_RING_LENGTH       REG32((ENET) + 0x0000112CU)              /*!< ethernet DMA channel 0 transmit descriptor ring length register */
#define ENET_DMA_CH0_RX_CONTROL2              REG32((ENET) + 0x00001130U)              /*!< ethernet DMA channel 0 receive control 2 register */
#define ENET_DMA_CH0_INTERRUPT_ENABLE         REG32((ENET) + 0x00001134U)              /*!< ethernet DMA channel 0 interrupt enable register */
#define ENET_DMA_CH0_RX_INTERRUPT_WATCHDOG_TIMER REG32((ENET) + 0x00001138U)           /*!< ethernet DMA channel 0 receive interrupt watchdog timer register */
#define ENET_DMA_CH0_SLOT_FUNCTION_CONTROL_STATUS REG32((ENET) + 0x0000113CU)          /*!< ethernet DMA channel 0 slot function control status register */
#define ENET_DMA_CH0_CURRENT_APP_TXDESC       REG32((ENET) + 0x00001144U)              /*!< ethernet DMA channel 0 current application transmit descriptor register */
#define ENET_DMA_CH0_CURRENT_APP_RXDESC       REG32((ENET) + 0x0000114CU)              /*!< ethernet DMA channel 0 current application receive descriptor register */
#define ENET_DMA_CH0_CURRENT_APP_TXBUFFER     REG32((ENET) + 0x00001154U)              /*!< ethernet DMA channel 0 current application transmit buffer register */
#define ENET_DMA_CH0_CURRENT_APP_RXBUFFER     REG32((ENET) + 0x0000115CU)              /*!< ethernet DMA channel 0 current application transmit buffer register */
#define ENET_DMA_CH0_STATUS                   REG32((ENET) + 0x00001160U)              /*!< ethernet DMA channel 0 status register */
#define ENET_DMA_CH0_MISS_FRAME_CNT           REG32((ENET) + 0x00001164U)              /*!< ethernet DMA channel 0 miss frame counter register */
#define ENET_DMA_CH0_RXP_ACCEPT_CNT           REG32((ENET) + 0x00001168U)              /*!< ethernet DMA channel 0 receive parser accept counter register */

