sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_DMA_CH1_CONTROL                  REG32((ENET) + 0x00001180U)              /*!< ethernet DMA channel 1 control register */
#define ENET_DMA_CH1_TX_CONTROL               REG32((ENET) + 0x00001184U)              /*!< ethernet DMA channel 1 transmit control register */
#define ENET_DMA_CH1_RX_CONTROL               REG32((ENET) + 0x00001188U)              /*!< ethernet DMA channel 1 receive control register */
#define ENET_DMA_CH1_TXDESC_ADDRESS           REG32((ENET) + 0x00001194U)              /*!< ethernet DMA channel 1 transmit descriptor address register */
#define ENET_DMA_CH1_RXDESC_ADDRESS           REG32((ENET) + 0x0000119CU)              /*!< ethernet DMA channel 1 receive descriptor address register */
#define ENET_DMA_CH1_TXDESC_TAIL_POINTER      REG32((ENET) + 0x000011A0U)              /*!< ethernet DMA channel 1 transmit descriptor tail pointer register */
#define ENET_DMA_CH1_RXDESC_TAIL_POINTER      REG32((ENET) + 0x000011A8U)              /*!< ethernet DMA channel 1 receive descriptor tail pointer register */
#define ENET_DMA_CH1_TXDESC_RING_LENGTH       REG32((ENET) + 0x000011ACU)              /*!< ethernet DMA channel 1 transmit descriptor ring length register */
#define ENET_DMA_CH1_RX_CONTROL2              REG32((ENET) + 0x000011B0U)              /*!< ethernet DMA channel 1 receive control 2 register */
#define ENET_DMA_CH1_INTERRUPT_ENABLE         REG32((ENET) + 0x000011B4U)              /*!< ethernet DMA channel 1 interrupt enable register */
#define ENET_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER REG32((ENET) + 0x000011B8U)           /*!< ethernet DMA channel 1 receive interrupt watchdog timer register */
#define ENET_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS REG32((ENET) + 0x000011BCU)          /*!< ethernet DMA channel 1 slot function control status register */
#define ENET_DMA_CH1_CURRENT_APP_TXDESC       REG32((ENET) + 0x000011C4U)              /*!< ethernet DMA channel 1 current application transmit descriptor register */
#define ENET_DMA_CH1_CURRENT_APP_RXDESC       REG32((ENET) + 0x000011CCU)              /*!< ethernet DMA channel 1 current application receive descriptor register */
#define ENET_DMA_CH1_CURRENT_APP_TXBUFFER     REG32((ENET) + 0x000011D4U)              /*!< ethernet DMA channel 1 current application transmit buffer register, */
#define ENET_DMA_CH1_CURRENT_APP_RXBUFFER     REG32((ENET) + 0x000011DCU)              /*!< ethernet DMA channel 1 current application transmit buffer register */
#define ENET_DMA_CH1_STATUS                   REG32((ENET) + 0x000011E0U)              /*!< ethernet DMA channel 1 status register */
#define ENET_DMA_CH1_MISS_FRAME_CNT           REG32((ENET) + 0x000011E4U)              /*!< ethernet DMA channel 1 miss frame counter register */
#define ENET_DMA_CH1_RXP_ACCEPT_CNT           REG32((ENET) + 0x000011E8U)              /*!< ethernet DMA channel 1 receive parser accept counter register */

/* bits definitions */
/* ENET_MAC_CONFIGURATION */
#define ENET_MAC_CONFIGURATION_RE                               BIT(0)                 /*!< receiver enable */
#define ENET_MAC_CONFIGURATION_TE                               BIT(1)                 /*!< transmitter enable */
#define ENET_MAC_CONFIGURATION_PRELEN                           BITS(2,3)              /*!< preamble length for transmit packets */
#define ENET_MAC_CONFIGURATION_DC                               BIT(4)                 /*!< deferral check */
#define ENET_MAC_CONFIGURATION_BL                               BITS(5,6)              /*!< back-off limit */
#define ENET_MAC_CONFIGURATION_DR                               BIT(8)                 /*!< retry disable */
#define ENET_MAC_CONFIGURATION_DCRS                             BIT(9)                 /*!< disable carrier sense during transmission */
#define ENET_MAC_CONFIGURATION_DO                               BIT(10)                /*!< disable Receive Own */
#define ENET_MAC_CONFIGURATION_ECRSFD                           BIT(11)                /*!< enable carrier sense before transmission in full-duplex mode */
#define ENET_MAC_CONFIGURATION_LM                               BIT(12)                /*!< loopback mode */
#define ENET_MAC_CONFIGURATION_DM                               BIT(13)                /*!< duplex mode */
#define ENET_MAC_CONFIGURATION_FES                              BIT(14)                /*!< fast Ethernet speed */
#define ENET_MAC_CONFIGURATION_JE                               BIT(16)                /*!< jumbo packet enable */
#define ENET_MAC_CONFIGURATION_JD                               BIT(17)                /*!< fast ethernet speed */
#define ENET_MAC_CONFIGURATION_WD                               BIT(19)                /*!< watchdog disable */
#define ENET_MAC_CONFIGURATION_ACS                              BIT(20)                /*!< automatic pad or CRC stripping */
#define ENET_MAC_CONFIGURATION_CST                              BIT(21)                /*!< CRC stripping for type packets */
#define ENET_MAC_CONFIGURATION_S2KP                             BIT(22)                /*!< IEEE 802.3as support for 2K Packets */
#define ENET_MAC_CONFIGURATION_GPSLCE                           BIT(23)                /*!< giant packet size limit control enable */
#define ENET_MAC_CONFIGURATION_IPG                              BITS(24,26)            /*!< Inter-packet gap */
#define ENET_MAC_CONFIGURATION_IPC                              BIT(27)                /*!< IP frame checksum offload */
#define ENET_MAC_CONFIGURATION_SARC                             BITS(28,30)            /*!< source address insertion or replacement control */
#define ENET_MAC_CONFIGURATION_ARPEN                            BIT(31)                /*!< ARP offload enable */

/* ENET_MAC_EXT_CONFIGURATION */
#define ENET_MAC_EXT_CONFIGURATION_GPSL                         BITS(0,13)             /*!< giant packet size limit */
#define ENET_MAC_EXT_CONFIGURATION_DCRCC                        BIT(16)                /*!< disable CRC checking for received packets */
#define ENET_MAC_EXT_CONFIGURATION_SPEN                         BIT(17)                /*!< slow protocol detection enable */
#define ENET_MAC_EXT_CONFIGURATION_USP                          BIT(18)                /*!< unicast slow protocol packet detect */
#define ENET_MAC_EXT_CONFIGURATION_PDC                          BIT(19)                /*!< packet duplication control */
#define ENET_MAC_EXT_CONFIGURATION_EIPGEN                       BIT(24)                /*!< extended inter-packet gap enable */
#define ENET_MAC_EXT_CONFIGURATION_EIPG                         BITS(25,29)            /*!< extended inter-packet gap */
#define ENET_MAC_EXT_CONFIGURATION_APDIM                        BIT(30)                /*!< ARP packet drop if IP address mismatch */

/* ENET_MAC_PACKET_FILTER */
#define ENET_MAC_PACKET_FILTER_PR                               BIT(0)                /*!< promiscuous mode */
#define ENET_MAC_PACKET_FILTER_HUC                              BIT(1)                /*!< hash unicast filter */
#define ENET_MAC_PACKET_FILTER_HMC                              BIT(2)                /*!< hash multicast filter */
#define ENET_MAC_PACKET_FILTER_DAIF                             BIT(3)                /*!< destination address inverse filtering */
#define ENET_MAC_PACKET_FILTER_PM                               BIT(4)                /*!< multicast filter disable */
#define ENET_MAC_PACKET_FILTER_DBF                              BIT(5)                /*!< disable Broadcast Packets */
#define ENET_MAC_PACKET_FILTER_PCF                              BITS(6,7)             /*!< pass control packets */
#define ENET_MAC_PACKET_FILTER_SAIF                             BIT(8)                /*!< source address inverse filtering */
#define ENET_MAC_PACKET_FILTER_SAF                              BIT(9)                /*!< source address filter */
#define ENET_MAC_PACKET_FILTER_HPF                              BIT(10)               /*!< hash or perfect filter */
#define ENET_MAC_PACKET_FILTER_VTFE                             BIT(16)               /*!< VLAN tag filter enable */
#define ENET_MAC_PACKET_FILTER_IPFE                             BIT(20)               /*!< layer 3 and layer 4 filter enable */
#define ENET_MAC_PACKET_FILTER_DNTU                             BIT(21)               /*!< drop non-TCP/UDP over IP packets */
#define ENET_MAC_PACKET_FILTER_RA                               BIT(31)               /*!< receive all */

/* ENET_MAC_WATCHDOG_TIMEOUT */
#define ENET_MAC_WATCHDOG_TIMEOUT_WTO                           BITS(0,3)             /*!< watchdog timeout */
#define ENET_MAC_WATCHDOG_TIMEOUT_PWE                           BIT(8)                /*!< programmable watchdog enable */
#define ENET_MAC_WATCHDOG_TIMEOUT_JTO                           BITS(16,19)           /*!< jabber timeout */
#define ENET_MAC_WATCHDOG_TIMEOUT_PJE                           BIT(24)               /*!< programmable jabber enable */

/* ENET_MAC_HASH_TABLE_REG0 */
#define ENET_MAC_HASH_TABLE_REG0_HT31T0                         BITS(0,31)            /*!< MAC hash table first 32 bits */

/* ENET_MAC_HASH_TABLE_REG1 */
#define ENET_MAC_HASH_TABLE_REG1_HT63T32                        BITS(0,31)            /*!< MAC hash table second 32 bits */

/* ENET_MAC_VLAN_TAG_CTRL */
#define ENET_MAC_VLAN_TAG_CTRL_OB                               BIT(0)                /*!< operation busy */
#define ENET_MAC_VLAN_TAG_CTRL_CT                               BIT(1)                /*!< command type */
#define ENET_MAC_VLAN_TAG_CTRL_OFS                              BITS(2,3)             /*!< offset */
#define ENET_MAC_VLAN_TAG_CTRL_ETV                              BIT(16)               /*!< 12-bit VLAN tag comparison */
#define ENET_MAC_VLAN_TAG_CTRL_VTIM                             BIT(17)               /*!< VLAN tag inverse match enable */
#define ENET_MAC_VLAN_TAG_CTRL_ESVL                             BIT(18)               /*!< enable S-VLAN */
#define ENET_MAC_VLAN_TAG_CTRL_ERSVLM                           BIT(19)               /*!< enable receive S-VLAN match for VLAN hash filtering */
#define ENET_MAC_VLAN_TAG_CTRL_DOVLTC                           BIT(20)               /*!< disable VLAN type check for VLAN hash filtering */
#define ENET_MAC_VLAN_TAG_CTRL_EVLS                             BITS(21,22)           /*!< enable VLAN tag stripping on receive */
#define ENET_MAC_VLAN_TAG_CTRL_EVLRXS                           BIT(24)               /*!< enable VLAN tag in rx status */
#define ENET_MAC_VLAN_TAG_CTRL_VTHM                             BIT(25)               /*!< VLAN Tag hash table match enable */
#define ENET_MAC_VLAN_TAG_CTRL_EDVLP                            BIT(26)               /*!< enable double VLAN processing */
#define ENET_MAC_VLAN_TAG_CTRL_ERIVLT                           BIT(27)               /*!< enable inner VLAN tag comparison */
#define ENET_MAC_VLAN_TAG_CTRL_EIVLS                            BITS(28,29)           /*!< enable inner VLAN tag stripping on receive */
#define ENET_MAC_VLAN_TAG_CTRL_EIVLRXS                          BIT(31)               /*!< enable Inner VLAN tag in Rx status */

