sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_VLAN_TAG_DATA */
#define ENET_MAC_VLAN_TAG_DATA_VID                              BITS(0,15)            /*!< VLAN tag ID */
#define ENET_MAC_VLAN_TAG_DATA_VEN                              BIT(16)               /*!< VLAN tag enable */
#define ENET_MAC_VLAN_TAG_DATA_ETV                              BIT(17)               /*!< 12bits or 16bits VLAN comparison */
#define ENET_MAC_VLAN_TAG_DATA_DOVLTC                           BIT(18)               /*!< disable VLAN type comparison */
#define ENET_MAC_VLAN_TAG_DATA_ERSVLM                           BIT(19)               /*!< enable S-VLAN match for received frames */
#define ENET_MAC_VLAN_TAG_DATA_ERIVLT                           BIT(20)               /*!< enable inner VLAN tag comparison */
#define ENET_MAC_VLAN_TAG_DATA_DMACHEN                          BIT(24)               /*!< DMA channel number enable */
#define ENET_MAC_VLAN_TAG_DATA_DMACHN                           BIT(25)               /*!< DMA channel number */

/* ENET_MAC_VLAN_TAG_FILTERx */
#define ENET_MAC_VLAN_TAG_FILTERx_VID                          BITS(0,15)            /*!< VLAN tag ID */
#define ENET_MAC_VLAN_TAG_FILTERx_VEN                          BIT(16)               /*!< VLAN tag enable */
#define ENET_MAC_VLAN_TAG_FILTERx_ETV                          BIT(17)               /*!< 12bits or 16bits VLAN comparison */
#define ENET_MAC_VLAN_TAG_FILTERx_DOVLTC                       BIT(18)               /*!< disable VLAN type comparison */
#define ENET_MAC_VLAN_TAG_FILTERx_ERSVLM                       BIT(19)               /*!< enable S-VLAN match for received frames */
#define ENET_MAC_VLAN_TAG_FILTERx_ERIVLT                       BIT(20)               /*!< enable inner VLAN tag comparison */
#define ENET_MAC_VLAN_TAG_FILTERx_DMACHEN                      BIT(24)               /*!< DMA channel number enable */
#define ENET_MAC_VLAN_TAG_FILTERx_DMACHN                       BIT(25)               /*!< DMA channel number */

/* ENET_MAC_VLAN_HASH_TABLE */
#define ENET_MAC_VLAN_HASH_TABLE_VLHT                          BITS(0,15)            /*!< VLAN hash table */

/* ENET_MAC_VLAN_INCL */
#define ENET_MAC_VLAN_INCL_VLT                                 BITS(0,15)            /*!< VLAN tag for transmit packets */
#define ENET_MAC_VLAN_INCL_VLC                                 BITS(16,17)           /*!< VLAN tag control in transmit packets */
#define ENET_MAC_VLAN_INCL_VLP                                 BIT(18)               /*!< VLAN priority control */
#define ENET_MAC_VLAN_INCL_CSVL                                BIT(19)               /*!< C-VLAN or S-VLAN */
#define ENET_MAC_VLAN_INCL_VLTI                                BIT(20)               /*!< VLAN tag input */
#define ENET_MAC_VLAN_INCL_CBTI                                BIT(21)               /*!< channel based tag insertion */
#define ENET_MAC_VLAN_INCL_ADDR                                BIT(24)               /*!< address */
#define ENET_MAC_VLAN_INCL_RDWR                                BIT(30)               /*!< read write control */
#define ENET_MAC_VLAN_INCL_BUSY                                BIT(31)               /*!< busy */

/* ENET_MAC_VLAN_INCLx */
#define ENET_MAC_VLAN_INCLx_VLT                                BITS(0,15)            /*!< VLAN tag for transmit packets */
#define ENET_MAC_VLAN_INCLx_CSVL                               BIT(19)               /*!< C-VLAN or S-VLAN */

/* ENET_MAC_INNER_VLAN_INCL */
#define ENET_MAC_INNER_VLAN_INCL_VLT                           BITS(0,15)            /*!< VLAN tag for transmit packets */
#define ENET_MAC_INNER_VLAN_INCL_VLC                           BITS(16,17)           /*!< VLAN tag control in transmit packets */
#define ENET_MAC_INNER_VLAN_INCL_VLP                           BIT(18)               /*!< VLAN priority control */
#define ENET_MAC_INNER_VLAN_INCL_CSVL                          BIT(19)               /*!< C-VLAN or S-VLAN */
#define ENET_MAC_INNER_VLAN_INCL_VLTI                          BIT(20)               /*!< VLAN tag input */

/* ENET_MAC_Q0_TX_FLOW_CTRL */
#define ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA                       BIT(0)                /*!< flow control busy / back pressure activate */
#define ENET_MAC_Q0_TX_FLOW_CTRL_TFE                           BIT(1)                /*!< transmit flow control enable */
#define ENET_MAC_Q0_TX_FLOW_CTRL_PLT                           BITS(4,6)             /*!< pause low threshold */
#define ENET_MAC_Q0_TX_FLOW_CTRL_DZPQ                          BIT(7)                /*!< disable zero-quanta pause */
#define ENET_MAC_Q0_TX_FLOW_CTRL_PT                            BITS(16,31)           /*!< pause time */


/* ENET_MAC_RX_FLOW_CTRL */
#define ENET_MAC_RX_FLOW_CTRL_RFE                              BIT(0)                /*!< receive flow control enable */
#define ENET_MAC_RX_FLOW_CTRL_UP                               BIT(1)                /*!< unicast pause packet detect */

/* ENET_MAC_RXQ_CTRL4 */
#define ENET_MAC_RXQ_CTRL4_UFFQE                               BIT(0)                /*!< unicast address filter fail packets queuing enable */
#define ENET_MAC_RXQ_CTRL4_UFFQ                                BIT(1)                /*!< unicast address filter fail packets queue */
#define ENET_MAC_RXQ_CTRL4_MFFQE                               BIT(8)                /*!< multicast address filter fail packets queuing enable */
#define ENET_MAC_RXQ_CTRL4_MFFQ                                BIT(9)                /*!< multicast address filter fail packets queue */
#define ENET_MAC_RXQ_CTRL4_VFFQE                               BIT(16)               /*!< VLAN tag filter fail packets queuing enable */
#define ENET_MAC_RXQ_CTRL4_VFFQ                                BIT(17)               /*!< VLAN tag filter fail packets queue */
#define ENET_MAC_RXQ_CTRL4_UDC                                 BIT(31)               /*!< unicast packet duplication control */

/* ENET_MAC_RXQ_CTRL0 */
#define ENET_MAC_RXQ_CTRL0_RXQ0EN                              BITS(0,1)             /*!< receive queue 0 enable */
#define ENET_MAC_RXQ_CTRL0_RXQ1EN                              BITS(2,3)             /*!< receive queue 1 enable */

/* ENET_MAC_RXQ_CTRL1 */
#define ENET_MAC_RXQ_CTRL1_AVCPQ                               BITS(0,2)             /*!< AV untagged control packets queue */
#define ENET_MAC_RXQ_CTRL1_PTPQ                                BITS(4,6)             /*!< PTP packets queue */
#define ENET_MAC_RXQ_CTRL1_UPQ                                 BITS(12,14)           /*!< untagged packet queue */
#define ENET_MAC_RXQ_CTRL1_MCBCQ                               BITS(16,18)           /*!< multicast and broadcast queue */
#define ENET_MAC_RXQ_CTRL1_MCBCQEN                             BIT(20)               /*!< multicast and broadcast queue enable */
#define ENET_MAC_RXQ_CTRL1_TACPQE                              BIT(21)               /*!< tagged AV control packets queuing enable */
#define ENET_MAC_RXQ_CTRL1_TPQC                                BITS(22,23)           /*!< tagged PTP over ethernet packets queuing control */
#define ENET_MAC_RXQ_CTRL1_FPRQ                                BITS(24,26)           /*!< frame preemption residue queue */
#define ENET_MAC_RXQ_CTRL1_OMCBCQ                              BIT(28)               /*!< over-riding MC-BC queue priority select */
#define ENET_MAC_RXQ_CTRL1_TBRQE                               BIT(29)               /*!< type field based Rx queuing enable */

