sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_RXQ_CTRL2 */
#define ENET_MAC_RXQ_CTRL2_PSRQ0                               BITS(0,7)             /*!< priorities selected in the receive queue 0 */
#define ENET_MAC_RXQ_CTRL2_PSRQ1                               BITS(8,15)            /*!< priorities selected in the receive queue 1 */

/* ENET_MAC_INTERRUPT_STATUS */
#define ENET_MAC_INTERRUPT_STATUS_PHYIS                        BIT(3)                /*!< PHY interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_PMTIS                        BIT(4)                /*!< PMT interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_LPIIS                        BIT(5)                /*!< LPI interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MMCIS                        BIT(8)                /*!< MMC interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MMCRXIS                      BIT(9)                /*!< MMC receive interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MMCTXIS                      BIT(10)               /*!< MMC transmit interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MMCRXIPIS                    BIT(11)               /*!< MMC receive checksum offload interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_TSIS                         BIT(12)               /*!< timestamp interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_TXSTSIS                      BIT(13)               /*!< transmit interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_RXSTSIS                      BIT(14)               /*!< receive interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_FPEIS                        BIT(17)               /*!< frame preemption interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MDIOIS                       BIT(18)               /*!< MDIO transmit interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MFTIS                        BIT(19)               /*!< MMC FPE transmit interrupt status */
#define ENET_MAC_INTERRUPT_STATUS_MFRIS                        BIT(20)               /*!< MMC FPE receive interrupt status */

/* ENET_MAC_INTERRUPT_ENABLE */
#define ENET_MAC_INTERRUPT_ENABLE_PHYIE                        BIT(3)                /*!< PHY interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_PMTIE                        BIT(4)                /*!< PMT interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_LPIIE                        BIT(5)                /*!< LPI interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_TSIE                         BIT(12)               /*!< timestamp interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_TXSTSIE                      BIT(13)               /*!< transmit interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_RXSTSIE                      BIT(14)               /*!< receive interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_FPEIE                        BIT(17)               /*!< frame preemption interrupt enable */
#define ENET_MAC_INTERRUPT_ENABLE_MDIOIE                       BIT(18)               /*!< MDIO transmit interrupt enable */

/* ENET_MAC_RX_TX_STATUS */
#define ENET_MAC_RX_TX_STATUS_TJT                              BIT(0)                /*!< transmit jabber timeout */
#define ENET_MAC_RX_TX_STATUS_NCARR                            BIT(1)                /*!< no carrier */
#define ENET_MAC_RX_TX_STATUS_LCARR                            BIT(2)                /*!< loss of carrier */
#define ENET_MAC_RX_TX_STATUS_EXDEF                            BIT(3)                /*!< excessive deferral */
#define ENET_MAC_RX_TX_STATUS_LCOL                             BIT(4)                /*!< late collision */
#define ENET_MAC_RX_TX_STATUS_EXCOL                            BIT(5)                /*!< excessive collisions */
#define ENET_MAC_RX_TX_STATUS_RWT                              BIT(8)                /*!< receive watchdog timeout */

/* ENET_MAC_PMT_CONTROL_STATUS */
#define ENET_MAC_PMT_CONTROL_STATUS_PWRDWN                     BIT(0)                /*!< power down */
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN                   BIT(1)                /*!< magic packet enable */
#define ENET_MAC_PMT_CONTROL_STATUS_RWKPKTEN                   BIT(2)                /*!< wakeup frame enable */
#define ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD                   BIT(5)                /*!< magic packet received */
#define ENET_MAC_PMT_CONTROL_STATUS_RWKPRCVD                   BIT(6)                /*!< remote wake-up packet received */
#define ENET_MAC_PMT_CONTROL_STATUS_GLBLUCAST                  BIT(9)                /*!< global unicast */
#define ENET_MAC_PMT_CONTROL_STATUS_RWKPFE                     BIT(10)               /*!< remote wake-up packet forwarding enable */
#define ENET_MAC_PMT_CONTROL_STATUS_RWKPTR                     BITS(24,28)           /*!< remote wake-up FIFO pointer */
#define ENET_MAC_PMT_CONTROL_STATUS_RWKFILTRST                 BIT(31)               /*!< remote wake-up packet filter register pointer reset */

/* ENET_MAC_RWK_PACKET_FILTER */
#define ENET_MAC_RWK_PACKET_FILTER_WKUPFRMFTR                  BITS(0,31)            /*!< RWK packet filter */

/* ENET_MAC_RWK_FILTERi_BYTE_MASK */
#define ENET_MAC_RWK_FILTERi_BYTE_MASK_Filter0_Byte_Mask       BITS(0,31)            /*!< filter0 32-bit mask */

/* ENET_MAC_RWK_FILTER0123_COMMAND */
#define ENET_MAC_RWK_FILTER0123_COMMAND_Filter0_Command        BITS(0,3)             /*!< filter0 command */
#define ENET_MAC_RWK_FILTER0123_COMMAND_Filter1_Command        BITS(8,11)            /*!< filter1 command */
#define ENET_MAC_RWK_FILTER0123_COMMAND_Filter2_Command        BITS(16,19)           /*!< filter2 command */
#define ENET_MAC_RWK_FILTER0123_COMMAND_Filter3_Command        BITS(24,27)           /*!< filter3 command */

/* ENET_MAC_RWK_FILTER0123_OFFSET */
#define ENET_MAC_RWK_FILTER0123_OFFSET_Filter0_Offset          BITS(0,7)             /*!< filter0 offset */
#define ENET_MAC_RWK_FILTER0123_OFFSET_Filter1_Offset          BITS(8,15)            /*!< filter1 offset */
#define ENET_MAC_RWK_FILTER0123_OFFSET_Filter2_Offset          BITS(16,23)           /*!< filter2 offset */
#define ENET_MAC_RWK_FILTER0123_OFFSET_Filter3_Offset          BITS(24,31)           /*!< filter3 offset */

/* ENET_MAC_RWK_FILTERi_CRC */
#define ENET_MAC_RWK_FILTERi_CRC_Filter0_CRC                   BITS(0,15)             /*!< filter0 CRC-16 */
#define ENET_MAC_RWK_FILTERi_CRC_Filter1_CRC                   BITS(16,31)            /*!< filter1 CRC-16 */

/* ENET_MAC_LPI_CONTROL_STATUS */
#define ENET_MAC_LPI_CONTROL_STATUS_TLPIEN                     BIT(0)                 /*!< transmit LPI entry */
#define ENET_MAC_LPI_CONTROL_STATUS_TLPIEX                     BIT(1)                 /*!< transmit LPI exit */
#define ENET_MAC_LPI_CONTROL_STATUS_RLPIEN                     BIT(2)                 /*!< receive LPI entry */
#define ENET_MAC_LPI_CONTROL_STATUS_RLPIEX                     BIT(3)                 /*!< receive LPI exit */
#define ENET_MAC_LPI_CONTROL_STATUS_TLPIST                     BIT(8)                 /*!< transmit LPI state */
#define ENET_MAC_LPI_CONTROL_STATUS_RLPIST                     BIT(9)                 /*!< receive LPI state */
#define ENET_MAC_LPI_CONTROL_STATUS_LPIEN                      BIT(16)                /*!< LPI enable */
#define ENET_MAC_LPI_CONTROL_STATUS_PLS                        BIT(17)                /*!< PHY link status */
#define ENET_MAC_LPI_CONTROL_STATUS_LPITXA                     BIT(19)                /*!< LPI Tx automate */
#define ENET_MAC_LPI_CONTROL_STATUS_LPIATE                     BIT(20)                /*!< LPI timer enable */
#define ENET_MAC_LPI_CONTROL_STATUS_LPITCSE                    BIT(21)                /*!< LPI Tx clock stop enable */

/* ENET_MAC_LPI_TIMERS_CONTROL */
#define ENET_MAC_LPI_TIMERS_CONTROL_TWT                        BITS(0,15)             /*!< LPI TW timer */
#define ENET_MAC_LPI_TIMERS_CONTROL_LST                        BITS(16,25)            /*!< LPI LS timer */

