sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_LPI_ENTRY_TIMER */
#define ENET_MAC_LPI_ENTRY_TIMER_LPIET                         BITS(3,19)             /*!< LPI entry timer */

/* ENET_MAC_1US_TIC_COUNTER */
#define ENET_MAC_1US_TIC_COUNTER_TIC_1US_CNTR                  BITS(0,11)             /*!< 1US tic counter */

/* ENET_MAC_VERSION */
#define ENET_MAC_VERSION_IPVER                                 BITS(0,7)              /*!< IP version */
#define ENET_MAC_VERSION_CFGVER                                BITS(8,15)             /*!< IP configuration version */

/* ENET_MAC_DEBUG */
#define ENET_MAC_DEBUG_RPESTS                                  BIT(0)                 /*!< MAC MII receive protocol engine status */
#define ENET_MAC_DEBUG_RFCFCSTS                                BITS(1,2)              /*!< reset on read */
#define ENET_MAC_DEBUG_TPESTS                                  BIT(16)                /*!< MAC MII transmit protocol engine status */
#define ENET_MAC_DEBUG_TFCSTS                                  BITS(17,18)            /*!< MAC transmit packet controller status */

/* ENET_MAC_HW_FEATURE0 */
#define ENET_MAC_HW_FEATURE0_MIISEL                            BIT(0)                 /*!< 10 or 100 mbps support */
#define ENET_MAC_HW_FEATURE0_HDSEL                             BIT(2)                 /*!< half-duplex support */
#define ENET_MAC_HW_FEATURE0_VLHASH                            BIT(4)                 /*!< VLAN hash filter selected */
#define ENET_MAC_HW_FEATURE0_SMASEL                            BIT(5)                 /*!< SMA (MDIO) interface */
#define ENET_MAC_HW_FEATURE0_RWKSEL                            BIT(6)                 /*!< PMT remote wake-up packet enable */
#define ENET_MAC_HW_FEATURE0_MGKSEL                            BIT(7)                 /*!< PMT magic packet enable */
#define ENET_MAC_HW_FEATURE0_MMCSEL                            BIT(8)                 /*!< RMON module enable */
#define ENET_MAC_HW_FEATURE0_ARPOFFSEL                         BIT(9)                 /*!< ARP Offload Enabled */
#define ENET_MAC_HW_FEATURE0_TSSEL                             BIT(12)                /*!< IEEE 1588-2008 timestamp enabled */
#define ENET_MAC_HW_FEATURE0_EEESEL                            BIT(13)                /*!< energy efficient ethernet enabled */
#define ENET_MAC_HW_FEATURE0_TXCOESEL                          BIT(14)                /*!< transmit checksum offload enabled */
#define ENET_MAC_HW_FEATURE0_RXCOESEL                          BIT(16)                /*!< receive checksum offload */
#define ENET_MAC_HW_FEATURE0_ADDMACADRSEL                      BITS(18,22)            /*!< MAC addresses 1-31 selected */
#define ENET_MAC_HW_FEATURE0_MACADR32SEL                       BIT(23)                /*!< MAC addresses 32-63 selected */
#define ENET_MAC_HW_FEATURE0_MACADR64SEL                       BIT(24)                /*!< MAC addresses 64-127 selected */
#define ENET_MAC_HW_FEATURE0_TSSTSSEL                          BITS(25,26)            /*!< timestamp system time source */
#define ENET_MAC_HW_FEATURE0_SAVLANINS                         BIT(27)                /*!< source address or VLAN insertion enable */
#define ENET_MAC_HW_FEATURE0_ACTPHYSEL                         BITS(28,31)            /*!< active phy selected */

/* ENET_MAC_HW_FEATURE1 */
#define ENET_MAC_HW_FEATURE1_RXFIFOSIZE                        BITS(0,4)              /*!< MTL receive FIFO size */
#define ENET_MAC_HW_FEATURE1_SPRAM                             BIT(5)                 /*!< single port RAM enable */
#define ENET_MAC_HW_FEATURE1_TXFIFOSIZE                        BITS(6,10)             /*!< MTL transmit FIFO size */
#define ENET_MAC_HW_FEATURE1_OSTEN                             BIT(11)                /*!< one-Step timestamping enable */
#define ENET_MAC_HW_FEATURE1_PTOEN                             BIT(12)                /*!< PTP offload enable */
#define ENET_MAC_HW_FEATURE1_ADVTHWORD                         BIT(13)                /*!< IEEE 1588 high word register enable */
#define ENET_MAC_HW_FEATURE1_ADDR64                            BITS(14,15)            /*!< address width */
#define ENET_MAC_HW_FEATURE1_DCBEN                             BIT(16)                /*!< DCB feature enable */
#define ENET_MAC_HW_FEATURE1_SPHEN                             BIT(17)                /*!< PTP offload enable */
#define ENET_MAC_HW_FEATURE1_TSOEN                             BIT(18)                /*!< TCP segmentation offload enable */
#define ENET_MAC_HW_FEATURE1_DBGMEMA                           BIT(19)                /*!< DMA debug registers enable */
#define ENET_MAC_HW_FEATURE1_AVSEL                             BIT(20)                /*!< AV feature enable */
#define ENET_MAC_HW_FEATURE1_RAVSEL                            BIT(21)                /*!< Rx side only AV feature enable */
#define ENET_MAC_HW_FEATURE1_POUOST                            BIT(22)                /*!< one step for PTP over UDP/IP feature enable */
#define ENET_MAC_HW_FEATURE1_HASHTBLSZ                         BITS(24,25)            /*!< hash table size */
#define ENET_MAC_HW_FEATURE1_L3L4FNUM                          BITS(27,30)            /*!< total number of L3 or L4 filters */

/* ENET_MAC_HW_FEATURE2 */
#define ENET_MAC_HW_FEATURE2_RXQCNT                            BITS(0,3)              /*!< number of MTL receive queues */
#define ENET_MAC_HW_FEATURE2_TXQCNT                            BITS(6,9)              /*!< number of MTL transmit queues */
#define ENET_MAC_HW_FEATURE2_RXCHCNT                           BITS(12,15)            /*!< number of DMA receive channels */
#define ENET_MAC_HW_FEATURE2_RDCSZ                             BITS(16,17)            /*!< Rx DMA descriptor cache size in terms of 16-bytes descriptors */
#define ENET_MAC_HW_FEATURE2_TXCHCNT                           BITS(18,21)            /*!< number of DMA transmit channels */
#define ENET_MAC_HW_FEATURE2_TDCSZ                             BITS(22,23)            /*!< Tx DMA descriptor cache size in terms of 16-bytes descriptors */
#define ENET_MAC_HW_FEATURE2_PPSOUTNUM                         BITS(24,26)            /*!< number of PPS outputs */
#define ENET_MAC_HW_FEATURE2_AUXSNAPNUM                        BITS(28,30)            /*!< number of auxiliary snapshot inputs */

