sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_HW_FEATURE3 */
#define ENET_MAC_HW_FEATURE3_NRVF                              BITS(0,2)              /*!< number of extended VLAN tag filters enabled */
#define ENET_MAC_HW_FEATURE3_CBTISEL                           BIT(4)                 /*!< queue / Channel based VLAN tag insertion on Tx enable */
#define ENET_MAC_HW_FEATURE3_DVLAN                             BIT(5)                 /*!< double VLAN tag processing selected */
#define ENET_MAC_HW_FEATURE3_PDUPSEL                           BIT(9)                 /*!< broadcast / Multicast packet duplication */
#define ENET_MAC_HW_FEATURE3_FRPSEL                            BIT(10)                /*!< flexible receive parser selected */
#define ENET_MAC_HW_FEATURE3_FRPBS                             BITS(11,12)            /*!< flexible receive parser buffer size */
#define ENET_MAC_HW_FEATURE3_FRPES                             BITS(13,14)            /*!< flexible receive parser table entries size */
#define ENET_MAC_HW_FEATURE3_ESTSEL                            BIT(16)                /*!< enhancements to scheduled traffic enable */
#define ENET_MAC_HW_FEATURE3_ESTDEP                            BITS(17,19)            /*!< depth of the gate control list */
#define ENET_MAC_HW_FEATURE3_ESTWID                            BITS(20,21)            /*!< width of the time interval field in the gate control list */
#define ENET_MAC_HW_FEATURE3_FPESEL                            BIT(26)                /*!< frame preemption enable */
#define ENET_MAC_HW_FEATURE3_TBSSEL                            BIT(27)                /*!< time based scheduling enable */
#define ENET_MAC_HW_FEATURE3_ASP                               BITS(28,29)            /*!< automotive safety package */

/* ENET_MAC_DPP_FSM_INTERRUPT_STATUS */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_ATPES                BIT(0)                 /*!< application transmit interface parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES                BIT(2)                 /*!< read descriptor parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MPES                 BIT(3)                 /*!< MTL data path parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES               BIT(4)                 /*!< MTL TX status data path parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES                BIT(5)                 /*!< application receive interface data path parity error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_CWPES                BIT(6)                 /*!< CSR Write data path parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_TTES                 BIT(8)                 /*!< Tx FSM timeout error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_RTES                 BIT(9)                 /*!< Rx FSM timeout error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_ATES                 BIT(11)                /*!< APP FSM timeout error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_PTES                 BIT(12)                /*!< PTP FSM timeout error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES               BIT(16)                /*!< master read / write timeout error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES               BIT(24)                /*!< FSM state parity error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES              BIT(25)                /*!< MAC TBU data path parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES              BIT(26)                /*!< MAC TFC data path parity checker error status */
#define ENET_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES              BIT(27)                /*!< MTL RWC data path parity checker error Status */

/* ENET_MAC_FSM_CONTROL */
#define ENET_MAC_FSM_CONTROL_TMOUTEN                           BIT(0)                 /*!< FSM timeout feature */
#define ENET_MAC_FSM_CONTROL_PRTYEN                            BIT(1)                 /*!< FSM parity feature */
#define ENET_MAC_FSM_CONTROL_TTEIN                             BIT(8)                 /*!< Tx FSM timeout error injection */
#define ENET_MAC_FSM_CONTROL_RTEIN                             BIT(9)                 /*!< Rx FSM timeout error injection */
#define ENET_MAC_FSM_CONTROL_CTEIN                             BIT(10)                /*!< CSR FSM timeout error injection */
#define ENET_MAC_FSM_CONTROL_ATEIN                             BIT(11)                /*!< APP FSM timeout error jnjection */
#define ENET_MAC_FSM_CONTROL_PTEIN                             BIT(12)                /*!< PTP FSM timeout error injection */
#define ENET_MAC_FSM_CONTROL_TPEIN                             BIT(16)                /*!< Tx FSM parity error injection */
#define ENET_MAC_FSM_CONTROL_RPEIN                             BIT(17)                /*!< Rx FSM parity error injection */
#define ENET_MAC_FSM_CONTROL_CPEIN                             BIT(18)                /*!< CSR FSM one hot protection error injection */
#define ENET_MAC_FSM_CONTROL_APEIN                             BIT(19)                /*!< APP FSM parity error injection */
#define ENET_MAC_FSM_CONTROL_PPEIN                             BIT(20)                /*!< PTP FSM parity error injection */
#define ENET_MAC_FSM_CONTROL_TLGRNML                           BIT(24)                /*!< Tx large/normal mode select */
#define ENET_MAC_FSM_CONTROL_RLGRNML                           BIT(25)                /*!< Rx large/normal mode select */
#define ENET_MAC_FSM_CONTROL_CLGRNML                           BIT(26)                /*!< CSR large/normal mode select */
#define ENET_MAC_FSM_CONTROL_ALGRNML                           BIT(27)                /*!< APP large/normal mode select */
#define ENET_MAC_FSM_CONTROL_PLGRNML                           BIT(28)                /*!< PTP large/normal mode select */

/* ENET_MAC_FSM_ACT_TIMER */
#define ENET_MAC_FSM_ACT_TIMER_TMR                             BITS(0,9)              /*!< CSR clocks for 1us tic */
#define ENET_MAC_FSM_ACT_TIMER_NTMRMD                          BITS(16,19)            /*!< normal mode timeout value */
#define ENET_MAC_FSM_ACT_TIMER_LTMRMD                          BITS(20,23)            /*!< large mode timeout value */

/* ENET_MAC_MDIO_ADDRESS */
#define ENET_MAC_MDIO_ADDRESS_GB                               BIT(0)                 /*!< busy */
#define ENET_MAC_MDIO_ADDRESS_C45E                             BIT(1)                 /*!< Clause 45 phy enable */
#define ENET_MAC_MDIO_ADDRESS_GOC_0                            BIT(2)                 /*!< operation command 0 */
#define ENET_MAC_MDIO_ADDRESS_GOC_1                            BIT(3)                 /*!< operation command 1 */
#define ENET_MAC_MDIO_ADDRESS_SKAP                             BIT(4)                 /*!< skip address packet */
#define ENET_MAC_MDIO_ADDRESS_CR                               BITS(8,11)             /*!< CSR clock range */
#define ENET_MAC_MDIO_ADDRESS_NTC                              BITS(12,14)            /*!< number of trailing clocks */
#define ENET_MAC_MDIO_ADDRESS_RDA                              BITS(16,20)            /*!< PHY register */
#define ENET_MAC_MDIO_ADDRESS_PA                               BITS(21,25)            /*!< PHY address */
#define ENET_MAC_MDIO_ADDRESS_BTB                              BIT(26)                /*!< back to back transactions */
#define ENET_MAC_MDIO_ADDRESS_PSE                              BIT(27)                /*!< preamble suppression enable */

/* ENET_MAC_MDIO_DATA */
#define ENET_MAC_MDIO_DATA_GD                                  BITS(0,15)            /*!< PHY data */
#define ENET_MAC_MDIO_DATA_RA                                  BITS(16,31)           /*!< register address */

/* ENET_MAC_ARP_ADDRESS */
#define ENET_MAC_ARP_ADDRESS_ARPPA                             BITS(0,31)            /*!< ARP protocol address */

