sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_CSR_SW_CTRL */
#define ENET_MAC_CSR_SW_CTRL_RCWE                              BIT(0)                /*!< register clear on write 1 enable */
#define ENET_MAC_CSR_SW_CTRL_SEEN                              BIT(8)                /*!< slave error response enable */

/* ENET_MAC_FPE_CTRL_STS */
#define ENET_MAC_FPE_CTRL_STS_EFPE                            BIT(0)                /*!< enable Tx frame preemption */
#define ENET_MAC_FPE_CTRL_STS_SVER                            BIT(1)                /*!< send verify mPacket */
#define ENET_MAC_FPE_CTRL_STS_SRSP                            BIT(2)                /*!< send respond mPacket */
#define ENET_MAC_FPE_CTRL_STS_ARV                             BIT(3)                /*!< auto generate respond mPacket on receiving verify mPacket */
#define ENET_MAC_FPE_CTRL_STS_RVER                            BIT(16)               /*!< received verify frame */
#define ENET_MAC_FPE_CTRL_STS_RRSP                            BIT(17)               /*!< received respond frame */
#define ENET_MAC_FPE_CTRL_STS_TVER                            BIT(18)               /*!< transmitted verify frame */
#define ENET_MAC_FPE_CTRL_STS_TRSP                            BIT(19)               /*!< transmitted respond frame */

/* ENET_MAC_PRESN_TIME_NS */
#define ENET_MAC_PRESN_TIME_NS_MPTN                            BITS(0,31)            /*!< MAC 1722 presentation time in ns */

/* ENET_MAC_PRESN_TIME_UPDT */
#define ENET_MAC_PRESN_TIME_UPDT_MPTU                          BITS(0,31)            /*!< MAC 1722 presentation time update */

/* ENET_MAC_ADDRESS0_HIGH */
#define ENET_MAC_ADDRESS0_HIGH_ADDRHI                          BITS(0,15)            /*!< MAC Address0[47:32] */
#define ENET_MAC_ADDRESS0_HIGH_DCS                             BITS(16,17)           /*!< DMA channel select */
#define ENET_MAC_ADDRESS0_HIGH_AE                              BIT(31)               /*!< Address enable */

/* ENET_MAC_ADDRESS0_LOW */
#define ENET_MAC_ADDRESS0_LOW_ADDRLO                           BITS(0,31)            /*!< MAC Address0[31:0] */

/* ENET_MAC_ADDRESS1_HIGH */
#define ENET_MAC_ADDRESS1_HIGH_ADDRHI                          BITS(0,15)            /*!< MAC Address1[47:32] */
#define ENET_MAC_ADDRESS1_HIGH_DCS                             BITS(16,17)           /*!< DMA channel select */
#define ENET_MAC_ADDRESS1_HIGH_MBC                             BITS(24,29)           /*!< mask byte */
#define ENET_MAC_ADDRESS1_HIGH_SA                              BIT(30)               /*!< source address filter bit */
#define ENET_MAC_ADDRESS1_HIGH_AE                              BIT(31)               /*!< address filter enable */

/* ENET_MAC_ADDRESS1_LOW */
#define ENET_MAC_ADDRESS1_LOW_ADDRLO                           BITS(0,31)            /*!< MAC address1[31:0] */

/* ENET_MAC_ADDRESS2_HIGH */
#define ENET_MAC_ADDRESS2_HIGH_ADDRHI                          BITS(0,15)            /*!< MAC Address2[47:32] */
#define ENET_MAC_ADDRESS2_HIGH_DCS                             BITS(16,17)           /*!< DMA channel select */
#define ENET_MAC_ADDRESS2_HIGH_MBC                             BITS(24,29)           /*!< mask byte */
#define ENET_MAC_ADDRESS2_HIGH_SA                              BIT(30)               /*!< source address filter bit */
#define ENET_MAC_ADDRESS2_HIGH_AE                              BIT(31)               /*!< address filter enable */

/* ENET_MAC_ADDRESS2_LOW */
#define ENET_MAC_ADDRESS2_LOW_ADDRLO                           BITS(0,31)            /*!< MAC address2[31:0] */

/* ENET_MMC_CONTROL */
#define ENET_MMC_CONTROL_CNTRST                                BIT(0)                /*!< counters reset */
#define ENET_MMC_CONTROL_CNTSTOPRO                             BIT(1)                /*!< counter stop rollover */
#define ENET_MMC_CONTROL_RSTONRD                               BIT(2)                /*!< reset on read */
#define ENET_MMC_CONTROL_CNTFREEZ                              BIT(3)                /*!< MMC counter freeze */
#define ENET_MMC_CONTROL_CNTPRST                               BIT(4)                /*!< counters preset */
#define ENET_MMC_CONTROL_CNTPRSTLVL                            BIT(5)                /*!< full-half preset */
#define ENET_MMC_CONTROL_UCDBC                                 BIT(8)                /*!< update MMC counters for dropped broadcast packets */

/* ENET_MMC_RX_INTERRUPT */
#define ENET_MMC_RX_INTERRUPT_RXGBPKTIS                        BIT(0)                /*!< MMC receive good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXGBOCTIS                        BIT(1)                /*!< MMC receive good bad octet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXGOCTIS                         BIT(2)                /*!< MMC receive good octet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXBCGPIS                         BIT(3)                /*!< MMC receive broadcast good packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXMCGPIS                         BIT(4)                /*!< MMC receive multicast good packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXCRCERPIS                       BIT(5)                /*!< MMC receive CRC error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXALGNERPIS                      BIT(6)                /*!< MMC receive alignment error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXRUNTPIS                        BIT(7)                /*!< MMC receive runt packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXJABERPIS                       BIT(8)                /*!< MMC receive jabber error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXUSIZEGPIS                      BIT(9)                /*!< MMC receive undersize good packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXOSIZEGPIS                      BIT(10)               /*!< MMC receive oversize good packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX64OCTGBPIS                     BIT(11)               /*!< MMC receive 64 octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX65T127OCTGBPIS                 BIT(12)               /*!< MMC receive 65 to 127 octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX128T255OCTGBPIS                BIT(13)               /*!< MMC receive 128 to 255 octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX256T511OCTGBPIS                BIT(14)               /*!< MMC receive 256 to 511 octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS               BIT(15)               /*!< MMC receive 512 to 1023 octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS               BIT(16)               /*!< MMC receive 1024 to maximum octet good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXUCGPIS                         BIT(17)               /*!< MMC receive unicast good packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXLENERPIS                       BIT(18)               /*!< MMC receive length error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXORANGEPIS                      BIT(19)               /*!< MMC receive out of range error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXPAUSPIS                        BIT(20)               /*!< MMC receive pause packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXFOVPIS                         BIT(21)               /*!< MMC receive FIFO overflow packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXVLANGBPIS                      BIT(22)               /*!< MMC receive VLAN good bad packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXWDOGPIS                        BIT(23)               /*!< MMC receive watchdog error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXRCVERRPIS                      BIT(24)               /*!< MMC receive error packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXCTRLPIS                        BIT(25)               /*!< MMC receive control packet counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXLPIUSCIS                       BIT(26)               /*!< MMC receive LPI microsecond counter interrupt status */
#define ENET_MMC_RX_INTERRUPT_RXLPITRCIS                       BIT(27)               /*!< MMC receive LPI transition counter interrupt status */

/* ENET_MMC_TX_INTERRUPT */
#define ENET_MMC_TX_INTERRUPT_TXGBOCTIS                        BIT(0)                /*!< MMC transmit good bad octet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXGBPKTIS                        BIT(1)                /*!< MMC transmit good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXBCGPIS                         BIT(2)                /*!< MMC transmit broadcast good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXMCGPIS                         BIT(3)                /*!< MMC transmit multicast good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX64OCTGBPIS                     BIT(4)                /*!< MMC transmit 64 octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX65T127OCTGBPIS                 BIT(5)                /*!< MMC transmit 65 to 127 octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX128T255OCTGBPIS                BIT(6)                /*!< MMC transmit 128 to 255 octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX256T511OCTGBPIS                BIT(7)                /*!< MMC transmit 256 to 511 octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS               BIT(8)                /*!< MMC transmit 512 to 1023 octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS               BIT(9)                /*!< MMC transmit 1024 to Maximum octet good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXUCGBPIS                        BIT(10)               /*!< MMC transmit unicast good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXMCGBPIS                        BIT(11)               /*!< MMC transmit multicast good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXBCGBPIS                        BIT(12)               /*!< MMC transmit broadcast good bad packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXUFLOWERPIS                     BIT(13)               /*!< MMC transmit underflow error packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXSCOLGPIS                       BIT(14)               /*!< MMC transmit single collision good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXMCOLGPIS                       BIT(15)               /*!< MMC transmit multiple collision good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXDEFPIS                         BIT(16)               /*!< MMC transmit deferred packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXLATCOLPIS                      BIT(17)               /*!< MMC transmit late collision packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXEXCOLPIS                       BIT(18)               /*!< MMC transmit excessive collision packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXCARERPIS                       BIT(19)               /*!< MMC transmit carrier error packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXGOCTIS                         BIT(20)               /*!< MMC transmit good octet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXGPKTIS                         BIT(21)               /*!< MMC transmit good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXEXDEFPIS                       BIT(22)               /*!< MMC transmit excessive deferral packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXPAUSPIS                        BIT(23)               /*!< MMC transmit pause packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXVLANGPIS                       BIT(24)               /*!< MMC transmit VLAN good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXOSIZEGPIS                      BIT(25)               /*!< MMC transmit oversize good packet counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXLPIUSCIS                       BIT(26)               /*!< MMC transmit LPI microsecond counter interrupt status */
#define ENET_MMC_TX_INTERRUPT_TXLPITRCIS                       BIT(27)               /*!< MMC transmit LPI transition counter interrupt status */

/* ENET_MMC_RX_INTERRUPT_MASK */
#define ENET_MMC_RX_INTERRUPT_MASK_RXGBPKTIM                        BIT(0)                /*!< MMC receive good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXGBOCTIM                        BIT(1)                /*!< MMC receive good bad octet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXGOCTIM                         BIT(2)                /*!< MMC receive good octet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXBCGPIM                         BIT(3)                /*!< MMC receive broadcast good packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXMCGPIM                         BIT(4)                /*!< MMC receive multicast good packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXCRCERPIM                       BIT(5)                /*!< MMC receive CRC error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXALGNERPIM                      BIT(6)                /*!< MMC receive alignment error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXRUNTPIM                        BIT(7)                /*!< MMC receive runt packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXJABERPIM                       BIT(8)                /*!< MMC receive jabber error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM                      BIT(9)                /*!< MMC receive undersize good packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM                      BIT(10)               /*!< MMC receive oversize good packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM                     BIT(11)               /*!< MMC receive 64 octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM                 BIT(12)               /*!< MMC receive 65 to 127 octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM                BIT(13)               /*!< MMC receive 128 to 255 octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM                BIT(14)               /*!< MMC receive 256 to 511 octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM               BIT(15)               /*!< MMC receive 512 to 1023 octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM               BIT(16)               /*!< MMC receive 1024 to maximum octet good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXUCGPIM                         BIT(17)               /*!< MMC receive unicast good packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXLENERPIM                       BIT(18)               /*!< MMC receive length error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXORANGEPIM                      BIT(19)               /*!< MMC receive out of range error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXPAUSPIM                        BIT(20)               /*!< MMC receive pause packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXFOVPIM                         BIT(21)               /*!< MMC receive FIFO overflow packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM                      BIT(22)               /*!< MMC receive VLAN good bad packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXWDOGPIM                        BIT(23)               /*!< MMC receive watchdog error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM                      BIT(24)               /*!< MMC receive error packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXCTRLPIM                        BIT(25)               /*!< MMC receive control packet counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM                       BIT(26)               /*!< MMC receive LPI microsecond counter interrupt mask */
#define ENET_MMC_RX_INTERRUPT_MASK_RXLPITRCIM                       BIT(27)               /*!< MMC receive LPI transition counter interrupt mask */

/* ENET_MMC_TX_INTERRUPT_MASK */
#define ENET_MMC_TX_INTERRUPT_MASK_TXGBOCTIM                        BIT(0)                /*!< MMC transmit good bad octet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXGBPKTIM                        BIT(1)                /*!< MMC transmit good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXBCGPIM                         BIT(2)                /*!< MMC transmit broadcast good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXMCGPIM                         BIT(3)                /*!< MMC transmit multicast good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM                     BIT(4)                /*!< MMC transmit 64 octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM                 BIT(5)                /*!< MMC transmit 65 to 127 octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM                BIT(6)                /*!< MMC transmit 128 to 255 octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM                BIT(7)                /*!< MMC transmit 256 to 511 octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM               BIT(8)                /*!< MMC transmit 512 to 1023 octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TX1024TMAXOCTGBPIM               BIT(9)                /*!< MMC transmit 1024 to Maximum octet good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXUCGBPIM                        BIT(10)               /*!< MMC transmit unicast good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXMCGBPIM                        BIT(11)               /*!< MMC transmit multicast good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXBCGBPIM                        BIT(12)               /*!< MMC transmit broadcast good bad packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXUFLOWERPIM                     BIT(13)               /*!< MMC transmit underflow error packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM                       BIT(14)               /*!< MMC transmit single collision good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM                       BIT(15)               /*!< MMC transmit multiple collision good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXDEFPIM                         BIT(16)               /*!< MMC transmit deferred packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM                      BIT(17)               /*!< MMC transmit late collision packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM                       BIT(18)               /*!< MMC transmit excessive collision packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXCARERPIM                       BIT(19)               /*!< MMC transmit carrier error packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXGOCTIM                         BIT(20)               /*!< MMC transmit good octet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXGPKTIM                         BIT(21)               /*!< MMC transmit good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM                       BIT(22)               /*!< MMC transmit excessive deferral packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXPAUSPIM                        BIT(23)               /*!< MMC transmit pause packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXVLANGPIM                       BIT(24)               /*!< MMC transmit VLAN good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM                      BIT(25)               /*!< MMC transmit oversize good packet counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM                       BIT(26)               /*!< MMC transmit LPI microsecond counter interrupt mask */
#define ENET_MMC_TX_INTERRUPT_MASK_TXLPITRCIM                       BIT(27)               /*!< MMC transmit LPI transition counter interrupt mask */

/* ENET_TX_OCTET_COUNT_GOOD_BAD */
#define ENET_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB                        BITS(0,31)            /*!< transmit octet count good bad */

/* ENET_TX_PACKET_COUNT_GOOD_BAD */
#define ENET_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB                       BITS(0,31)            /*!< transmit packet count good bad */

/* ENET_TX_BROADCAST_PACKETS_GOOD */
#define ENET_TX_BROADCAST_PACKETS_GOOD_TXBCASTG                     BITS(0,31)            /*!< transmit broadcast packets good */

/* ENET_TX_MULTICAST_PACKETS_GOOD */
#define ENET_TX_MULTICAST_PACKETS_GOOD_TXMCASTG                     BITS(0,31)            /*!< transmit multicast packets good */

