sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_TX_64OCTET_PACKETS_GOOD_BAD */
#define ENET_TX_64OCTET_PACKETS_GOOD_BAD_TX64OCTGB                  BITS(0,31)            /*!< transmit 64 octets packets good bad */

/* ENET_TX_65TO127OCTET_PACKETS_GOOD_BAD */
#define ENET_TX_65TO127OCTET_PACKETS_GOOD_BAD_TX65_127OCTGB         BITS(0,31)            /*!< transmit 65 to 127 octets packets good bad */

/* ENET_TX_128TO255OCTET_PACKETS_GOOD_BAD */
#define ENET_TX_128TO255OCTET_PACKETS_GOOD_BAD_TX128_255OCTGB       BITS(0,31)            /*!< transmit 128 to 255 octets packets good bad */

/* ENET_TX_256TO511OCTET_PACKETS_GOOD_BAD */
#define ENET_TX_256TO511OCTET_PACKETS_GOOD_BAD_TX256_511OCTGB      BITS(0,31)            /*!< transmit 256 to 511 octets packets good bad */

/* ENET_TX_512TO1023OCTET_PACKETS_GOOD_BAD */
#define ENET_TX_512TO1023OCTET_PACKETS_GOOD_BAD_TX512_1023OCTGB    BITS(0,31)            /*!< transmit 512 to 1023 octets packets good bad */

/* ENET_TX_1024TOMAXOCTET_PACKETS_GOOD_BAD */
#define ENET_TX_1024TOMAXOCTET_PACKETS_GOOD_BAD_TX1024_MAXOCTGB    BITS(0,31)            /*!< transmit 1024 to max octets packets good bad */

/* ENET_TX_UNICAST_PACKETS_GOOD_BAD */
#define ENET_TX_UNICAST_PACKETS_GOOD_BAD_TXUCASTGB                 BITS(0,31)            /*!< transmit unicast packets good bad */

/* ENET_TX_MULTICAST_PACKETS_GOOD_BAD */
#define ENET_TX_MULTICAST_PACKETS_GOOD_BAD_TXMCASTGB               BITS(0,31)            /*!< transmit multicast packets good bad */

/* ENET_TX_BROADCAST_PACKETS_GOOD_BAD */
#define ENET_TX_BROADCAST_PACKETS_GOOD_BAD_TXBCASTGB               BITS(0,31)            /*!< transmit broadcast packets good bad */

/* ENET_TX_UNDERFLOW_ERROR_PACKETS */
#define ENET_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW                  BITS(0,31)            /*!< transmit underflow error packets */

/* ENET_TX_SINGLE_COLLISION_GOOD_PACKETS */
#define ENET_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG           BITS(0,31)            /*!< transmit single collision good packets */

/* ENET_TX_MULTIPLE_COLLISION_GOOD_PACKETS */
#define ENET_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG         BITS(0,31)            /*!< transmit multiple collision good packets */

/* ENET_TX_DEFERRED_PACKETS */
#define ENET_TX_DEFERRED_PACKETS_TXDEFRD                           BITS(0,31)            /*!< transmit deferred packets */

/* ENET_TX_LATE_COLLISION_PACKETS */
#define ENET_TX_LATE_COLLISION_PACKETS_TXLATECOL                   BITS(0,31)            /*!< transmit late collision packets */

/* ENET_TX_EXCESSIVE_COLLISION_PACKETS */
#define ENET_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL               BITS(0,31)            /*!< transmit excessive collision packets */

/* ENET_TX_CARRIER_ERROR_PACKETS */
#define ENET_TX_CARRIER_ERROR_PACKETS_TXCARR                       BITS(0,31)            /*!< transmit carrier error packets */

/* ENET_TX_OCTET_COUNT_GOOD */
#define ENET_TX_OCTET_COUNT_GOOD_TXOCTG                            BITS(0,31)            /*!< transmit octet count good */

/* ENET_TX_PACKET_COUNT_GOOD */
#define ENET_TX_PACKET_COUNT_GOOD_TXPKTG                           BITS(0,31)            /*!< transmit packet count good */

/* ENET_TX_EXCESSIVE_DEFERRAL_ERROR */
#define ENET_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF                  BITS(0,31)            /*!< transmit excessive deferral error */

/* ENET_TX_PAUSE_PACKETS */
#define ENET_TX_PAUSE_PACKETS_TXPAUSE                              BITS(0,31)            /*!< transmit pause packets */

/* ENET_TX_VLAN_PACKETS_GOOD */
#define ENET_TX_VLAN_PACKETS_GOOD_TXVLANG                          BITS(0,31)            /*!< transmit VLAN packets good */

/* ENET_TX_OSIZE_PACKETS_GOOD */
#define ENET_TX_OSIZE_PACKETS_GOOD_TXOSIZG                         BITS(0,31)            /*!< transmit oversize packets good */

/* ENET_RX_PACKETS_COUNT_GOOD_BAD */
#define ENET_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB                     BITS(0,31)            /*!< receive packets count good bad */

/* ENET_RX_OCTET_COUNT_GOOD_BAD */
#define ENET_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB                       BITS(0,31)            /*!< receive octet count good bad */

/* ENET_RX_OCTET_COUNT_GOOD */
#define ENET_RX_OCTET_COUNT_GOOD_RXOCTG                            BITS(0,31)            /*!< receive octet count good */

/* ENET_RX_BROADCAST_PACKETS_GOOD */
#define ENET_RX_BROADCAST_PACKETS_GOOD_RXBCASTG                    BITS(0,31)            /*!< receive broadcast packets good */

/* ENET_RX_MULTICAST_PACKETS_GOOD */
#define ENET_RX_MULTICAST_PACKETS_GOOD_RXMCASTG                    BITS(0,31)            /*!< receive multicast packets good */

/* ENET_RX_CRC_ERROR_PACKETS */
#define ENET_RX_CRC_ERROR_PACKETS_RXCRCERR                         BITS(0,31)            /*!< receive crc error packets */

/* ENET_RX_ALIGNMENT_ERROR_PACKETS */
#define ENET_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR                  BITS(0,31)            /*!< receive alignment error packets */

/* ENET_RX_RUNT_ERROR_PACKETS */
#define ENET_RX_RUNT_ERROR_PACKETS_RXRUNTERR                       BITS(0,31)            /*!< receive runt error packets */

/* ENET_RX_JABBER_ERROR_PACKETS */
#define ENET_RX_JABBER_ERROR_PACKETS_RXJABERR                      BITS(0,31)            /*!< receive jabber error packets */

/* ENET_RX_UNDERSIZE_PACKETS_GOOD */
#define ENET_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG                  BITS(0,31)            /*!< receive undersize packets good */

/* ENET_RX_OVERSIZE_PACKETS_GOOD */
#define ENET_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG                    BITS(0,31)            /*!< receive oversize packets good */

/* ENET_RX_64OCTET_PACKETS_GOOD_BAD */
#define ENET_RX_64OCTET_PACKETS_GOOD_BAD_RX64OCTGB                 BITS(0,31)            /*!< receive 64 octets packets god bad */

/* ENET_RX_65TO127OCTET_PACKETS_GOOD_BAD */
#define ENET_RX_65TO127OCTET_PACKETS_GOOD_BAD_RX65_127OCTGB        BITS(0,31)            /*!< receive 65-127 octets packets good bad bad */

/* ENET_RX_128TO255OCTET_PACKETS_GOOD_BAD */
#define ENET_RX_128TO255OCTET_PACKETS_GOOD_BAD_RX128_255OCTGB      BITS(0,31)            /*!< receive 128-255 octets packets good bad bad */

