sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_RX_256TO511OCTET_PACKETS_GOOD_BAD */
#define ENET_RX_256TO511OCTET_PACKETS_GOOD_BAD_RX256_511OCTGB      BITS(0,31)            /*!< receive 256-511 octets packets good bad bad */

/* ENET_RX_512TO1023OCTET_PACKETS_GOOD_BAD */
#define ENET_RX_512TO1023OCTET_PACKETS_GOOD_BAD_RX512_1023OCTGB    BITS(0,31)            /*!< receive 512-1023 octets packets good bad bad */

/* ENET_RX_1024TOMAXOCTET_PACKETS_GOOD_BAD */
#define ENET_RX_1024TOMAXOCTET_PACKETS_GOOD_BAD_RX1024_MAXOCTGB    BITS(0,31)            /*!< receive 1024 to max octets packets good bad bad */

/* ENET_RX_UNICAST_PACKETS_GOOD */
#define ENET_RX_UNICAST_PACKETS_GOOD_RXUCASTG                      BITS(0,31)            /*!< receive unicast packets good */

/* ENET_RX_LENGTH_ERROR_PACKETS */
#define ENET_RX_LENGTH_ERROR_PACKETS_RXLENERR                      BITS(0,31)            /*!< receive length error packets */

/* ENET_RX_OUT_OF_RANGE_TYPE_PACKETS */
#define ENET_RX_OUT_OF_RANGE_TYPE_PACKETS_RXOUTOFRNG               BITS(0,31)            /*!< receive out of range type packets */

/* ENET_RX_PAUSE_PACKETS */
#define ENET_RX_PAUSE_PACKETS_RXPAUSEPKT                           BITS(0,31)            /*!< receive pause packets */

/* ENET_RX_FIFO_OVERFLOW_PACKETS */
#define ENET_RX_FIFO_OVERFLOW_PACKETS_RXFIFOOVFL                   BITS(0,31)            /*!< receive FIFO overflow packets */

/* ENET_RX_VLAN_PACKETS_GOOD_BAD */
#define ENET_RX_VLAN_PACKETS_GOOD_BAD_RXVLANPKTGB                  BITS(0,31)            /*!< receive VLAN packets god bad */

/* ENET_RX_WATCHDOG_ERROR_PACKETS */
#define ENET_RX_WATCHDOG_ERROR_PACKETS_RXWDGERR                    BITS(0,31)            /*!< receive watchdog error packets */

/* ENET_RX_ERROR_PACKETS */
#define ENET_RX_ERROR_PACKETS_RXRCVERR                             BITS(0,31)            /*!< receive error packets */

/* ENET_RX_CONTROL_PACKETS_GOOD */
#define ENET_RX_CONTROL_PACKETS_GOOD_RXCTRLG                      BITS(0,31)            /*!< receive control packets good */

/* ENET_TX_LPI_USEC_CNTR */
#define ENET_TX_LPI_USEC_CNTR_TXLPIUSC                            BITS(0,31)            /*!< transmit LPI microseconds counter */

/* ENET_TX_LPI_TRAN_CNTR */
#define ENET_TX_LPI_TRAN_CNTR_TXLPITRC                            BITS(0,31)            /*!< transmit LPI transition counter */

/* ENET_RX_LPI_USEC_CNTR */
#define ENET_RX_LPI_USEC_CNTR_RXLPIUSC                            BITS(0,31)            /*!< receive LPI microseconds counter */

/* ENET_RX_LPI_TRAN_CNTR */
#define ENET_RX_LPI_TRAN_CNTR_RXLPITRC                            BITS(0,31)            /*!< receive LPI transition counter */

/* ENET_MMC_IPC_RX_INTERRUPT_MASK */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GPIM                 BIT(0)                /*!< MMC receive IPV4 good packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HERPIM               BIT(1)                /*!< MMC receive IPV4 header error packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYPIM             BIT(2)                /*!< MMC receive IPV4 no payload packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGPIM              BIT(3)                /*!< MMC receive IPV4 fragmented packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLPIM             BIT(4)                /*!< MMC receive IPV4 UDP checksum disabled packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GPIM                 BIT(5)                /*!< MMC receive IPV6 good packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HERPIM               BIT(6)                /*!< MMC receive IPV6 header error packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYPIM             BIT(7)                /*!< MMC receive IPV6 no payload packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGPIM                  BIT(8)                /*!< MMC receive UDP good packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPERPIM                 BIT(9)                /*!< MMC receive UDP error packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGPIM                  BIT(10)               /*!< MMC receive TCP good packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPERPIM                 BIT(11)               /*!< MMC receive TCP error packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGPIM                 BIT(12)               /*!< MMC receive ICMP good packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPERPIM                BIT(13)               /*!< MMC receive ICMP error packet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4GOIM                 BIT(16)               /*!< MMC receive IPV4 good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4HEROIM               BIT(17)               /*!< MMC receive IPV4 good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4NOPAYOIM             BIT(18)               /*!< MMC receive IPV4 no payload octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4FRAGOIM              BIT(19)               /*!< MMC receive IPV4 fragmented octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV4UDSBLOIM             BIT(20)               /*!< MMC receive IPV4 UDP checksum disabled octett counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6GOIM                 BIT(21)               /*!< MMC receive IPV6 good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6HEROIM               BIT(22)               /*!< MMC receive IPV6 header error octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYOIM             BIT(23)               /*!< MMC receive IPV6 no payload octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGOIM                  BIT(24)               /*!< MMC receive UDP good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXUDPEROIM                 BIT(25)               /*!< MMC receive UDP error octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGOIM                  BIT(26)               /*!< MMC receive TCP good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXTCPEROIM                 BIT(27)               /*!< MMC receive TCP error octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGOIM                 BIT(28)               /*!< MMC receive ICMP good octet counter interrupt mask */
#define ENET_MMC_IPC_RX_INTERRUPT_MASK_RXICMPEROIM                BIT(29)               /*!< MMC receive ICMP error octet counter interrupt mask */

/* ENET_MMC_IPC_RX_INTERRUPT */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4GPIS                 BIT(0)                /*!< MMC receive IPV4 good packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4HERPIS               BIT(1)                /*!< MMC receive IPV4 header error packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYPIS             BIT(2)                /*!< MMC receive IPV4 no payload packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGPIS              BIT(3)                /*!< MMC receive IPV4 fragmented packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLPIS             BIT(4)                /*!< MMC receive IPV4 UDP checksum disabled packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6GPIS                 BIT(5)                /*!< MMC receive IPV6 good packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6HERPIS               BIT(6)                /*!< MMC receive IPV6 header error packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYPIS             BIT(7)                /*!< MMC receive IPV6 no payload packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXUDPGPIS                  BIT(8)                /*!< MMC receive UDP good packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXUDPERPIS                 BIT(9)                /*!< MMC receive UDP error packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXTCPGPIS                  BIT(10)               /*!< MMC receive TCP good packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXTCPERPIS                 BIT(11)               /*!< MMC receive TCP error packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXICMPGPIS                 BIT(12)               /*!< MMC receive ICMP good packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXICMPERPIS                BIT(13)               /*!< MMC receive ICMP error packet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4GOIS                 BIT(16)               /*!< MMC receive IPV4 good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4HEROIS               BIT(17)               /*!< MMC receive IPV4 good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYOIS             BIT(18)               /*!< MMC receive IPV4 no payload octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGOIS              BIT(19)               /*!< MMC receive IPV4 fragmented octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLOIS             BIT(20)               /*!< MMC receive IPV4 UDP checksum disabled octett counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6GOIS                 BIT(21)               /*!< MMC receive IPV6 good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6HEROIS               BIT(22)               /*!< MMC receive IPV6 header error octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYOIS             BIT(23)               /*!< MMC receive IPV6 no payload octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXUDPGOIS                  BIT(24)               /*!< MMC receive UDP good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXUDPEROIS                 BIT(25)               /*!< MMC receive UDP error octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXTCPGOIS                  BIT(26)               /*!< MMC receive TCP good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXTCPEROIS                 BIT(27)               /*!< MMC receive TCP error octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXICMPGOIS                 BIT(28)               /*!< MMC receive ICMP good octet counter interrupt status */
#define ENET_MMC_IPC_RX_INTERRUPT_RXICMPEROIS                BIT(29)               /*!< MMC receive ICMP error octet counter interrupt status */

