sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_RXIPV4_GOOD_PACKETS */
#define ENET_RXIPV4_GOOD_PACKETS_RXIPV4GDPKT                 BITS(0,31)            /*!< receive ipv4 good packets */

/* ENET_RXIPV4_HEADER_ERROR_PACKETS */
#define ENET_RXIPV4_HEADER_ERROR_PACKETS_RXIPV4HDRERRPKT     BITS(0,31)            /*!< receive ipv4 header errors packets */

/* ENET_RXIPV4_NO_PAYLOAD_PACKETS */
#define ENET_RXIPV4_NO_PAYLOAD_PACKETS_RXIPV4NOPAYPKT        BITS(0,31)            /*!< receive ipv4 no payload packets */

/* ENET_RXIPV4_FRAGMENTED_PACKETS */
#define ENET_RXIPV4_FRAGMENTED_PACKETS_RXIPV4FRAGPKT         BITS(0,31)            /*!< receive fragmented ipv4 packets */

/* ENET_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS */
#define ENET_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_RXIPV4UDSBLPKT BITS(0,31)        /*!< receive ipv4 udp checksum disable packets */

/* ENET_RXIPV6_GOOD_PACKETS */
#define ENET_RXIPV6_GOOD_PACKETS_RXIPV6GDPKT                 BITS(0,31)            /*!< receive ipv6 good packets */

/* ENET_RXIPV6_HEADER_ERROR_PACKETS */
#define ENET_RXIPV6_HEADER_ERROR_PACKETS_RXIPV6HDRERRPKT     BITS(0,31)            /*!< receive ipv6 header errors packets */

/* ENET_RXIPV6_NO_PAYLOAD_PACKETS */
#define ENET_RXIPV6_NO_PAYLOAD_PACKETS_RXIPV6NOPAYPKT        BITS(0,31)            /*!< receive ipv6 no payload packets */

/* ENET_RXUDP_GOOD_PACKETS */
#define ENET_RXUDP_GOOD_PACKETS_RXUDPGDPKT                   BITS(0,31)            /*!< receive udp packets good */

/* ENET_RXUDP_ERROR_PACKETS */
#define ENET_RXUDP_ERROR_PACKETS_RXUDPERRPKT                 BITS(0,31)            /*!< receive udp checksum errors packets */

/* ENET_RXTCP_GOOD_PACKETS */
#define ENET_RXTCP_GOOD_PACKETS_RXTCPGDPKT                   BITS(0,31)            /*!< receive tcp packets good */

/* ENET_RXTCP_ERROR_PACKETS */
#define ENET_RXTCP_ERROR_PACKETS_RXTCPERRPKT                 BITS(0,31)            /*!< receive tcp checksum errors packets */

/* ENET_RXICMP_GOOD_PACKETS */
#define ENET_RXICMP_GOOD_PACKETS_RXICMPGDPKT                 BITS(0,31)            /*!< receive icmp packets good */

/* ENET_RXICMP_ERROR_PACKETS */
#define ENET_RXICMP_ERROR_PACKETS_RXICMPERRPKT               BITS(0,31)            /*!< receive icmp checksum errors packets */

/* ENET_RXIPV4_GOOD_OCTETS */
#define ENET_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT                  BITS(0,31)            /*!< receive ipv4 good octets */

/* ENET_RXIPV4_HEADER_ERROR_OCTETS */
#define ENET_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT      BITS(0,31)            /*!< receive ipv4 header errors octets */

/* ENET_RXIPV4_NO_PAYLOAD_OCTETS */
#define ENET_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT         BITS(0,31)            /*!< receive ipv4 no payload octets */

/* ENET_RXIPV4_FRAGMENTED_OCTETS */
#define ENET_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT          BITS(0,31)            /*!< receive fragmented ipv4 octets */

/* ENET_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS */
#define ENET_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS_RXIPV4UDSBLOCT BITS(0,31)            /*!< receive ipv4 udp checksum disable octets */

/* ENET_RXIPV6_GOOD_OCTETS */
#define ENET_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT                  BITS(0,31)            /*!< receive ipv6 good octets */

/* ENET_RXIPV6_HEADER_ERROR_OCTETS */
#define ENET_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT      BITS(0,31)            /*!< receive ipv6 header errors octets */

/* ENET_RXIPV6_NO_PAYLOAD_OCTETS */
#define ENET_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT         BITS(0,31)            /*!< receive ipv6 no payload octets */

/* ENET_RXUDP_GOOD_OCTETS */
#define ENET_RXUDP_GOOD_OCTETS_RXUDPGDOCT                   BITS(0,31)            /*!< receive udp good octets */

/* ENET_RXUDP_ERROR_OCTETS */
#define ENET_RXUDP_ERROR_OCTETS_RXUDPERROCT                 BITS(0,31)            /*!< receive udp checksum errors octets */

/* ENET_RXTCP_GOOD_OCTETS */
#define ENET_RXTCP_GOOD_OCTETS_RXTCPGDOCT                   BITS(0,31)            /*!< receive tcp good octets */

/* ENET_RXTCP_ERROR_OCTETS */
#define ENET_RXTCP_ERROR_OCTETS_RXTCPERROCT                 BITS(0,31)            /*!< receive tcp checksum errors octets */

/* ENET_RXICMP_GOOD_OCTETS */
#define ENET_RXICMP_GOOD_OCTETS_RXICMPGDOCT                 BITS(0,31)            /*!< receive icmp good octets */

/* ENET_RXICMP_ERROR_PACKETS */
#define ENET_RXICMP_ERROR_OCTETS_RXICMPERROCT               BITS(0,31)            /*!< receive icmp checksum errors octets */

/* ENET_MMC_FPE_TX_INTERRUPT */
#define ENET_MMC_FPE_TX_INTERRUPT_FCIS                      BIT(0)                /*!< MMC Tx FPE fragment counter interrupt status */
#define ENET_MMC_FPE_TX_INTERRUPT_HRCIS                     BIT(1)                /*!< MMC Tx hold request counter interrupt status */

/* ENET_MMC_FPE_TX_INTERRUPT_MASK */
#define ENET_MMC_FPE_TX_INTERRUPT_MASK_FCIM                 BIT(0)                /*!< MMC Tx FPE fragment counter interrupt mask */
#define ENET_MMC_FPE_TX_INTERRUPT_MASK_HRCIM                BIT(1)                /*!< MMC Tx hold request counter interrupt mask */

/* ENET_MMC_FPE_TX_FRAGMENT_CNTR */
#define ENET_MMC_FPE_TX_FRAGMENT_CNTR_TXFFC                 BITS(0,31)            /*!< Tx FPE fragment counter */

/* ENET_MMC_TX_HOLD_REQ_CNTR */
#define ENET_MMC_TX_HOLD_REQ_CNTR_TXHRC                    BITS(0,31)             /*!< Tx hold request counter */

/* ENET_MMC_FPE_RX_INTERRUPT */
#define ENET_MMC_FPE_RX_INTERRUPT_PAECIS                    BIT(0)                /*!< MMC Rx packet assembly error counter interrupt status */
#define ENET_MMC_FPE_RX_INTERRUPT_PSECIS                    BIT(1)                /*!< MMC Rx packet SMD error counter interrupt status */
#define ENET_MMC_FPE_RX_INTERRUPT_PAOCIS                    BIT(2)                /*!< MMC Rx packet assembly ok counter interrupt status */
#define ENET_MMC_FPE_RX_INTERRUPT_FCIS                      BIT(3)                /*!< MMC Rx FPE fragment counter interrupt status */

/* ENET_MMC_FPE_RX_INTERRUPT_MASK */
#define ENET_MMC_FPE_RX_INTERRUPT_MASK_PAECIM               BIT(0)                /*!< MMC Rx packet assembly error counter interrupt mask */
#define ENET_MMC_FPE_RX_INTERRUPT_MASK_PSECIM               BIT(1)                /*!< MMC Rx packet SMD error counter interrupt mask */
#define ENET_MMC_FPE_RX_INTERRUPT_MASK_PAOCIM               BIT(2)                /*!< MMC Rx packet assembly ok counter interrupt mask */
#define ENET_MMC_FPE_RX_INTERRUPT_MASK_FCIM                 BIT(3)                /*!< MMC Rx FPE fragment counter interrupt mask */

