sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MMC_RX_PACKETS_ASSEMBLY_ERR_CNTR */
#define ENET_MMC_RX_PACKETS_ASSEMBLY_ERR_CNTR_PAEC          BITS(0,31)             /*!< MMC receive packet assembly error counter */

/* ENET_MMC_RX_PACKETS_SMD_ERR_CNTR */
#define ENET_MMC_RX_PACKETS_SMD_ERR_CNTR_PSEC               BITS(0,31)             /*!< MMC receive packet SMD error counter */

/* ENET_MMC_RX_PACKETS_ASSEMBLY_OK_CNTR */
#define ENET_MMC_RX_PACKETS_ASSEMBLY_OK_CNTR_PAOC           BITS(0,31)             /*!< MMC receive packet assembly ok counter */

/* ENET_MMC_RX_FPE_FRAGMENT_CNTR */
#define ENET_MMC_RX_FPE_FRAGMENT_CNTR_FFC                   BITS(0,31)             /*!< MMC receive FPE fragment counter */

/* ENET_MAC_L3_L4_CONTROL */
#define ENET_MAC_L3_L4_CONTROL_L3PEN0                       BIT(0)                /*!< layer 3 protocol enable */
#define ENET_MAC_L3_L4_CONTROL_L3SAM0                       BIT(2)                /*!< layer 3 IP SA match enable */
#define ENET_MAC_L3_L4_CONTROL_L3SAIM0                      BIT(3)                /*!< layer 3 IP SA inverse match enable */
#define ENET_MAC_L3_L4_CONTROL_L3DAM0                       BIT(4)                /*!< layer 3 IP DA match enable */
#define ENET_MAC_L3_L4_CONTROL_L3DAIM0                      BIT(5)                /*!< layer 3 IP DA inverse match enable */
#define ENET_MAC_L3_L4_CONTROL_L3HSBM0                      BITS(6,10)            /*!< layer 3 IP SA higher bits match */
#define ENET_MAC_L3_L4_CONTROL_L3HDBM0                      BITS(11,15)           /*!< layer 3 IP DA higher bits match */
#define ENET_MAC_L3_L4_CONTROL_L4PEN0                       BIT(16)               /*!< layer 4 protocol enable */
#define ENET_MAC_L3_L4_CONTROL_L4SPM0                       BIT(18)               /*!< layer 4 source port match enable */
#define ENET_MAC_L3_L4_CONTROL_L4SPIM0                      BIT(19)               /*!< layer 4 source port inverse match enable */
#define ENET_MAC_L3_L4_CONTROL_L4DPM0                       BIT(20)               /*!< layer 4 destination port match enable */
#define ENET_MAC_L3_L4_CONTROL_L4DPIM0                      BIT(21)               /*!< layer 4 destination port inverse match enable */
#define ENET_MAC_L3_L4_CONTROL_DMCHN0                       BIT(24)               /*!< DMA channel number */
#define ENET_MAC_L3_L4_CONTROL_DMCHEN0                      BIT(28)               /*!< DMA channel select enable */

/* ENET_MAC_LAYER4_ADDRESS */
#define ENET_MAC_LAYER4_ADDRESS_L4SP0                       BITS(0,15)            /*!< layer 4 source port number field */
#define ENET_MAC_LAYER4_ADDRESS_L4DP0                       BITS(16,31)           /*!< layer 4 destination port number field */

/* ENET_MAC_LAYER3_ADDR0_REG */
#define ENET_MAC_LAYER3_ADDR0_REG_L3A00                     BITS(0,31)            /*!< layer 3 address 0 field */

/* ENET_MAC_LAYER3_ADDR1_REG */
#define ENET_MAC_LAYER3_ADDR1_REG_L3A10                     BITS(0,31)            /*!< layer 3 address 1 field */

/* ENET_MAC_LAYER3_ADDR2_REG */
#define ENET_MAC_LAYER3_ADDR2_REG_L3A20                     BITS(0,31)            /*!< layer 3 address 2 field */

/* ENET_MAC_LAYER3_ADDR3_REG */
#define ENET_MAC_LAYER3_ADDR3_REG_L3A30                     BITS(0,31)            /*!< layer 3 address 3 field */

/* ENET_MAC_INDIR_ACCESS_CTRL */
#define ENET_MAC_INDIR_ACCESS_CTRL_OB                       BIT(0)                /*!< operation busy */
#define ENET_MAC_INDIR_ACCESS_CTRL_COM                      BIT(1)                /*!< command type */
#define ENET_MAC_INDIR_ACCESS_CTRL_AUTO                     BIT(5)                /*!< auto increment */
#define ENET_MAC_INDIR_ACCESS_CTRL_AOFF                     BITS(8,15)            /*!< address offset */
#define ENET_MAC_INDIR_ACCESS_CTRL_MSEL                     BITS(16,19)           /*!< mode select */
#define ENET_MAC_INDIR_ACCESS_CTRL_SNPS_R                   BIT(31)               /*!< testable: untestable */

/* ENET_MAC_INDIR_ACCESS_DATA */
#define ENET_MAC_INDIR_ACCESS_DATA_DATA                     BITS(0,31)            /*!< MAC indirect access data */

/* ENET_MAC_TMRQ_REGS */
#define ENET_MAC_TMRQ_REGS_TYP                              BITS(0,15)            /*!< type field value */
#define ENET_MAC_TMRQ_REGS_TMRQ                             BITS(16,18)           /*!< type match Rx queue number */
#define ENET_MAC_TMRQ_REGS_PFEX                             BIT(20)               /*!< preemption or express packet */

/* ENET_MAC_TIMESTAMP_CONTROL */
#define MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(regval)           (BITS(16,17) & ((uint32_t)(regval) << 16))    /*!< write value to ENET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL bit field */

#define ENET_MAC_TIMESTAMP_CONTROL_TSENA                    BIT(0)                /*!< enable timestamp */
#define ENET_MAC_TIMESTAMP_CONTROL_TSCFUPDT                 BIT(1)                /*!< fine or coarse timestamp update */
#define ENET_MAC_TIMESTAMP_CONTROL_TSINIT                   BIT(2)                /*!< initialize timestam */
#define ENET_MAC_TIMESTAMP_CONTROL_TSUPDT                   BIT(3)                /*!< update timestamp */
#define ENET_MAC_TIMESTAMP_CONTROL_TSADDREG                 BIT(5)                /*!< update addend register */
#define ENET_MAC_TIMESTAMP_CONTROL_PTGE                     BIT(6)                /*!< presentation time generation enable */
#define ENET_MAC_TIMESTAMP_CONTROL_TSENALL                  BIT(8)                /*!< enable timestamp for all packets */
#define ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR                BIT(9)                /*!< timestamp digital or binary rollover control */
#define ENET_MAC_TIMESTAMP_CONTROL_TSVER2ENA                BIT(10)               /*!< enable PTP packet processing for version 2 format */
#define ENET_MAC_TIMESTAMP_CONTROL_TSIPENA                  BIT(11)               /*!< enable processing of PTP over ethernet packets */
#define ENET_MAC_TIMESTAMP_CONTROL_TSIPV6ENA                BIT(12)               /*!< enable processing of PTP packets sent over IPv6-UDP */
#define ENET_MAC_TIMESTAMP_CONTROL_TSIPV4ENA                BIT(13)               /*!< enable processing of PTP packets sent over IPv4-UDP */
#define ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA                BIT(14)               /*!< enable timestamp snapshot for event messages */
#define ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA                BIT(15)               /*!< enable snapshot for messages relevant to master */
#define ENET_MAC_TIMESTAMP_CONTROL_SNAPTYPSEL                BITS(16,17)           /*!< Select PTP packets for taking snapshots */
#define ENET_MAC_TIMESTAMP_CONTROL_TSENMACADDR              BIT(18)               /*!< enable MAC address for PTP packet filtering */
#define ENET_MAC_TIMESTAMP_CONTROL_TXTSSTSM                 BIT(24)               /*!< transmit timestamp status mode */
#define ENET_MAC_TIMESTAMP_CONTROL_AV8021ASMEN              BIT(28)               /*!< AV 802.1AS mode enable */

/* ENET_MAC_SUB_SECOND_INCREMENT */
#define ENET_MAC_SUB_SECOND_INCREMENT_SNSINC                BITS(8,15)            /*!< sub-nanosecond increment value */
#define ENET_MAC_SUB_SECOND_INCREMENT_SSINC                 BITS(16,23)           /*!< sub-second increment value */

/* ENET_MAC_SYSTEM_TIME_SECONDS */
#define ENET_MAC_SYSTEM_TIME_SECONDS_TSS                    BITS(0,31)            /*!< timestamp second */

/* ENET_MAC_SYSTEM_TIME_NANOSECONDS */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_TSSS               BITS(0,30)            /*!< timestamp sub second */

