sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE */
#define ENET_MAC_SYSTEM_TIME_SECONDS_UPDATE_TSS             BITS(0,31)            /*!< timestamp second */

/* ENET_MAC_SYSTEM_TIME_NANOSECONDS */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS        BITS(0,30)            /*!< timestamp sub second */
#define ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB      BIT(31)               /*!< add or subtract time */

/* ENET_MAC_TIMESTAMP_ADDEND */
#define ENET_MAC_TIMESTAMP_ADDEND_TSAR                      BITS(0,31)            /*!< timestamp addend register */

/* ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS */
#define ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR      BITS(0,15)            /*!< timestamp higher word register */

/* ENET_MAC_TIMESTAMP_STATUS */
#define ENET_MAC_TIMESTAMP_STATUS_TSSOVF                    BIT(0)                /*!< timestamp seconds overflow */
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT0                  BIT(1)                /*!< timestamp target timereached */
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR0                BIT(3)                /*!< timestamp target time error */
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT1                  BIT(4)                /*!< timestamp target timereached for target time PPS1 */
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR1                BIT(5)                /*!< timestamp target time error */
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT2                  BIT(6)                /*!< timestamp target timereached for target time PPS2 */
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR2                BIT(7)                /*!< timestamp target time error */
#define ENET_MAC_TIMESTAMP_STATUS_TSTARGT3                  BIT(8)                /*!< timestamp target timereached for target time PPS3 */
#define ENET_MAC_TIMESTAMP_STATUS_TSTRGTERR3                BIT(9)                /*!< timestamp target time error */
#define ENET_MAC_TIMESTAMP_STATUS_TXTSSIS                   BIT(15)               /*!< Tx timestamp status interrupt status */

/* ENET_MAC_RX_DOMAIN_TIME_INCR */
#define ENET_MAC_RX_DOMAIN_TIME_INCR_RXSNS                  BITS(8,15)            /*!< receive domain time increment value in sub-nanoseconds */
#define ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS                   BITS(16,31)           /*!< receive domain time increment value in nanoseconds */

/* ENET_MAC_TX_DOMAIN_TIME_INCR */
#define ENET_MAC_TX_DOMAIN_TIME_INCR_TXSNS                  BITS(8,15)            /*!< transmit domain time increment value in sub-nanoseconds */
#define ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS                   BITS(16,31)           /*!< transmit domain time increment value in nanoseconds */

/* ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS */
#define ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO    BITS(0,30)            /*!< transmit timestamp status low */
#define ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS   BIT(31)               /*!< transmit timestamp status missed */

/* ENET_MAC_TX_TIMESTAMP_STATUS_SECONDS */
#define ENET_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI        BITS(0,31)            /*!< transmit timestamp status high */

/* ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR */
#define ENET_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC         BITS(0,31)            /*!< one-step timestamp ingress asymmetry correction */

/* ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR */
#define ENET_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC          BITS(0,31)            /*!< one-step timestamp egress asymmetry correction */

/* ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECONDS */
#define ENET_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC    BITS(0,31)             /*!< timestamp ingress correction */

/* ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECONDS */
#define ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC     BITS(0,31)             /*!< timestamp egress correction */

/* ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC */
#define ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS  BITS(0,31)            /*!< timestamp ingress correction, sub-nanoseconds */

/* ENET_MAC_TIMESTAMP_EGRESS_CORR_NANOSECONDS */
#define ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS   BITS(0,31)            /*!< timestamp egress correction, sub-nanoseconds */

/* ENET_MAC_TIMESTAMP_INGRESS_LATENCY */
#define ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS           BITS(8,15)            /*!< ingress timestamp latency, in nanoseconds */
#define ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS            BITS(16,27)           /*!< ingress timestamp latency, in sub-nanoseconds */

/* ENET_MAC_TIMESTAMP_EGRESS_LATENCY */
#define ENET_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS           BITS(8,15)             /*!< egress timestamp latency, in nanoseconds */
#define ENET_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS            BITS(16,27)            /*!< egress timestamp latency, in sub-nanoseconds */

/* ENET_MAC_PPS_CONTROL */
#define ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD                BITS(0,3)     /*!< PPS output frequency control, flexible PPS output control or presentation time control */
#define ENET_MAC_PPS_CONTROL_PPSEN0                BIT(4)                /*!< flexible PPS output mode enable */
#define ENET_MAC_PPS_CONTROL_TRGTMODSEL0           BITS(5,6)             /*!< target time register mode for PPS0 output */
#define ENET_MAC_PPS_CONTROL_MCGREN0               BIT(7)                /*!< MCGR mode enable for PPS0 output */
#define ENET_MAC_PPS_CONTROL_PPSCMD1               BITS(8,11)            /*!< flexible PPS1 output control */
#define ENET_MAC_PPS_CONTROL_TRGTMODSEL1           BITS(13,14)           /*!< target time register mode for PPS1 output */
#define ENET_MAC_PPS_CONTROL_MCGREN1               BIT(15)               /*!< MCGR mode enable for PPS1 output */
#define ENET_MAC_PPS_CONTROL_PPSCMD2               BITS(16,19)           /*!< flexible PPS2 output control */
#define ENET_MAC_PPS_CONTROL_TRGTMODSEL2           BITS(21,22)           /*!< target time register mode for PPS2 output */
#define ENET_MAC_PPS_CONTROL_MCGREN2               BIT(23)               /*!< MCGR mode enable for PPS2 output */
#define ENET_MAC_PPS_CONTROL_PPSCMD3               BITS(24,27)           /*!< flexible PPS3 output control */
#define ENET_MAC_PPS_CONTROL_TIMESEL               BIT(28)               /*!< time select */
#define ENET_MAC_PPS_CONTROL_TRGTMODSEL3           BITS(29,30)           /*!< target time register mode for PPS3 output */
#define ENET_MAC_PPS_CONTROL_MCGREN3               BIT(31)               /*!< MCGR mode enable for PPS3 output */

/* ENET_MAC_PPS_TARGET_TIME_SECONDS */
#define ENET_MAC_PPS_TARGET_TIME_SECONDS_TSTRH0            BITS(0,31)            /*!< PPS target time seconds register */

/* ENET_MAC_PPS_TARGET_TIME_NANOSECONDS */
#define ENET_MAC_PPS_TARGET_TIME_NANOSECONDS_TTSL0         BITS(0,30)            /*!< target time low for PPS register */
#define ENET_MAC_PPS_TARGET_TIME_NANOSECONDS_TRGTBUSY0     BIT(31)               /*!< PPS target time register busy */

/* ENET_MAC_PPS_INTERVAL */
#define ENET_MAC_PPS_INTERVAL_PPSINT0                      BITS(0,31)            /*!< PPS output signal interval */

/* ENET_MAC_PPS_WIDTH */
#define ENET_MAC_PPS_WIDTH_PPSWIDTH0                       BITS(0,31)            /*!< PPS output signal width */

/* ENET_MTL_OPERATION_MODE */
#define ENET_MTL_OPERATION_MODE_DTXSTS                     BIT(1)                /*!< drop transmit status */
#define ENET_MTL_OPERATION_MODE_RAA                        BIT(2)                /*!< receive arbitration algorithm */
#define ENET_MTL_OPERATION_MODE_SCHALG                     BITS(5,6)             /*!< Tx scheduling algorithm */
#define ENET_MTL_OPERATION_MODE_CNTPRST                    BIT(8)                /*!< counters preset */
#define ENET_MTL_OPERATION_MODE_CNTCLR                     BIT(9)                /*!< counters reset */
#define ENET_MTL_OPERATION_MODE_RXPED                      BIT(14)               /*!< Rx parser software error/incomplete parsing packet drop enable */
#define ENET_MTL_OPERATION_MODE_FRPE                       BIT(15)               /*!< flexible Rx parser enable */

/* ENET_MTL_DBG_CTL */
#define ENET_MTL_DBG_CTL_FDBGEN                            BIT(0)                /*!< FIFO debug access enable */
#define ENET_MTL_DBG_CTL_DBGMOD                            BIT(1)                /*!< debug mode access to FIFO */
#define ENET_MTL_DBG_CTL_BYTEEN                            BITS(2,3)             /*!< byte enables */
#define ENET_MTL_DBG_CTL_PKTSTATE                          BITS(5,6)             /*!< encoded packet state */
#define ENET_MTL_DBG_CTL_RSTAL                             BIT(8)                /*!< reset all pointers */
#define ENET_MTL_DBG_CTL_RSTSEL                            BIT(9)                /*!< reset pointers of selected FIFO */
#define ENET_MTL_DBG_CTL_FIFORDEN                          BIT(10)               /*!< FIFO read enable */
#define ENET_MTL_DBG_CTL_FIFOWREN                          BIT(11)               /*!< FIFO write enable */
#define ENET_MTL_DBG_CTL_FIFOSEL                           BITS(12,13)           /*!< FIFO selected for access */
#define ENET_MTL_DBG_CTL_PKTIE                             BIT(14)               /*!< receive packet available interrupt status enable */
#define ENET_MTL_DBG_CTL_STSIE                             BIT(15)               /*!< transmit status available interrupt status enable */
#define ENET_MTL_DBG_CTL_EIEE                              BIT(16)               /*!< ECC inject error enable for Tx, Rx memories */
#define ENET_MTL_DBG_CTL_EIAEE                             BIT(17)               /*!< ECC inject address error for Tx, Rx memories */
#define ENET_MTL_DBG_CTL_EIEC                              BIT(18)               /*!< ECC inject error control for Tx, Rx memories */

