sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MTL_DBG_STS */
#define ENET_MTL_DBG_STS_FIFOBUSY                          BIT(0)                /*!< FIFO busy */
#define ENET_MTL_DBG_STS_PKTSTATE                          BITS(1,2)             /*!< encoded packet state */
#define ENET_MTL_DBG_STS_BYTEEN                            BITS(3,4)             /*!< byte enables */
#define ENET_MTL_DBG_STS_PKTI                              BIT(8)                /*!< receive packet available interrupt status */
#define ENET_MTL_DBG_STS_STSI                              BIT(9)                /*!< transmit status available interrupt status */
#define ENET_MTL_DBG_STS_LOCR                              BITS(15,31)           /*!< remaining l ocations in the FIFO */

/* ENET_MTL_FIFO_DEBUG_DATA */
#define ENET_MTL_FIFO_DEBUG_DATA_FDBGDATA                  BITS(0,31)            /*!< FIFO debug data */

/* ENET_MTL_INTERRUPT_STATUS */
#define ENET_MTL_INTERRUPT_STATUS_Q0IS                     BIT(0)                /*!< queue 0 interrupt status */
#define ENET_MTL_INTERRUPT_STATUS_Q1IS                     BIT(1)                /*!< queue 1 interrupt status */
#define ENET_MTL_INTERRUPT_STATUS_DBGIS                    BIT(17)               /*!< debug interrupt status */
#define ENET_MTL_INTERRUPT_STATUS_ESTIS                    BIT(18)               /*!< EST (TAS- 802.1Qbv) interrupt status */
#define ENET_MTL_INTERRUPT_STATUS_MTLPIS                   BIT(23)               /*!< MTL Rx parser interrupt status */

/* ENET_MTL_RXQ_DMA_MAP0 */
#define ENET_MTL_RXQ_DMA_MAP0_Q0MDMACH                     BIT(0)                /*!< queue 0 mapped to DMA channel */
#define ENET_MTL_RXQ_DMA_MAP0_Q0DDMACH                     BIT(4)                /*!< queue 0 enabled for DA-based DMA channel selection */
#define ENET_MTL_RXQ_DMA_MAP0_Q1MDMACH                     BIT(8)                /*!< queue 1 mapped to DMA channel */
#define ENET_MTL_RXQ_DMA_MAP0_Q1DDMACH                     BIT(12)               /*!< queue 1 enabled for DA-based DMA channel selection */

/* ENET_MTL_TBS_CTRL */
#define ENET_MTL_TBS_CTRL_ESTM                             BIT(0)                /*!< EST offset mode */
#define ENET_MTL_TBS_CTRL_LEOV                             BIT(1)                /*!< launch expiry offset valid */
#define ENET_MTL_TBS_CTRL_LEGOS                            BITS(4,6)             /*!< launch expiry GSN off */
#define ENET_MTL_TBS_CTRL_LEOS                             BITS(8,31)            /*!< launch expiry offset */

/* ENET_MTL_EST_CONTROL */
#define ENET_MTL_EST_CONTROL_EEST                          BIT(0)                /*!< enable EST */
#define ENET_MTL_EST_CONTROL_SSWL                          BIT(1)                /*!< switch to S/W owned list */
#define ENET_MTL_EST_CONTROL_QHLBF                         BIT(3)                /*!< quick assertion of HLBF error */
#define ENET_MTL_EST_CONTROL_DDBF                          BIT(4)                /*!< do not drop frames during frame size error */
#define ENET_MTL_EST_CONTROL_DFBS                          BIT(5)                /*!< drop frames causing scheduling error */
#define ENET_MTL_EST_CONTROL_LCSE                          BITS(6,7)             /*!< loop count to report scheduling error */
#define ENET_MTL_EST_CONTROL_TILS                          BITS(8,10)            /*!< time interval left shift amount */
#define ENET_MTL_EST_CONTROL_CTOV                          BITS(12,23)           /*!< current time offset value */
#define ENET_MTL_EST_CONTROL_PTOV                          BITS(24,31)           /*!< PTP time offset value */

/* ENET_MTL_EST_EXT_CONTROL */
#define ENET_MTL_EST_EXT_CONTROL_OVHD                      BITS(0,5)             /*!< overhead bytes value */

/* ENET_MTL_EST_STATUS */
#define ENET_MTL_EST_STATUS_SWLC                          BIT(0)                /*!< switch to S/W owned list complete */
#define ENET_MTL_EST_STATUS_BTRE                          BIT(1)                /*!< BTR error */
#define ENET_MTL_EST_STATUS_HLBF                          BIT(2)                /*!< head-of-line blocking due to frame size */
#define ENET_MTL_EST_STATUS_HLBS                          BIT(3)                /*!< head-of-line blocking due to scheduling */
#define ENET_MTL_EST_STATUS_CGCE                          BIT(4)                /*!< constant gate control error */
#define ENET_MTL_EST_STATUS_SWOL                          BIT(7)                /*!< S/W owned list */
#define ENET_MTL_EST_STATUS_BTR                           BITS(8,15)            /*!< BTR error loop count */
#define ENET_MTL_EST_STATUS_CGSN                          BITS(16,19)           /*!< current GCL slot number */

/* ENET_MTL_EST_SCH_ERROR */
#define ENET_MTL_EST_SCH_ERROR_SEQN                       BITS(0,1)             /*!< schedule error queue number */

/* ENET_MTL_EST_FRM_SIZE_ERROR */
#define ENET_MTL_EST_FRM_SIZE_ERROR_FEQN                  BITS(0,1)             /*!< frame size error queue number */

/* ENET_MTL_EST_FRM_SIZE_CAPTURE */
#define ENET_MTL_EST_FRM_SIZE_CAPTURE_HBFS                BITS(0,14)            /*!< frame size of HLBF */
#define ENET_MTL_EST_FRM_SIZE_CAPTURE_HBFQ                BIT(16)               /*!< queue number of HLBF */

/* ENET_MTL_EST_INTR_ENABLE */
#define ENET_MTL_EST_INTR_ENABLE_IECC                     BIT(0)                /*!< interrupt enable for switch list */
#define ENET_MTL_EST_INTR_ENABLE_IEBE                     BIT(1)                /*!< interrupt enable for BTR Error */
#define ENET_MTL_EST_INTR_ENABLE_IEHF                     BIT(2)                /*!< interrupt enable for HLBF */
#define ENET_MTL_EST_INTR_ENABLE_IEHS                     BIT(3)                /*!< interrupt enable for HLBS */
#define ENET_MTL_EST_INTR_ENABLE_CGCE                     BIT(4)                /*!< interrupt enable for CGCE */

/* ENET_MTL_EST_GCL_CONTROL */
#define ENET_MTL_EST_GCL_CONTROL_SRWO                     BIT(0)                /*!< start read/write operation */
#define ENET_MTL_EST_GCL_CONTROL_R1W0                     BIT(1)                /*!< read '1', write '0' */
#define ENET_MTL_EST_GCL_CONTROL_GCRR                     BIT(2)                /*!< gate control related registers */
#define ENET_MTL_EST_GCL_CONTROL_DBGM                     BIT(4)                /*!< debug mode */
#define ENET_MTL_EST_GCL_CONTROL_DBGB                     BIT(5)                /*!< debug mode bank select */
#define ENET_MTL_EST_GCL_CONTROL_ADDR                     BITS(8,15)            /*!< gate control list address or related registers address */
#define ENET_MTL_EST_GCL_CONTROL_ESTEIEE                  BIT(21)               /*!< EST ECC inject error enable */
#define ENET_MTL_EST_GCL_CONTROL_ESTEIAEE                 BIT(22)               /*!< EST ECC inject address error enable */
#define ENET_MTL_EST_GCL_CONTROL_ESTEIEC                  BIT(23)               /*!< ECC inject error control for EST memory */

/* ENET_MTL_EST_GCL_DATA */
#define ENET_MTL_EST_GCL_DATA_GCD                         BITS(0,31)            /*!< gate control data */

/* ENET_MTL_FPE_CTRL_STS */
#define ENET_MTL_FPE_CTRL_STS_AFSZ                        BITS(0,1)             /*!< additional fragment size */
#define ENET_MTL_FPE_CTRL_STS_LBHT                        BIT(7)                /*!< level based hold transition */
#define ENET_MTL_FPE_CTRL_STS_PEC                         BITS(8,9)             /*!< preemption classification */
#define ENET_MTL_FPE_CTRL_STS_HRS                         BIT(28)               /*!< hold/release status */

/* ENET_MTL_FPE_ADVANCE */
#define ENET_MTL_FPE_ADVANCE_HADV                         BITS(0,15)            /*!< hold advance */
#define ENET_MTL_FPE_ADVANCE_RADV                         BITS(16,31)           /*!< release advance */

/* ENET_MTL_RXP_CONTROL_STATUS */
#define ENET_MTL_RXP_CONTROL_STATUS_NVE                   BITS(0,7)             /*!< number of valid entry address/index in the instruction table */
#define ENET_MTL_RXP_CONTROL_STATUS_NPE                   BITS(16,23)           /*!< number of parsable entries in the instruction table */
#define ENET_MTL_RXP_CONTROL_STATUS_ELIRS                 BIT(30)               /*!< enable last instruction in Rx status */
#define ENET_MTL_RXP_CONTROL_STATUS_RXPI                  BIT(31)               /*!< RX parser in idle state */

/* ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS     BIT(0)                /*!< number of valid entry address/index overflow interrupt status */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS     BIT(1)                /*!< number of parsable entries overflow interrupt status */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS      BIT(2)                /*!< frame offset overflow interrupt status */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS      BIT(3)                /*!< packet dropped due to RF interrupt status */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE     BIT(16)               /*!< number of valid entries overflow interrupt enable */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE     BIT(17)               /*!< number of parsable entries overflow interrupt enable */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE      BIT(18)               /*!< frame offset overflow interrupt enable */
#define ENET_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE      BIT(19)               /*!< packet drop due to RF interrupt enable */

/* ENET_MTL_RXP_DROP_CNT */
#define ENET_MTL_RXP_DROP_CNT_RXPDC                       BITS(0,30)            /*!< Rx parser drop count */
#define ENET_MTL_RXP_DROP_CNT_RXPDCOVF                    BIT(31)               /*!< Rx parser drop counter overflow */

/* ENET_MTL_RXP_ERROR_CNT */
#define ENET_MTL_RXP_ERROR_CNT_RXPEC                       BITS(0,30)           /*!< Rx parser error count */
#define ENET_MTL_RXP_ERROR_CNT_RXPECOVF                    BIT(31)              /*!< Rx parser error counter overflow */

