sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR      BITS(0,7)            /*!< FRP instruction table offset address */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN     BIT(16)              /*!< read write control */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE   BIT(20)              /*!< ECC inject error enable for Rx parser memory */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE  BIT(21)              /*!< ECC inject address error enable for Rx parser memory */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC   BIT(22)              /*!< ECC inject error control for Rx parser memory */
#define ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY BIT(31)              /*!< FRP instruction table access busy */

/* ENET_MTL_RXP_INDIRECT_ACC_DATA */
#define ENET_MTL_RXP_INDIRECT_ACC_DATA_DATA                BITS(0,31)           /*!< FRP instruction table write/read data */

/* ENET_MTL_RXP_BYPASS_CNT */
#define ENET_MTL_RXP_BYPASS_CNT_RXPBC                      BITS(0,30)           /*!< Rx parser bypass count */
#define ENET_MTL_RXP_BYPASS_CNT_RXPBCOF                    BIT(31)              /*!< Rx parser bypass counter overflow */

/* ENET_MTL_ECC_CONTROL */
#define ENET_MTL_ECC_CONTROL_MTXEE                         BIT(0)               /*!< MTL Tx FIFO ECC enable */
#define ENET_MTL_ECC_CONTROL_MRXEE                         BIT(1)               /*!< MTL Rx FIFO ECC enable */
#define ENET_MTL_ECC_CONTROL_MESTEE                        BIT(2)               /*!< MTL EST ECC enable */
#define ENET_MTL_ECC_CONTROL_MRXPEE                        BIT(3)               /*!< MTL Rx Parser ECC enable */
#define ENET_MTL_ECC_CONTROL_MEEAO                         BIT(8)               /*!< MTL ECC error address status over-ride */

/* ENET_MTL_SAFETY_INTERRUPT_STATUS */
#define ENET_MTL_SAFETY_INTERRUPT_STATUS_MECIS             BIT(0)               /*!< MTL ECC correctable error interrupt status */
#define ENET_MTL_SAFETY_INTERRUPT_STATUS_MEUIS             BIT(1)               /*!< MTL ECC unCorrectable error interrupt status */

/* ENET_MTL_ECC_INTERRUPT_ENABLE */
#define ENET_MTL_ECC_INTERRUPT_ENABLE_TXCEIE               BIT(0)               /*!< Tx memory correctable error interrupt enable */
#define ENET_MTL_ECC_INTERRUPT_ENABLE_RXCEIE               BIT(4)               /*!< Rx memory correctable error interrupt enable */
#define ENET_MTL_ECC_INTERRUPT_ENABLE_ECEIE                BIT(8)               /*!< EST memory correctable error interrupt enable */
#define ENET_MTL_ECC_INTERRUPT_ENABLE_RPCEIE               BIT(12)              /*!< Rx parser memory correctable error interrupt enable */

/* ENET_MTL_ECC_INTERRUPT_STATUS */
#define ENET_MTL_ECC_INTERRUPT_STATUS_TXCES                BIT(0)               /*!< MTL Tx memory correctable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_TXAMS                BIT(1)               /*!< MTL Tx memory address mismatch status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_TXUES                BIT(2)               /*!< MTL Tx memory unCorrectable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RXCES                BIT(4)               /*!< MTL Rx memory Correctable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RXAMS                BIT(5)               /*!< MTL Rx memory address mismatch status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RXUES                BIT(6)               /*!< MTL Rx memory unCorrectable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_ECES                 BIT(8)               /*!< MTL EST memory correctable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_EAMS                 BIT(9)               /*!< MTL EST memory address mismatch status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_EUES                 BIT(10)              /*!< MTL EST memory unCorrectable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RPCES                BIT(12)              /*!< MTL Rx parser memory correctable error status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RPAMS                BIT(13)              /*!< MTL Rx parser memory address mismatch status */
#define ENET_MTL_ECC_INTERRUPT_STATUS_RPUES                BIT(14)              /*!< Rx parser memory unCorrectable error status */

/* ENET_MTL_ECC_ERR_STS_RCTL */
#define ENET_MTL_ECC_ERR_STS_RCTL_EESRE                    BIT(0)               /*!< MTL ECC error status read enable */
#define ENET_MTL_ECC_ERR_STS_RCTL_EMS                      BITS(1,3)            /*!< MTL ECC memory selection */
#define ENET_MTL_ECC_ERR_STS_RCTL_CCES                     BIT(4)               /*!< clear correctable error status */
#define ENET_MTL_ECC_ERR_STS_RCTL_CUES                     BIT(5)               /*!< clear unCorrectable error status */

/* ENET_MTL_ECC_ERR_ADDR_STATUS */
#define ENET_MTL_ECC_ERR_ADDR_STATUS_ECEAS                 BITS(0,15)           /*!< MTL ECC correctable error address status */
#define ENET_MTL_ECC_ERR_ADDR_STATUS_EUEAS                 BITS(16,31)          /*!< MTL ECC uncorrectable error address status */

/* ENET_MTL_ECC_ERR_CNTR_STATUS */
#define ENET_MTL_ECC_ERR_CNTR_STATUS_ECECS                 BITS(0,7)            /*!< MTL ECC correctable error counter status */
#define ENET_MTL_ECC_ERR_CNTR_STATUS_EUECS                 BITS(16,19)          /*!< MTL ECC uncorrectable error counter status */

/* ENET_MTL_DPP_CONTROL */
#define ENET_MTL_DPP_CONTROL_EDPP                          BIT(0)               /*!< enable data path parity protection */
#define ENET_MTL_DPP_CONTROL_OPE                           BIT(1)               /*!< odd parity enable */
#define ENET_MTL_DPP_CONTROL_EPSI                          BIT(2)               /*!< enable parity on slave interface port */
#define ENET_MTL_DPP_CONTROL_IPETID                        BIT(4)               /*!< insert parity error in Tx interface data parity checker */
#define ENET_MTL_DPP_CONTROL_IPETRD                        BIT(6)               /*!< insert parity error in DMA Tx/Rx descriptor parity checker */
#define ENET_MTL_DPP_CONTROL_IPEMTF                        BIT(7)               /*!< insert parity error in MTL Tx FIFO write data parity checker */
#define ENET_MTL_DPP_CONTROL_IPEMTS                        BIT(8)               /*!< insert parity error in MTL Tx status FIFO parity checker */
#define ENET_MTL_DPP_CONTROL_IPERID                        BIT(9)               /*!< insert parity error in RX interface data parity checker */
#define ENET_MTL_DPP_CONTROL_IPEMTBU                       BIT(13)              /*!< insert parity error in MAC TBU data parity checker */
#define ENET_MTL_DPP_CONTROL_IPEMTFC                       BIT(14)              /*!< insert parity error in MAC TFC data parity checker */
#define ENET_MTL_DPP_CONTROL_IPEMRWC                       BIT(15)              /*!< insert parity error in MTL RWC data parity checker */

/* ENET_MTL_DPP_ECC_EIC */
#define ENET_MTL_DPP_ECC_EIC_BLEI                          BITS(0,7)            /*!< bit location of error injection */
#define ENET_MTL_DPP_ECC_EIC_EIM                           BIT(16)              /*!< error injection mode */

/* ENET_MTL_TXQ0_OPERATION_MODE */
#define ENET_MTL_TXQ0_OPERATION_MODE_FTQ                   BIT(0)               /*!< flush transmit queue */
#define ENET_MTL_TXQ0_OPERATION_MODE_TSF                   BIT(1)               /*!< transmit store-and-forward */
#define ENET_MTL_TXQ0_OPERATION_MODE_TXQEN                 BITS(2,3)            /*!< transmit queue enable */
#define ENET_MTL_TXQ0_OPERATION_MODE_TTC                   BITS(4,6)            /*!< transmit threshold control */
#define ENET_MTL_TXQ0_OPERATION_MODE_TQS                   BITS(16,20)          /*!< transmit queue size */

/* ENET_MTL_TXQ0_UNDERFLOW */
#define ENET_MTL_TXQ0_UNDERFLOW_UFFRMCNT                   BITS(0,10)           /*!< underflow packet counter */
#define ENET_MTL_TXQ0_UNDERFLOW_UFCNTOVF                   BIT(11)              /*!< overflow bit for underflow packet counter */

/* ENET_MTL_TXQ0_DEBUG */
#define ENET_MTL_TXQ0_DEBUG_TXQPAUSED                      BIT(0)               /*!< transmit queue in pause */
#define ENET_MTL_TXQ0_DEBUG_TRCSTS                         BITS(1,2)            /*!< MTL Tx queue read controller status */
#define ENET_MTL_TXQ0_DEBUG_TWCSTS                         BIT(3)               /*!< MTL Tx queue write controller status */
#define ENET_MTL_TXQ0_DEBUG_TXQSTS                         BIT(4)               /*!< MTL Tx queue not empty status */
#define ENET_MTL_TXQ0_DEBUG_TXSTSFSTS                      BIT(5)               /*!< MTL Tx status FIFO full status */
#define ENET_MTL_TXQ0_DEBUG_PTXQ                           BITS(16,18)          /*!< number of packets in the transmit queue */
#define ENET_MTL_TXQ0_DEBUG_STXSTSF                        BITS(20,22)          /*!< number of status words in Tx status FIFO of queue */

/* ENET_MTL_TXQ0_EST_STATUS */
#define ENET_MTL_TXQ0_ETS_STATUS_ABS                       BITS(0,23)           /*!< average bits per slot */

