sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MTL_TXQ0_QUANTUM_WEIGHT */
#define ENET_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW                 BITS(0,20)           /*!< weights */

/* ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_TQU           BIT(0)               /*!< transmit queue underflow interrupt status */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS        BIT(1)               /*!< average bits per slot interrupt status */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE         BIT(8)               /*!< transmit queue underflow interrupt enable */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIE        BIT(9)               /*!< average bits per slot interrupt enable */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOVFIS       BIT(16)              /*!< receive queue overflow interrupt status */
#define ENET_MTL_Q0_INTERRUPT_CONTROL_STATUS_RXOIE         BIT(24)              /*!< receive queue overflow interrupt enable */

/* ENET_MTL_RXQ0_OPERATION_MODE */
#define ENET_MTL_RXQ0_OPERATION_MODE_RTC                   BITS(0,1)            /*!< receive queue threshold control */
#define ENET_MTL_RXQ0_OPERATION_MODE_FUP                   BIT(3)               /*!< forward undersized good packets */
#define ENET_MTL_RXQ0_OPERATION_MODE_FEP                   BIT(4)               /*!< forward error packets */
#define ENET_MTL_RXQ0_OPERATION_MODE_RSF                   BIT(5)               /*!< receive queue store and forward */
#define ENET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF            BIT(6)               /*!< disable dropping of TCP/IP checksum error packets */
#define ENET_MTL_RXQ0_OPERATION_MODE_EHFC                  BIT(7)               /*!< enable hardware flow control */
#define ENET_MTL_RXQ0_OPERATION_MODE_RFA                   BITS(8,11)           /*!< threshold for activating flow control */
#define ENET_MTL_RXQ0_OPERATION_MODE_RFD                   BITS(14,17)          /*!< threshold for deactivating flow control */
#define ENET_MTL_RXQ0_OPERATION_MODE_RQS                   BITS(20,24)          /*!< receive queue size */

/* ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT */
#define ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT BITS(0,10)           /*!< overflow packet counter */
#define ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF BIT(11)              /*!< overflow counter overflow */
#define ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MFCNT     BITS(16,26)          /*!< missed packet counter */
#define ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF BIT(27)              /*!< missed packet counter overflow */

/* ENET_MTL_RXQ0_DEBUG */
#define ENET_MTL_RXQ0_DEBUG_RWCSTS                         BIT(0)               /*!< MTL Rx queue write controller active status */
#define ENET_MTL_RXQ0_DEBUG_RRCSTS                         BITS(1,2)            /*!< MTL Rx queue read controller state */
#define ENET_MTL_RXQ0_DEBUG_RXQSTS                         BITS(4,5)            /*!< MTL Rx queue fill-level status */
#define ENET_MTL_RXQ0_DEBUG_PRXQ                           BITS(16,29)          /*!< number of packets in receive queue */

/* ENET_MTL_RXQ0_CONTROL */
#define ENET_MTL_RXQ0_CONTROL_RXQ_WEGT                     BITS(0,2)            /*!< receive queue weight */
#define ENET_MTL_RXQ0_CONTROL_RXQ_FRM_ARBIT                BIT(3)               /*!< receive queue packet arbitration */

/* ENET_MTL_TXQ1_OPERATION_MODE */
#define ENET_MTL_TXQ1_OPERATION_MODE_FTQ                   BIT(0)               /*!< flush transmit queue */
#define ENET_MTL_TXQ1_OPERATION_MODE_TSF                   BIT(1)               /*!< transmit store-and-forward */
#define ENET_MTL_TXQ1_OPERATION_MODE_TXQEN                 BITS(2,3)            /*!< transmit queue enable */
#define ENET_MTL_TXQ1_OPERATION_MODE_TTC                   BITS(4,6)            /*!< transmit threshold control */
#define ENET_MTL_TXQ1_OPERATION_MODE_TQS                   BITS(16,20)          /*!< transmit queue size */

/* ENET_MTL_TXQ1_UNDERFLOW */
#define ENET_MTL_TXQ1_UNDERFLOW_UFFRMCNT                   BITS(0,10)           /*!< underflow packet counter */
#define ENET_MTL_TXQ1_UNDERFLOW_UFCNTOVF                   BIT(11)              /*!< overflow bit for underflow packet counter */

/* ENET_MTL_TXQ1_DEBUG */
#define ENET_MTL_TXQ1_DEBUG_TXQPAUSED                      BIT(0)               /*!< transmit queue in pause */
#define ENET_MTL_TXQ1_DEBUG_TRCSTS                         BITS(1,2)            /*!< MTL Tx queue read controller status */
#define ENET_MTL_TXQ1_DEBUG_TWCSTS                         BIT(3)               /*!< MTL Tx queue write controller status */
#define ENET_MTL_TXQ1_DEBUG_TXQSTS                         BIT(4)               /*!< MTL Tx queue not empty status */
#define ENET_MTL_TXQ1_DEBUG_TXSTSFSTS                      BIT(5)               /*!< MTL Tx status FIFO full status */
#define ENET_MTL_TXQ1_DEBUG_PTXQ                           BITS(16,18)          /*!< number of packets in the transmit queue */
#define ENET_MTL_TXQ1_DEBUG_STXSTSF                        BITS(20,22)          /*!< number of status words in Tx status FIFO of queue */

/* ENET_MTL_TXQ1_ETS_CONTROL */
#define ENET_MTL_TXQ1_ETS_CONTROL_AVALG                    BIT(2)               /*!< AV algorithm */
#define ENET_MTL_TXQ1_ETS_CONTROL_CC                       BIT(3)               /*!< credit control */
#define ENET_MTL_TXQ1_ETS_CONTROL_SLC                      BITS(4,6)            /*!< slot count */

/* ENET_MTL_TXQ1_ETS_STATUS */
#define ENET_MTL_TXQ1_ETS_STATUS_ABS                       BITS(0,23)           /*!< average bits per slot */

/* ENET_MTL_TXQ1_QUANTUM_WEIGHT */
#define ENET_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW                 BITS(0,20)           /*!< weights */

/* ENET_MTL_TXQ1_SENDSLOPECREDIT */
#define ENET_MTL_TXQ1_SENDSLOPECREDIT_SSC                  BITS(0,13)           /*!< sendSlopeCredit value */

/* ENET_MTL_TXQ1_HICREDIT */
#define ENET_MTL_TXQ1_HICREDIT_HC                          BITS(0,28)           /*!< hiCredit value */

/* ENET_MTL_TXQ1_LOCREDIT */
#define ENET_MTL_TXQ1_LOCREDIT_LC                          BITS(0,28)           /*!< loCredit value */

/* ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_TQU           BIT(0)               /*!< transmit queue underflow interrupt status */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS        BIT(1)               /*!< average bits per slot interrupt status */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE         BIT(8)               /*!< transmit queue underflow interrupt enable */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE        BIT(9)               /*!< average bits per slot interrupt enable */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS       BIT(16)              /*!< receive queue overflow interrupt status */
#define ENET_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE         BIT(24)              /*!< receive queue overflow interrupt enable */

/* ENET_MTL_RXQ1_OPERATION_MODE */
#define ENET_MTL_RXQ1_OPERATION_MODE_RTC                   BITS(0,1)            /*!< receive queue threshold control */
#define ENET_MTL_RXQ1_OPERATION_MODE_FUP                   BIT(3)               /*!< forward undersized good packets */
#define ENET_MTL_RXQ1_OPERATION_MODE_FEP                   BIT(4)               /*!< forward error packets */
#define ENET_MTL_RXQ1_OPERATION_MODE_RSF                   BIT(5)               /*!< receive queue store and forward */
#define ENET_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF            BIT(6)               /*!< disable dropping of TCP/IP checksum error packets */
#define ENET_MTL_RXQ1_OPERATION_MODE_EHFC                  BIT(7)               /*!< enable hardware flow control */
#define ENET_MTL_RXQ1_OPERATION_MODE_RFA                   BITS(8,11)           /*!< threshold for activating flow control */
#define ENET_MTL_RXQ1_OPERATION_MODE_RFD                   BITS(14,17)          /*!< threshold for deactivating flow control */
#define ENET_MTL_RXQ1_OPERATION_MODE_RQS                   BITS(20,24)          /*!< receive queue size */

/* ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT */
#define ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT BITS(0,10)           /*!< overflow packet counter */
#define ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF BIT(11)              /*!< overflow counter overflow */
#define ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MFCNT     BITS(16,26)          /*!< missed packet counter */
#define ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF BIT(27)              /*!< missed packet counter overflow */

/* ENET_MTL_RXQ1_DEBUG */
#define ENET_MTL_RXQ1_DEBUG_RWCSTS                         BIT(0)               /*!< MTL Rx queue write controller active status */
#define ENET_MTL_RXQ1_DEBUG_RRCSTS                         BITS(1,2)            /*!< MTL Rx queue read controller state */
#define ENET_MTL_RXQ1_DEBUG_RXQSTS                         BITS(4,5)            /*!< MTL Rx queue fill-level status */
#define ENET_MTL_RXQ1_DEBUG_PRXQ                           BITS(16,29)          /*!< number of packets in receive queue */

