sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MTL_RXQ1_CONTROL */
#define ENET_MTL_RXQ1_CONTROL_RXQ_WEGT                     BITS(0,2)            /*!< receive queue weight */
#define ENET_MTL_RXQ1_CONTROL_RXQ_FRM_ARBIT                BIT(3)               /*!< receive queue packet arbitration */

/* ENET_DMA_MODE */
#define ENET_DMA_MODE_SWR                                  BIT(0)               /*!< software reset */
#define ENET_DMA_MODE_DA                                   BIT(1)               /*!< DMA Tx or Rx arbitration scheme */
#define ENET_DMA_MODE_TAA                                  BITS(2,4)            /*!< transmit arbitration algorithm */
#define ENET_DMA_MODE_TXPR                                 BIT(11)              /*!< transmit priority */
#define ENET_DMA_MODE_PR                                   BITS(12,14)          /*!< priority ratio */
#define ENET_DMA_MODE_INTM                                 BITS(16,17)          /*!< interrupt mode */

/* ENET_DMA_SYSBUS_MODE */
#define ENET_DMA_SYSBUS_MODE_FB                            BIT(0)               /*!< fixed burst length */
#define ENET_DMA_SYSBUS_MODE_AAL                           BIT(12)              /*!< address-aligned beats */
#define ENET_DMA_SYSBUS_MODE_MB                            BIT(14)              /*!< mixed burst */
#define ENET_DMA_SYSBUS_MODE_RB                            BIT(15)              /*!< rebuild INCRx burst */

/* ENET_DMA_INTERRUPT_STATUS */
#define ENET_DMA_INTERRUPT_STATUS_DC0IS                    BIT(0)               /*!< DMA channel 0 interrupt status */
#define ENET_DMA_INTERRUPT_STATUS_DC1IS                    BIT(1)               /*!< DMA channel 1 interrupt status */
#define ENET_DMA_INTERRUPT_STATUS_MTLIS                    BIT(16)              /*!< MTL interrupt status */
#define ENET_DMA_INTERRUPT_STATUS_MACIS                    BIT(17)              /*!< MAC interrupt status */

/* ENET_DMA_DEBUG_STATUS0 */
#define ENET_DMA_DEBUG_STATUS0_AXWHSTS                     BIT(0)               /*!< AHB master status */
#define ENET_DMA_DEBUG_STATUS0_RPS0                        BITS(8,11)           /*!< DMA channel 0 receive process state */
#define ENET_DMA_DEBUG_STATUS0_TPS0                        BITS(12,15)          /*!< DMA channel 0 transmit process state */
#define ENET_DMA_DEBUG_STATUS0_RPS1                        BITS(16,19)          /*!< DMA channel 1 receive process state */
#define ENET_DMA_DEBUG_STATUS0_TPS1                        BITS(20,23)          /*!< DMA channel 1 transmit process state */

/* ENET_DMA_TBS_CTRL0 */
#define ENET_DMA_TBS_CTRL0_FTOV                            BIT(0)               /*!< fetch time offset valid */
#define ENET_DMA_TBS_CTRL0_FGOS                            BITS(4,6)            /*!< fetch GSN offset */
#define ENET_DMA_TBS_CTRL0_FTOS                            BITS(8,31)           /*!< fetch time offset */

/* ENET_DMA_SAFETY_INTERRUPT_STATUS */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS_DECIS             BIT(0)               /*!< DMA ECC correctable error interrupt status */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS_DEUIS             BIT(1)               /*!< DMA ECC uncorrectable error interrupt status */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS_MSCIS             BIT(28)              /*!< MTL safety correctable error interrupt status */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS_MSUIS             BIT(29)              /*!< MTL safety uncorrectable error interrupt status */
#define ENET_DMA_SAFETY_INTERRUPT_STATUS_MCSIS             BIT(31)              /*!< MAC safety uncorrectable error interrupt status */

/* ENET_DMA_CH_CONTROL */
#define ENET_DMA_CH_CONTROL_PBLx8                          BIT(16)              /*!< 8xPBL mode */
#define ENET_DMA_CH_CONTROL_DSL                            BITS(18,20)          /*!< descriptor skip length */

/* ENET_DMA_CH_TX_CONTROL */
#define ENET_DMA_CH_TX_CONTROL_ST                          BIT(0)               /*!< start or stop transmission command */
#define ENET_DMA_CH_TX_CONTROL_TCW                         BITS(1,3)            /*!< transmit channel weight */
#define ENET_DMA_CH_TX_CONTROL_OSF                         BIT(4)               /*!< operate on second packet */
#define ENET_DMA_CH_TX_CONTROL_TxPBL                       BITS(16,21)          /*!< transmit programmable burst length */
#define ENET_DMA_CH_TX_CONTROL_DESE                        BIT(28)              /*!< enhanced descriptor enable */

/* ENET_DMA_CH_RX_CONTROL */
#define ENET_DMA_CH_RX_CONTROL_SR                          BIT(0)               /*!< start or stop receive */
#define ENET_DMA_CH_RX_CONTROL_RBSZ                        BITS(1,14)           /*!< receive buffer size */
#define ENET_DMA_CH_RX_CONTROL_RxPBL                       BITS(16,22)          /*!< receive programmable burst length */
#define ENET_DMA_CH_RX_CONTROL_RPF                         BIT(31)              /*!< Rx packet flush */

/* ENET_DMA_CH_TXDESC_ADDRESS */
#define ENET_DMA_CH_TXDESC_ADDRESS_TDESLA                  BITS(3,31)           /*!< start of transmit list */

/* ENET_DMA_CH_RXDESC_ADDRESS */
#define ENET_DMA_CH_RXDESC_ADDRESS_RDESLA                  BITS(3,31)           /*!< start of receive list */

/* ENET_DMA_CH_TXDESC_TAIL_POINTER */
#define ENET_DMA_CH_TXDESC_TAIL_POINTER_TDTP               BITS(3,31)           /*!< transmit descriptor tail pointer */

/* ENET_DMA_CH_RXDESC_TAIL_POINTER */
#define ENET_DMA_CH_RXDESC_TAIL_POINTER_RDTP               BITS(3,31)           /*!< receive descriptor tail pointer */

/* ENET_DMA_CH_TXDESC_RING_LENGTH */
#define ENET_DMA_CH_TXDESC_RING_LENGTH_TDRL                BITS(0,9)           /*!< transmit descriptor ring length */

/* ENET_DMA_CH_RX_CONTROL2 */
#define ENET_DMA_CH_RX_CONTROL2_RDRL                       BITS(0,9)           /*!< receive descriptor ring length */
#define ENET_DMA_CH_RX_CONTROL2_ARBS                       BITS(17,23)         /*!< alternate receive buffer size */

/* ENET_DMA_CH_INTERRUPT_ENABLE */
#define ENET_DMA_CH_INTERRUPT_ENABLE_TIE                   BIT(0)               /*!< transmit interrupt enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_TXSE                  BIT(1)               /*!< transmit stopped enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_TBUE                  BIT(2)               /*!< transmit buffer unavailable enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_RIE                   BIT(6)               /*!< receive interrupt enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_RBUE                  BIT(7)               /*!< receive buffer unavailable enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_RSE                   BIT(8)               /*!< receive stopped enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_RWTE                  BIT(9)               /*!< receive watchdog timeout enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_ETIE                  BIT(10)              /*!< early transmit interrupt enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_ERIE                  BIT(11)              /*!< early receive interrupt enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_FBEE                  BIT(12)              /*!< fatal bus error enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_CDEE                  BIT(13)              /*!< context descriptor error enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_AIE                   BIT(14)              /*!< abnormal interrupt summary enable */
#define ENET_DMA_CH_INTERRUPT_ENABLE_NIE                   BIT(15)              /*!< normal interrupt summary enable */

/* ENET_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER */
#define ENET_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT        BITS(0,7)            /*!< receive interrupt watchdog timer count */
#define ENET_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU     BITS(16,17)          /*!< receive interrupt watchdog timer count units */

/* ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS */
#define ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ESC       BIT(0)               /*!< enable slot comparison */
#define ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ASC      BIT(1)               /*!< advance slot check */
#define ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV       BITS(4,15)           /*!< slot interval value */
#define ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_RSN       BITS(16,19)          /*!< reference slot number */

/* ENET_DMA_CH_CURRENT_APP_TXDESC */
#define ENET_DMA_CH_CURRENT_APP_TXDESC_CURTDESAPTR         BITS(0,31)           /*!< application transmit descriptor address pointer */

/* ENET_DMA_CH_CURRENT_APP_RXDESC */
#define ENET_DMA_CH_CURRENT_APP_RXDESC_CURRDESAPTR         BITS(0,31)           /*!< application receive descriptor address pointer */

