sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_DMA_CH_CURRENT_APP_TXBUFFER */
#define ENET_DMA_CH_CURRENT_APP_TXBUFFER_CURTBUFAPTR       BITS(0,31)           /*!< application transmit buffer address pointer */

/* ENET_DMA_CH_CURRENT_APP_RXBUFFER */
#define ENET_DMA_CH_CURRENT_APP_RXBUFFER_CURRBUFAPTR       BITS(0,31)           /*!< application receive buffer address pointer */

/* ENET_DMA_CH_STATUS */
#define ENET_DMA_CH_STATUS_TI                              BIT(0)               /*!< transmit interrupt */
#define ENET_DMA_CH_STATUS_TPS                             BIT(1)               /*!< transmit process stopped */
#define ENET_DMA_CH_STATUS_TBU                             BIT(2)               /*!< transmit buffer unavailable status */
#define ENET_DMA_CH_STATUS_RI                              BIT(6)               /*!< receive interrupt */
#define ENET_DMA_CH_STATUS_RBU                             BIT(7)               /*!< receive buffer unavailable status */
#define ENET_DMA_CH_STATUS_RPS                             BIT(8)               /*!< receive process stopped */
#define ENET_DMA_CH_STATUS_RWT                             BIT(9)               /*!< receive watchdog timeout */
#define ENET_DMA_CH_STATUS_ETI                             BIT(10)              /*!< early transmit interrupt */
#define ENET_DMA_CH_STATUS_ERI                             BIT(11)              /*!< early receive interrupt */
#define ENET_DMA_CH_STATUS_FBE                             BIT(12)              /*!< fatal bus error */
#define ENET_DMA_CH_STATUS_CDE                             BIT(13)              /*!< context descriptor error */
#define ENET_DMA_CH_STATUS_AIS                             BIT(14)              /*!< abnormal interrupt summary */
#define ENET_DMA_CH_STATUS_NIS                             BIT(15)              /*!< normal interrupt summary */
#define ENET_DMA_CH_STATUS_TEB                             BITS(16,18)          /*!< Tx DMA error */
#define ENET_DMA_CH_STATUS_REB                             BITS(19,21)          /*!< Rx DMA error */

/* ENET_DMA_CH_MISS_FRAME_CNT */
#define ENET_DMA_CH_MISS_FRAME_CNT_MSFC                    BITS(0,10)           /*!< dropped packet counters */
#define ENET_DMA_CH_MISS_FRAME_CNT_MFCO                    BIT(15)              /*!< overflow status of the MFC counter */

/* ENET_DMA_CH_RXP_ACCEPT_CNT */
#define ENET_DMA_CH_RXP_ACCEPT_CNT_RXPAC                   BITS(0,30)           /*!< Rx parser accept counter */
#define ENET_DMA_CH_RXP_ACCEPT_CNT_RXPACOF                 BIT(31)              /*!< Rx parser accept counter overflow */

#ifdef ENHANCED_NORMAL_DESCRIPTOR
/* ENET DMA Tx enhanced normal descriptor ETDES4 */
#define ENET_NORMAL_ETDES4_LT                              BITS(0,7)           /*!< launch time[24:31] */
#define ENET_NORMAL_ETDES4_GSN                             BITS(8,11)          /*!< GCL slot number */
#define ENET_NORMAL_ETDES4_LTV                             BIT(31)             /*!< launch time valid */

/* ENET DMA Tx enhanced normal descriptor ETDES4 */
#define ENET_NORMAL_ETDES5_LT                              BITS(8,31)           /*!< launch time[0:23] */
#endif /* ENHANCED_NORMAL_DESCRIPTOR */

/* ENET DMA Tx normal descriptor TDES0 (read format) */
#define ENET_NORMAL_TDES0_RF_BUF1AP                        BITS(0,31)           /*!< buffer 1 address pointer */

/* ENET DMA Tx normal descriptor TDES1 (read format) */
#define ENET_NORMAL_TDES1_RF_BUF2AP                        BITS(0,31)           /*!< buffer 2 address pointer */

/* ENET DMA Tx normal descriptor TDES2 (read format) */
#define ENET_NORMAL_TDES2_RF_B1L                           BITS(0,13)           /*!< buffer 1 length */
#define ENET_NORMAL_TDES2_RF_VTIR                          BITS(14,15)          /*!< VLAN tag insertion or replacement */
#define ENET_NORMAL_TDES2_RF_B2L                           BITS(16,29)          /*!< buffer 2 length */
#define ENET_NORMAL_TDES2_RF_TTSE                          BIT(30)              /*!< transmit timestamp enable */
#define ENET_NORMAL_TDES2_RF_IOC                           BIT(31)              /*!< interrupt on completion */

/* ENET DMA Tx normal descriptor TDES3 (read format) */
#define ENET_NORMAL_TDES3_RF_FL                            BITS(0,14)           /*!< frame length */
#define ENET_NORMAL_TDES3_RF_CIC                           BITS(16,17)          /*!< checksum insertion control */
#define ENET_NORMAL_TDES3_RF_SLOTNUM                       BITS(19,22)          /*!< slot number control bits in AV mode */
#define ENET_NORMAL_TDES3_RF_SAIC                          BITS(23,25)          /*!< SA insertion control */
#define ENET_NORMAL_TDES3_RF_CPC                           BITS(26,27)          /*!< CRC pad control */
#define ENET_NORMAL_TDES3_RF_LD                            BIT(28)              /*!< last descriptor */
#define ENET_NORMAL_TDES3_RF_FD                            BIT(29)              /*!< first descriptor */
#define ENET_NORMAL_TDES3_RF_CTXT                          BIT(30)              /*!< context type */
#define ENET_NORMAL_TDES3_RF_OWN                           BIT(31)              /*!< own bit */

/* ENET DMA Tx normal descriptor TDES0 (write-back format) */
#define ENET_NORMAL_TDES0_WF_TTSL                          BITS(0,31)           /*!< transmit packet timestamp low */

/* ENET DMA Tx normal descriptor TDES1 (write-back format) */
#define ENET_NORMAL_TDES1_WF_TTSH                          BITS(0,31)           /*!< transmit packet timestamp high */

/* ENET DMA Tx normal descriptor TDES3 (write-back format) */
#define ENET_NORMAL_TDES3_WF_IHE                           BIT(0)              /*!< IP header error */
#define ENET_NORMAL_TDES3_WF_DB                            BIT(1)              /*!< deferred */
#define ENET_NORMAL_TDES3_WF_UF                            BIT(2)              /*!< underflow error */
#define ENET_NORMAL_TDES3_WF_ED                            BIT(3)              /*!< excessive deferral */
#define ENET_NORMAL_TDES3_WF_CC                            BITS(4,7)           /*!< collision countr */
#define ENET_NORMAL_TDES3_WF_EC                            BIT(8)              /*!< excessive collision */
#define ENET_NORMAL_TDES3_WF_LC                            BIT(9)              /*!< late collision */
#define ENET_NORMAL_TDES3_WF_NC                            BIT(10)             /*!< no carrier */
#define ENET_NORMAL_TDES3_WF_LOC                           BIT(11)             /*!< loss of carrier */
#define ENET_NORMAL_TDES3_WF_PCE                           BIT(12)             /*!< payload checksum error */
#define ENET_NORMAL_TDES3_WF_FF                            BIT(13)             /*!< packet flushed */
#define ENET_NORMAL_TDES3_WF_JT                            BIT(14)             /*!< jabber timeout */
#define ENET_NORMAL_TDES3_WF_ES                            BIT(15)             /*!< error summary */
#define ENET_NORMAL_TDES3_WF_TTSS                          BIT(17)             /*!< Tx timestamp status */
#define ENET_NORMAL_TDES3_WF_DE                            BIT(23)             /*!< descriptor error */
#define ENET_NORMAL_TDES3_WF_LD                            BIT(28)              /*!< last descriptor */
#define ENET_NORMAL_TDES3_WF_FD                            BIT(29)              /*!< first descriptor */
#define ENET_NORMAL_TDES3_WF_CTXT                          BIT(30)              /*!< context type */
#define ENET_NORMAL_TDES3_WF_OWN                           BIT(31)              /*!< own bit */

