sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET DMA Tx context descriptor TDES0 */
#define ENET_CONTEXT_TDES0_TTSL                            BITS(0,31)           /*!< transmit packet timestamp low */

/* ENET DMA Tx context descriptor TDES1 */
#define ENET_CONTEXT_TDES1_TTSH                            BITS(0,31)           /*!< transmit packet timestamp high */

/* ENET DMA Tx context descriptor TDES2 */
#define ENET_CONTEXT_TDES2_IVT                             BITS(16,31)          /*!< inner VLAN tag */

/* ENET DMA Tx enhanced descriptor ETDES0 */
#define ENET_ENHANCED_ETDES0_LTV                           BIT(31)              /*!< launch time valid */
#define ENET_ENHANCED_ETDES0_GSN                           BITS(8,11)           /*!< GCL slot number */
#define ENET_ENHANCED_ETDES0_LT_HIGH                       BITS(0,7)            /*!< launch time[24:31] */

/* ENET DMA Tx enhanced descriptor ETDES1 */
#define ENET_ENHANCED_ETDES1_LT_LOW                        BITS(8,31)            /*!< launch time[24:31] */

/* ENET DMA Tx context descriptor TDES3 */
#define ENET_CONTEXT_TDES3_VT                              BITS(0,15)           /*!< VLAN tag */
#define ENET_CONTEXT_TDES3_VLTV                            BIT(16)              /*!< VLAN tag */
#define ENET_CONTEXT_TDES3_IVLTV                           BIT(17)              /*!< inner VLAN tag valid */
#define ENET_CONTEXT_TDES3_IVTIR                           BITS(18,19)          /*!< inner VLAN tag insert or replace */
#define ENET_CONTEXT_TDES3_CDE                             BIT(23)              /*!< context descriptor error */
#define ENET_CONTEXT_TDES3_TC                              BIT(26)              /*!< one-step timestamp correction input */
#define ENET_CONTEXT_TDES3_OSTC                            BIT(27)              /*!< one-step timestamp correction enable */
#define ENET_CONTEXT_TDES3_CTXT                            BIT(30)              /*!< context type */
#define ENET_CONTEXT_TDES3_OWN                             BIT(31)              /*!< own bit */

/* ENET DMA Rx normal descriptor RDES0 (read format) */
#define ENET_NORMAL_RDES0_RF_BUF1AP                        BITS(0,31)           /*!< buffer 1 address pointer */

/* ENET DMA Rx normal descriptor RDES2 (read format) */
#define ENET_NORMAL_RDES2_RF_BUF2AP                        BITS(0,31)           /*!< buffer 2 address pointer */

/* ENET DMA Rx normal descriptor RDES3 (read format) */
#define ENET_NORMAL_RDES3_RF_BUF1V                         BIT(24)              /*!< buffer 1 address valid */
#define ENET_NORMAL_RDES3_RF_BUF2V                         BIT(25)              /*!< buffer 2 address valid */
#define ENET_NORMAL_RDES3_RF_IOC                           BIT(30)              /*!< interrupt enabled on completion */
#define ENET_NORMAL_RDES3_RF_OWN                           BIT(31)              /*!< own bit */

/* ENET DMA Rx normal descriptor RDES0 (write-back format) */
#define ENET_NORMAL_RDES0_WF_OVT                           BITS(0,15)           /*!< outer VLAN tag */
#define ENET_NORMAL_RDES0_WF_IVT                           BITS(16,31)          /*!< inner VLAN tag */

/* ENET DMA Rx normal descriptor RDES1 (write-back format) */
#define ENET_NORMAL_RDES1_WF_PT                            BITS(0,2)            /*!< payload type */
#define ENET_NORMAL_RDES1_WF_IPHE                          BIT(3)               /*!< IP header error */
#define ENET_NORMAL_RDES1_WF_IPV4                          BIT(4)               /*!< IPV4 header present */
#define ENET_NORMAL_RDES1_WF_IPV6                          BIT(5)               /*!< IPv6 header present */
#define ENET_NORMAL_RDES1_WF_IPCB                          BIT(6)               /*!< IP checksum bypassed */
#define ENET_NORMAL_RDES1_WF_IPCE                          BIT(7)               /*!< IP payload error */
#define ENET_NORMAL_RDES1_WF_PMT                           BITS(8,11)           /*!< PTP message type */
#define ENET_NORMAL_RDES1_WF_PFT                           BIT(12)              /*!< PTP packet type */
#define ENET_NORMAL_RDES1_WF_PV                            BIT(13)              /*!< PTP version */
#define ENET_NORMAL_RDES1_WF_TSA                           BIT(14)              /*!< timestamp available */
#define ENET_NORMAL_RDES1_WF_TD                            BIT(15)              /*!< timestamp dropped */
#define ENET_NORMAL_RDES1_WF_OPC                           BITS(16,31)          /*!< OAM sub-type code, or MAC control packet opcode */

/* ENET DMA Rx normal descriptor RDES2 (write-back format) */
#define ENET_NORMAL_RDES2_WF_ARPNR                         BIT(10)              /*!< ARP reply not generated */
#define ENET_NORMAL_RDES2_WF_RXPS                          BITS(11,13)          /*!< Rx Parser Status */
#define ENET_NORMAL_RDES2_WF_ITS                           BIT(14)              /*!< inner VLAN tag filter status */
#define ENET_NORMAL_RDES2_WF_OTS                           BIT(15)              /*!< outer VLAN tag filter status */
#define ENET_NORMAL_RDES2_WF_SAF                           BIT(16)              /*!< SA address filter fail */
#define ENET_NORMAL_RDES2_WF_DAF                           BIT(17)              /*!< destination address filter fail */
#define ENET_NORMAL_RDES2_WF_HF                            BIT(18)              /*!< hash filter status */
#define ENET_NORMAL_RDES2_WF_MADRM                         BITS(19,26)          /*!< MAC address match or hash value */
#define ENET_NORMAL_RDES2_WF_L3FM                          BIT(27)              /*!< layer 3 filter match */
#define ENET_NORMAL_RDES2_WF_L4FM                          BIT(28)              /*!< layer 4 filter match */
#define ENET_NORMAL_RDES2_WF_L3L4FM                        BITS(29,31)          /*!< layer 3 and layer 4 filter number matched */

/* ENET DMA Rx normal descriptor RDES3 (write-back format) */
#define ENET_NORMAL_RDES3_WF_PL                            BITS(0,14)           /*!< packet length */
#define ENET_NORMAL_RDES3_WF_ES                            BIT(15)              /*!< error summary */
#define ENET_NORMAL_RDES3_WF_LT                            BITS(16,18)          /*!< length/type field */
#define ENET_NORMAL_RDES3_WF_DE                            BIT(19)              /*!< dribble bit error */
#define ENET_NORMAL_RDES3_WF_RE                            BIT(20)              /*!< receive error */
#define ENET_NORMAL_RDES3_WF_OE                            BIT(21)              /*!< overflow error */
#define ENET_NORMAL_RDES3_WF_RWT                           BIT(22)              /*!< receive watchdog timeout */
#define ENET_NORMAL_RDES3_WF_GP                            BIT(23)              /*!< giant packet */
#define ENET_NORMAL_RDES3_WF_CE                            BIT(24)              /*!< CRC error */
#define ENET_NORMAL_RDES3_WF_RS0V                          BIT(25)              /*!< receive status RDES0 valid */
#define ENET_NORMAL_RDES3_WF_RS1V                          BIT(26)              /*!< receive status RDES1 valid */
#define ENET_NORMAL_RDES3_WF_RS2V                          BIT(27)              /*!< receive status RDES2 valid */
#define ENET_NORMAL_RDES3_WF_LD                            BIT(28)              /*!< last descriptor */
#define ENET_NORMAL_RDES3_WF_FD                            BIT(29)              /*!< first descriptor */
#define ENET_NORMAL_RDES3_WF_CTXT                          BIT(30)              /*!< context type */
#define ENET_NORMAL_RDES3_WF_OWN                           BIT(31)              /*!< own bit */

/* ENET DMA Rx context descriptor RDES0 */
#define ENET_CONTEXT_RDES0_RTSL                            BITS(0,31)           /*!< receive packet timestamp low */

/* ENET DMA Rx context descriptor RDES1 */
#define ENET_CONTEXT_RDES1_RTSH                            BITS(0,31)           /*!< receive packet timestamp high */

/* ENET DMA Rx context descriptor RDES3 */
#define ENET_CONTEXT_RDES3_DE                              BIT(29)              /*!< descriptor error */
#define ENET_CONTEXT_RDES3_CTXT                            BIT(30)              /*!< context type */
#define ENET_CONTEXT_RDES3_OWN                             BIT(31)              /*!< own bit */

