sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET clock range judgement */
#define ENET_RANGE(apb1, n, m)           (((apb1) >= (n))&&((apb1) < (m)))

/* MAC_MDIO_ADDRESS register value */
#define MAC_MDIO_ADDRESS_CR(regval)                   (BITS(8,11) & ((uint32_t)(regval) << 8))       /*!< write value to MAC_MDIO_ADDRESS_CR bit field */
#define ENET_MDC_APB1_DIV42                            MAC_MDIO_ADDRESS_CR(0)                            /*!< HCLK:60-100 MHz; MDC clock= HCLK/42 */
#define ENET_MDC_APB1_DIV62                            MAC_MDIO_ADDRESS_CR(1)                            /*!< HCLK:100-150 MHz; MDC clock= HCLK/62 */
#define ENET_MDC_APB1_DIV16                            MAC_MDIO_ADDRESS_CR(2)                            /*!< HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ENET_MDC_APB1_DIV26                            MAC_MDIO_ADDRESS_CR(3)                            /*!< HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ENET_MDC_APB1_DIV102                           MAC_MDIO_ADDRESS_CR(4)                            /*!< HCLK:150-240 MHz; MDC clock= HCLK/102 */


/* MAC configuration register value */
#define MAC_CONFIGURATION_SARC(regval)            (BITS(28,29) & ((uint32_t)(regval) << 28))       /*!< write value to ENET_MAC_CONFIGURATION_SARC bit field */
#define ENET_SARC_INTERNAL_SIGNAL                  MAC_CONFIGURATION_SARC(0)                       /*!< internal input signals control the SA field generation */
#define ENET_SARC_ADDR0_INSERT                     MAC_CONFIGURATION_SARC(2)                       /*!< contents of MAC addr-0 inserted in SA field */
#define ENET_SARC_ADDR0_REPLACE                    MAC_CONFIGURATION_SARC(3)                       /*!< contents of MAC addr-0 replaces in SA field */
#define ENET_SARC_ADDR1_INSERT                     MAC_CONFIGURATION_SARC(6)                       /*!< contents of MAC addr-1 inserted in SA field */
#define ENET_SARC_ADDR1_REPLACE                    MAC_CONFIGURATION_SARC(7)                       /*!< contents of MAC addr-1 replaces in SA field */

#define MAC_CONFIGURATION_IPG(regval)             (BITS(24,26) & ((uint32_t)(regval) << 24))       /*!< write value to ENET_MAC_CONFIGURATION_IPG bit field */
#define ENET_INTERPACKETGAP_96BIT                  MAC_CONFIGURATION_IPG(0)                        /*!< 96 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_88BIT                  MAC_CONFIGURATION_IPG(1)                        /*!< 88 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_80BIT                  MAC_CONFIGURATION_IPG(2)                        /*!< 80 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_72BIT                  MAC_CONFIGURATION_IPG(3)                        /*!< 72 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_64BIT                  MAC_CONFIGURATION_IPG(4)                        /*!< 64 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_56BIT                  MAC_CONFIGURATION_IPG(5)                        /*!< 56 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_48BIT                  MAC_CONFIGURATION_IPG(6)                        /*!< 48 bit times inter-packet gap */
#define ENET_INTERPACKETGAP_40BIT                  MAC_CONFIGURATION_IPG(7)                        /*!< 40 bit times inter-packet gap */

#define MAC_CONFIGURATION_BL(regval)              (BITS(5,6) & ((uint32_t)(regval) << 5))          /*!< write value to ENET_MAC_CONFIGURATION_BL bit field */
#define ENET_BACKOFFLIMIT_10                       MAC_CONFIGURATION_BL(0)                         /*!< min (n, 10) */
#define ENET_BACKOFFLIMIT_8                        MAC_CONFIGURATION_BL(1)                         /*!< min (n, 8) */
#define ENET_BACKOFFLIMIT_4                        MAC_CONFIGURATION_BL(2)                         /*!< min (n, 4) */
#define ENET_BACKOFFLIMIT_1                        MAC_CONFIGURATION_BL(3)                         /*!< min (n, 1) */

#define MAC_CONFIGURATION_PRELEN(regval)           (BITS(2,3) & ((uint32_t)(regval) << 2))          /*!< write value to ENET_MAC_CONFIGURATION_PRELEN bit field */
#define ENET_PREAMBLE_LENGTH_7BYTE                 MAC_CONFIGURATION_PRELEN(0)                     /*!< 7 bytes of preamble */
#define ENET_PREAMBLE_LENGTH_5BYTE                 MAC_CONFIGURATION_PRELEN(1)                     /*!< 5 bytes of preamble */
#define ENET_PREAMBLE_LENGTH_3BYTE                 MAC_CONFIGURATION_PRELEN(2)                     /*!< 3 bytes of preamble */

#define ENET_ARP_OFFLOAD_ENABLE                    ENET_MAC_CONFIGURATION_ARPEN                    /*!< the MAC can recognize an incoming ARP request packet and schedules the ARP packet for transmission */
#define ENET_ARP_OFFLOAD_DISABLE                   ((uint32_t)0x00000000U)                         /*!< the MAC receiver does not recognize any ARP packet */

#define ENET_CHECKSUMOFFLOAD_ENABLE                ENET_MAC_CONFIGURATION_IPC                      /*!< IP header/payload checksum checking is enabled */
#define ENET_CHECKSUMOFFLOAD_DISABLE               ((uint32_t)0x00000000U)                         /*!< IP header/payload checksum checking is disabled */

#define ENET_GIANT_PACKET_LIMIT_ENABLE        ENET_MAC_CONFIGURATION_GPSLCE                   /*!< giant packet size limit control is enabled */
#define ENET_GIANT_PACKET_LIMIT_DISABLE       ((uint32_t)0x00000000U)                         /*!< giant packet size limit control is disabled */

#define ENET_2KMAX_PACKET_ENABLE             ENET_MAC_CONFIGURATION_S2KP                     /*!< Support up to 2K packet is enabled */
#define ENET_2KMAX_PACKET_DISABLE            ((uint32_t)0x00000000U)                         /*!< Support up to 2K packet is disabled */

#define ENET_TYPEPACKET_CRC_STRIP_ENABLE           ENET_MAC_CONFIGURATION_CST                      /*!< FCS field(last 4 bytes) of frame will be dropped before forwarding */
#define ENET_TYPEPACKET_CRC_STRIP_DISABLE          ((uint32_t)0x00000000U)                         /*!< FCS field(last 4 bytes) of frame will not be dropped before forwarding */
#define ENET_TYPEFRAME_CRC_DROP                     ENET_MAC_CONFIGURATION_CST                             /*!< the function of the MAC strips the Pad/FCS field on received frames */

#define ENET_AUTO_PADCRC_STRIP_ENABLE              ENET_MAC_CONFIGURATION_ACS                       /*!< the MAC strips the Pad/FCS field on received packets */
#define ENET_AUTO_PADCRC_STRIP_DISABLE             ((uint32_t)0x00000000U)                          /*!< the MAC forwards all received frames without modify it */
#define ENET_AUTO_PADCRC_DROP                     ENET_MAC_CONFIGURATION_ACS                             /*!< the function of the MAC strips the Pad/FCS field on received frames */

#define ENET_WATCHDOG_ENABLE                      ((uint32_t)0x00000000U)                           /*!< the MAC allows no more than 2048 bytes of the packet being received */
#define ENET_WATCHDOG_DISABLE                      ENET_MAC_CONFIGURATION_WD                        /*!< the MAC disables the watchdog timer on the receiver, and can receive packets of up to 16383 bytes */

#define ENET_JABBER_ENABLE                        ((uint32_t)0x00000000U)                           /*!< the maximum transmission byte is 2048 */
#define ENET_JABBER_DISABLE                        ENET_MAC_CONFIGURATION_JD                        /*!< the maximum transmission byte can be 16383 */

#define ENET_JUMBO_PACKET_ENABLE                         ((uint32_t)0x00000000U)                           /*!< the MAC allows jumbo packets of 9018 bytes (9022 bytes for VLAN tagged packets) */
#define ENET_JUMBO_PACKET_DISABLE                         ENET_MAC_CONFIGURATION_JE                        /*!< the MAC does not allows jumbo packets */

