sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_SPEEDMODE_10M                        ((uint32_t)0x00000000U)                           /*!< 10 Mbit/s */
#define ENET_SPEEDMODE_100M                        ENET_MAC_CONFIGURATION_FES                       /*!< 100 Mbit/s  */

#define ENET_MODE_FULLDUPLEX                       ENET_MAC_CONFIGURATION_DM                        /*!< full-duplex mode enable */
#define ENET_MODE_HALFDUPLEX                      ((uint32_t)0x00000000U)                           /*!< half-duplex mode enable */

#define ENET_LOOPBACKMODE_ENABLE                   ENET_MAC_CONFIGURATION_LM                        /*!< the MAC operates in loopback mode at the MII */
#define ENET_LOOPBACKMODE_DISABLE                 ((uint32_t)0x00000000U)                           /*!< the MAC operates in normal mode */

#define ENET_FULLDUPLEX_CARRIERSENSE_ENABLE        ENET_MAC_CONFIGURATION_ECRSFD                    /*!< the MAC transmitter checks the CRS signal before packet transmission in the full-duplex mode */
#define ENET_FULLDUPLEX_CARRIERSENSE_DISABLE      ((uint32_t)0x00000000U)                           /*!< the MAC transmitter ignores the status of the CRS signal */

#define ENET_RECEIVEOWN_ENABLE                    ((uint32_t)0x00000000U)                           /*!< the packets that transmitting from PHY are all received by MAC */
#define ENET_RECEIVEOWN_DISABLE                    ENET_MAC_CONFIGURATION_DO                        /*!< receiving frames from PHY is disabled by MAC */

#define ENET_CARRIERSENSE_ENABLE                  ((uint32_t)0x00000000U)                           /*!< the MAC transmitter generates errors because of carrier sense and aborts the transmission */
#define ENET_CARRIERSENSE_DISABLE                  ENET_MAC_CONFIGURATION_DCRS                      /*!< the MAC transmitter ignores the MII CRS signal during frame transmission in half-duplex mode */

#define ENET_RETRYTRANSMISSION_ENABLE              ((uint32_t)0x00000000U)                           /*!< the MAC retries based on the settings of the BL field*/
#define ENET_RETRYTRANSMISSION_DISABLE              ENET_MAC_CONFIGURATION_DR                        /*!< the MAC attempts only 1 transmission */

#define ENET_DEFERRALCHECK_ENABLE                  ENET_MAC_CONFIGURATION_DC                        /*!< the deferral check function is enabled in the MAC */
#define ENET_DEFERRALCHECK_DISABLE                 ((uint32_t)0x00000000U)                          /*!< the deferral check function is disabled */

/* ENET_MTL_RXQ0_OPERATION_MODE register value */
#define ENET_RXQ0_FORWARD_ERRFRAMES_ENABLE               (ENET_MTL_RXQ0_OPERATION_MODE_FEP << 2)    /*!< the forward error packets function is enabled in queue0 */
#define ENET_RXQ0_FORWARD_ERRFRAMES_DISABLE              ((uint32_t)0x00000000U)                    /*!< the forward error packets function is disabled in queue0 */
#define ENET_RXQ0_FORWARD_ERRFRAMES                      (ENET_MTL_RXQ0_OPERATION_MODE_FEP << 2)    /*!< the function that all frame received with error except runt error are forwarded to memory */

#define ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES_ENABLE      (ENET_MTL_RXQ0_OPERATION_MODE_FUP << 2)    /*!< the forward undersized good packets function is enabled in queue0 */
#define ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES_DISABLE     ((uint32_t)0x00000000U)                    /*!< the forward undersized good packets function is disabled in queue0 */
#define ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES             (ENET_MTL_RXQ0_OPERATION_MODE_FUP << 2)    /*!< the function that forwarding undersized good frames */

#define ENET_RXQ1_FORWARD_ERRFRAMES_ENABLE                ENET_MTL_RXQ1_OPERATION_MODE_FEP          /*!< the forward error packets function is enabled in queue1 */
#define ENET_RXQ1_FORWARD_ERRFRAMES_DISABLE               ((uint32_t)0x00000000U)                   /*!< the forward error packets function is disabled in queue1 */
#define ENET_RXQ1_FORWARD_ERRFRAMES                       ENET_MTL_RXQ1_OPERATION_MODE_FEP          /*!< the function that all frame received with error except runt error are forwarded to memory */

#define ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES_ENABLE       ENET_MTL_RXQ1_OPERATION_MODE_FUP          /*!< the forward undersized good packets function is enabled in queue1 */
#define ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES_DISABLE      ((uint32_t)0x00000000U)                   /*!< the forward undersized good packets function is disabled in queue1 */
#define ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES              ENET_MTL_RXQ1_OPERATION_MODE_FUP          /*!< the function that forwarding undersized good frames */

/* MAC extended configuration register value */
#define MAC_EXT_CONFIGURATION_EIPG(regval)        (BITS(25,29) & ((uint32_t)(regval) << 25))        /*!< write value to ENET_MAC_EXT_CONFIGURATION_EIPG bit field */

#define MAC_EXT_CONFIGURATION_GPSL(regval)        (BITS(0,13) & ((uint32_t)(regval) << 0))          /*!< write value to ENET_MAC_EXT_CONFIGURATION_GPSL bit field */

/* MAC packet filter register value */
#define MAC_PACKET_FILTER_PCF(regval)              (BITS(6,7) & ((uint32_t)(regval) << 6))          /*!< write value to ENET_MAC_EXT_CONFIGURATION_EIPG bit field */
#define ENET_CONTROL_PACKET_PREVENT_ALL            MAC_PACKET_FILTER_PCF(0)                         /*!< MAC filters all control packets from reaching the application */
#define ENET_CONTROL_PACKET_PREVENT_PAUSEFRAME     MAC_PACKET_FILTER_PCF(1)                         /*!< MAC forwards all control packets except pause packets to the application even if they fail the address filter */
#define ENET_CONTROL_PACKET_FORWARD_ALL            MAC_PACKET_FILTER_PCF(2)                         /*!< MAC forwards all control packets to the application even if they fail the address filter */
#define ENET_CONTROL_PACKET_FORWARD_PASS_FILTER    MAC_PACKET_FILTER_PCF(3)                         /*!< MAC forwards the control packets that pass the address filter */

#define ENET_RECEIVE_ALL_ENABLE                    ENET_MAC_PACKET_FILTER_RA                        /*!< the MAC receiver always checks the CRC field in the received packets */
#define ENET_RECEIVE_ALL_DISABLE                   ((uint32_t)0x00000000U)                          /*!< the MAC receiver does not check the CRC field in the received packets */

#define ENET_DROP_NONTCPUDP_ENABLE                 ENET_MAC_PACKET_FILTER_DNTU                      /*!< the MAC drops the non-TCP or UDP over IP packets */
#define ENET_DROP_NONTCPUDP_DISABLE                ((uint32_t)0x00000000U)                          /*!< the MAC forwards all non-TCP or UDP over IP packets */

