sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_L3L4_FILTER_ENABLE                    ENET_MAC_PACKET_FILTER_IPFE                      /*!< the MAC drops packets that do not match the enabled Layer 3 and Layer 4 filters */
#define ENET_L3L4_FILTER_DISABLE                   ((uint32_t)0x00000000U)                          /*!< the MAC forwards all packets irrespective of the match status of the Layer 3 and Layer 4 fields */
#define ENET_L3L4_FILTER                           ENET_MAC_PACKET_FILTER_IPFE                      /*!< filter Layer 3 and Layer 4 filters function */

#define ENET_VLAN_FILTER_ENABLE                    ENET_MAC_PACKET_FILTER_VTFE                      /*!< VLAN tag filter is enabled */
#define ENET_VLAN_FILTER_DISABLE                   ((uint32_t)0x00000000U)                          /*!< VLAN tag filter is disabled */
#define ENET_VLAN_FILTER                           ENET_MAC_PACKET_FILTER_VTFE                      /*!< filter VLAN tag function */

#define ENET_SRC_FILTER_NORMAL_ENABLE              ENET_MAC_PACKET_FILTER_SAF                                  /*!< filter source address */
#define ENET_SRC_FILTER_INVERSE_ENABLE             (ENET_MAC_PACKET_FILTER_SAF | ENET_MAC_PACKET_FILTER_SAIF)  /*!< inverse source address filtering result */
#define ENET_SRC_FILTER_DISABLE                    ((uint32_t)0x00000000U)                                     /*!< source address function in filter disable */
#define ENET_SRC_FILTER                            ENET_MAC_PACKET_FILTER_SAF                                  /*!< filter source address function */
#define ENET_SRC_FILTER_INVERSE                    ENET_MAC_PACKET_FILTER_SAIF                                 /*!< inverse source address filtering result function */

#define ENET_BROADCASTFRAMES_ENABLE                ((uint32_t)0x00000000U)                          /*!< the address filters pass all received broadcast frames */
#define ENET_BROADCASTFRAMES_DISABLE               ENET_MAC_PACKET_FILTER_DBF                       /*!< the address filters filter all incoming broadcast frames */
#define ENET_BROADCASTFRAMES_FILTER                ENET_MAC_PACKET_FILTER_DBF                       /*!< filter all incoming broadcast frames function */

#define ENET_DEST_FILTER_INVERSE_ENABLE            ENET_MAC_PACKET_FILTER_DAIF                      /*!< inverse DA filtering result */
#define ENET_DEST_FILTER_INVERSE_DISABLE           ((uint32_t)0x00000000U)                          /*!< not inverse DA filtering result */
#define ENET_DEST_FILTER_INVERSE                   ENET_MAC_PACKET_FILTER_DAIF                      /*!< inverse DA filtering result function */

#define ENET_PROMISCUOUS_ENABLE                    ENET_MAC_PACKET_FILTER_PR                        /*!< promiscuous mode enabled */
#define ENET_PROMISCUOUS_DISABLE                   ((uint32_t)0x00000000U)                          /*!< promiscuous mode disabled */

#define ENET_MULTICAST_FILTER_HASH_OR_PERFECT     (ENET_MAC_PACKET_FILTER_HMC | ENET_MAC_PACKET_FILTER_HPF)     /*!< pass multicast frames that match either the perfect or the hash filtering */
#define ENET_MULTICAST_FILTER_HASH                ENET_MAC_PACKET_FILTER_HMC                                    /*!< pass multicast frames that match the hash filtering */
#define ENET_MULTICAST_FILTER_PERFECT             ((uint32_t)0x00000000U)                                       /*!< pass multicast frames that match the perfect filtering */
#define ENET_MULTICAST_FILTER_NONE                ENET_MAC_PACKET_FILTER_PM                                     /*!< all multicast frames are passed */
#define ENET_MULTICAST_FILTER_PASS                ENET_MAC_PACKET_FILTER_PM                                     /*!< pass all multicast frames function */
#define ENET_MULTICAST_FILTER_HASH_MODE           ENET_MAC_PACKET_FILTER_HMC                                    /*!< HASH multicast filter function */
#define ENET_FILTER_MODE_EITHER                   ENET_MAC_PACKET_FILTER_HPF                                    /*!< HASH or perfect filter function */

#define ENET_UNICAST_FILTER_EITHER                (ENET_MAC_PACKET_FILTER_HUC | ENET_MAC_PACKET_FILTER_HPF)     /*!< pass unicast frames that match either the perfect or the hash filtering */
#define ENET_UNICAST_FILTER_HASH                  ENET_MAC_PACKET_FILTER_HUC                                    /*!< pass unicast frames that match the hash filtering */
#define ENET_UNICAST_FILTER_PERFECT               ((uint32_t)0x00000000U)                                       /*!< pass unicast frames that match the perfect filtering */
#define ENET_UNICAST_FILTER_HASH_MODE             ENET_MAC_PACKET_FILTER_HUC                                    /*!< HASH unicast filter function */

/* MAC watchdog timeout register value */
#define MAC_WATCHDOG_TIMEOUT_JTO(regval)          (BITS(16,19) & ((uint32_t)(regval) << 16))                    /*!< write value to ENET_MAC_WATCHDOG_TIMEOUT_JTO bit field */
#define ENET_JABBER_TIMEOUT_2KB                   MAC_WATCHDOG_TIMEOUT_JTO(0)                                   /*!< 2KB */
#define ENET_JABBER_TIMEOUT_3KB                   MAC_WATCHDOG_TIMEOUT_JTO(1)                                   /*!< 3KB */
#define ENET_JABBER_TIMEOUT_4KB                   MAC_WATCHDOG_TIMEOUT_JTO(2)                                   /*!< 4KB */
#define ENET_JABBER_TIMEOUT_5KB                   MAC_WATCHDOG_TIMEOUT_JTO(3)                                   /*!< 5KB */
#define ENET_JABBER_TIMEOUT_6KB                   MAC_WATCHDOG_TIMEOUT_JTO(4)                                   /*!< 6KB */
#define ENET_JABBER_TIMEOUT_7KB                   MAC_WATCHDOG_TIMEOUT_JTO(5)                                   /*!< 7KB */
#define ENET_JABBER_TIMEOUT_8KB                   MAC_WATCHDOG_TIMEOUT_JTO(6)                                   /*!< 8KB */
#define ENET_JABBER_TIMEOUT_9KB                   MAC_WATCHDOG_TIMEOUT_JTO(7)                                   /*!< 9KB */
#define ENET_JABBER_TIMEOUT_10KB                  MAC_WATCHDOG_TIMEOUT_JTO(8)                                   /*!< 10KB */
#define ENET_JABBER_TIMEOUT_11KB                  MAC_WATCHDOG_TIMEOUT_JTO(9)                                   /*!< 11KB */
#define ENET_JABBER_TIMEOUT_12KB                  MAC_WATCHDOG_TIMEOUT_JTO(10)                                  /*!< 12KB */
#define ENET_JABBER_TIMEOUT_13KB                  MAC_WATCHDOG_TIMEOUT_JTO(11)                                  /*!< 13KB */
#define ENET_JABBER_TIMEOUT_14KB                  MAC_WATCHDOG_TIMEOUT_JTO(12)                                  /*!< 14KB */
#define ENET_JABBER_TIMEOUT_15KB                  MAC_WATCHDOG_TIMEOUT_JTO(13)                                  /*!< 15KB */
#define ENET_JABBER_TIMEOUT_16KB                  MAC_WATCHDOG_TIMEOUT_JTO(14)                                  /*!< 16KB */

