sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define MAC_WATCHDOG_TIMEOUT_WTO(regval)          (BITS(0,3) & ((uint32_t)(regval) << 0))                       /*!< write value to ENET_MAC_WATCHDOG_TIMEOUT_WTO bit field */
#define ENET_WATCHDOG_TIMEOUT_2KB                 MAC_WATCHDOG_TIMEOUT_WTO(0)                                   /*!< 2KB */
#define ENET_WATCHDOG_TIMEOUT_3KB                 MAC_WATCHDOG_TIMEOUT_WTO(1)                                   /*!< 3KB */
#define ENET_WATCHDOG_TIMEOUT_4KB                 MAC_WATCHDOG_TIMEOUT_WTO(2)                                   /*!< 4KB */
#define ENET_WATCHDOG_TIMEOUT_5KB                 MAC_WATCHDOG_TIMEOUT_WTO(3)                                   /*!< 5KB */
#define ENET_WATCHDOG_TIMEOUT_6KB                 MAC_WATCHDOG_TIMEOUT_WTO(4)                                   /*!< 6KB */
#define ENET_WATCHDOG_TIMEOUT_7KB                 MAC_WATCHDOG_TIMEOUT_WTO(5)                                   /*!< 7KB */
#define ENET_WATCHDOG_TIMEOUT_8KB                 MAC_WATCHDOG_TIMEOUT_WTO(6)                                   /*!< 8KB */
#define ENET_WATCHDOG_TIMEOUT_9KB                 MAC_WATCHDOG_TIMEOUT_WTO(7)                                   /*!< 9KB */
#define ENET_WATCHDOG_TIMEOUT_10KB                MAC_WATCHDOG_TIMEOUT_WTO(8)                                   /*!< 10KB */
#define ENET_WATCHDOG_TIMEOUT_11KB                MAC_WATCHDOG_TIMEOUT_WTO(9)                                   /*!< 11KB */
#define ENET_WATCHDOG_TIMEOUT_12KB                MAC_WATCHDOG_TIMEOUT_WTO(10)                                  /*!< 12KB */
#define ENET_WATCHDOG_TIMEOUT_13KB                MAC_WATCHDOG_TIMEOUT_WTO(11)                                  /*!< 13KB */
#define ENET_WATCHDOG_TIMEOUT_14KB                MAC_WATCHDOG_TIMEOUT_WTO(12)                                  /*!< 14KB */
#define ENET_WATCHDOG_TIMEOUT_15KB                MAC_WATCHDOG_TIMEOUT_WTO(13)                                  /*!< 15KB */
#define ENET_WATCHDOG_TIMEOUT_16KB                MAC_WATCHDOG_TIMEOUT_WTO(14)                                  /*!< 16KB */

#define ENET_PROGRAMMABLE_JABBER_ENABLE           ENET_MAC_WATCHDOG_TIMEOUT_PJE                                 /*!< programmable jabber is enabled */
#define ENET_PROGRAMMABLE_JABBER_DISABLE          ((uint32_t)0x00000000U)                                       /*!< programmable jabber is disabled */

#define ENET_PROGRAMMABLE_WATCHDOG_ENABLE         ENET_MAC_WATCHDOG_TIMEOUT_PWE                                 /*!< programmable watchdog is enabled */
#define ENET_PROGRAMMABLE_WATCHDOG_DISABLE        ((uint32_t)0x00000000U)                                       /*!< programmable watchdog is disabled */

/* MAC vlan tag control register value */
#define MAC_VLAN_TAG_CTRL_EIVLS(regval)           (BITS(28,29) & ((uint32_t)(regval) << 28))                   /*!< write value to ENET_MAC_VLAN_TAG_CTRL_EIVLS bit field */
#define ENET_INVLANSTRIP_DISABLE                  MAC_VLAN_TAG_CTRL_EIVLS(0)                                   /*!< do not strip */
#define ENET_INVLANSTRIP_PASS                     MAC_VLAN_TAG_CTRL_EIVLS(1)                                   /*!< strip if VLAN filter passes */
#define ENET_INVLANSTRIP_NOPASS                   MAC_VLAN_TAG_CTRL_EIVLS(2)                                   /*!< strip if VLAN filter fails */
#define ENET_INVLANSTRIP_ENABLE                   MAC_VLAN_TAG_CTRL_EIVLS(3)                                   /*!< always strip */

#define MAC_VLAN_TAG_CTRL_EVLS(regval)            (BITS(21,22) & ((uint32_t)(regval) << 21))                    /*!< write value to ENET_MAC_VLAN_TAG_CTRL_EVLS bit field */
#define ENET_OUTVLANSTRIP_DISABLE                 MAC_VLAN_TAG_CTRL_EVLS(0)                                     /*!< do not strip */
#define ENET_OUTVLANSTRIP_PASS                    MAC_VLAN_TAG_CTRL_EVLS(1)                                     /*!< strip if VLAN filter passes */
#define ENET_OUTVLANSTRIP_NOPASS                  MAC_VLAN_TAG_CTRL_EVLS(2)                                     /*!< strip if VLAN filter fails */
#define ENET_OUTVLANSTRIP_ENABLE                  MAC_VLAN_TAG_CTRL_EVLS(3)                                     /*!< always strip */

#define MAC_VLAN_TAG_CTRL_OFS(regval)             (BITS(2,3) & ((uint32_t)(regval) << 2)) << 19                 /*!< write value to ENET_MAC_VLAN_TAG_CTRL_OFS bit field */
#define MAC_VLAN_TAG_FILTER0                      MAC_VLAN_TAG_CTRL_OFS(0)                                      /*!< MAC vlan tag filter 0 */
#define MAC_VLAN_TAG_FILTER1                      MAC_VLAN_TAG_CTRL_OFS(1)                                      /*!< MAC vlan tag filter 1 */
#define MAC_VLAN_TAG_FILTER2                      MAC_VLAN_TAG_CTRL_OFS(2)                                      /*!< MAC vlan tag filter 2 */
#define MAC_VLAN_TAG_FILTER3                      MAC_VLAN_TAG_CTRL_OFS(3)                                      /*!< MAC vlan tag filter 3 */

#define ENET_RXINVLAN_ENABLE                      ENET_MAC_VLAN_TAG_CTRL_EIVLRXS                                /*!< the MAC provides the inner VLAN tag in the Rx status */
#define ENET_RXINVLAN_DISABLE                     ((uint32_t)0x00000000U)                                       /*!< the MAC does not provide the inner VLAN tag in Rx status */

#define ENET_INVLANCOMPARISON_ENABLE              ENET_MAC_VLAN_TAG_CTRL_ERIVLT                                 /*!< inner VLAN tag is enabled */
#define ENET_INVLANCOMPARISON_DISABLE             ((uint32_t)0x00000000U)                                       /*!< inner VLAN tag is disabled */

#define ENET_DOUBLEVLAN_ENABLE                    ENET_MAC_VLAN_TAG_CTRL_EDVLP                                  /*!< MAC enables processing of up to two VLAN tags on Tx and Rx (if present) */
#define ENET_DOUBLEVLAN_DISABLE                   ((uint32_t)0x00000000U)                                       /*!< the MAC enables processing of up to one VLAN tag on Tx and Rx (if present) */

#define ENET_VLANHASHMATCH_ENABLE                 ENET_MAC_VLAN_TAG_CTRL_VTHM                                   /*!< VLAN tag hash table match is enabled */
#define ENET_VLANHASHMATCH_DISABLE                ((uint32_t)0x00000000U)                                       /*!< VLAN tag hash table match is disabled */

#define ENET_RXOUTVLAN_ENABLE                     ENET_MAC_VLAN_TAG_CTRL_EVLRXS                                 /*!< the MAC provides the VLAN tag in the Rx status */
#define ENET_RXOUTVLAN_DISABLE                    ((uint32_t)0x00000000U)                                       /*!< the MAC does not provide the VLAN tag in Rx status */

#define ENET_VLANTYPECHECK_ENABLE                 ((uint32_t)0x00000000U)                                       /*!< VLAN type check is enabled */
#define ENET_VLANTYPECHECK_DISABLE                ENET_MAC_VLAN_TAG_CTRL_DOVLTC                                 /*!< VLAN type check is disabled */

#define ENET_SVLANHASHMATCH_ENABLE                ENET_MAC_VLAN_TAG_CTRL_ERSVLM                                 /*!< receive S-VLAN match is enabled */
#define ENET_SVLANHASHMATCH_DISABLE               ((uint32_t)0x00000000U)                                       /*!< receive S-VLAN match is disabled */

#define ENET_SVLAN_ENABLE                         (ENET_MAC_VLAN_TAG_CTRL_ESVL| ENET_MAC_VLAN_TAG_CTRL_ERSVLM)  /*!< the MAC transmitter and receiver consider the S-VLAN packets (Type = 0x88A8) as valid VLAN tagged packets */
#define ENET_SVLAN_DISABLE                        ((uint32_t)0x00000000U)                                       /*!< the MAC transmitter and receiver consider the S-VLAN packets (Type = 0x88A8) as invalid VLAN tagged packets */

#define ENET_VLANINVERSEMATCH_ENABLE              ENET_MAC_VLAN_TAG_CTRL_VTIM                                   /*!< VLAN tag inverse match is enabled */
#define ENET_VLANINVERSEMATCH_DISABLE             ((uint32_t)0x00000000U)                                       /*!< VLAN tag inverse match is disabled */

#define ENET_VLANTAGHASHCOMPARISON_12BIT          ENET_MAC_VLAN_TAG_CTRL_ETV                                    /*!< only low 12 bits of the VLAN tag in received frame are used for comparison */
#define ENET_VLANTAGHASHCOMPARISON_16BIT          ((uint32_t)0x00000000U)                                       /*!< all 16 bits of the VLAN tag in received frame are used for comparison */

