sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_VLANTAG_FILTER_REG_READ              ENET_MAC_VLAN_TAG_CTRL_CT                                     /*!< read operation */
#define ENET_VLANTAG_FILTER_REG_WRITE             ((uint32_t)0x00000000U)                                       /*!< write operation */

/* MAC vlan tag data register value */
#define MAC_VLAN_TAG_DATA_VID(regval)            (BITS(0,15) & ((uint32_t)(regval) << 0))                       /*!< VLAN tag ID */

/* MAC vlan hash table register value */
#define MAC_VLAN_HASH_TABLE(regval)              (BITS(0,15) & ((uint32_t)(regval) << 0))                       /*!< VLAN hash table */

/* MAC Q0 tx flow control register value */
#define MAC_Q0_TX_FLOW_CTRL_PT(regval)           (BITS(16,31) & ((uint32_t)(regval) << 16))                     /*!< write value to ENET_MAC_Q0_TX_FLOW_CTRL_PT bit field */

#define MAC_Q0_TX_FLOW_CTRL_PLT(regval)          (BITS(4,6) & ((uint32_t)(regval) << 4))                        /*!< write value to ENET_MAC_Q0_TX_FLOW_CTRL_PLT bit field */
#define ENET_PAUSETIME_MINUS4                    MAC_Q0_TX_FLOW_CTRL_PLT(0)                                     /*!< pause time minus 4 slot times */
#define ENET_PAUSETIME_MINUS28                   MAC_Q0_TX_FLOW_CTRL_PLT(1)                                     /*!< pause time minus 28 slot times */
#define ENET_PAUSETIME_MINUS36                   MAC_Q0_TX_FLOW_CTRL_PLT(2)                                     /*!< pause time minus 36 slot times */
#define ENET_PAUSETIME_MINUS144                  MAC_Q0_TX_FLOW_CTRL_PLT(3)                                     /*!< pause time minus 144 slot times */
#define ENET_PAUSETIME_MINUS256                  MAC_Q0_TX_FLOW_CTRL_PLT(4)                                     /*!< pause time minus 256 slot times */
#define ENET_PAUSETIME_MINUS256_2                MAC_Q0_TX_FLOW_CTRL_PLT(5)                                     /*!< pause time minus 256 slot times */

#define ENET_ZERO_QUANTA_PAUSE_ENABLE            ((uint32_t)0x00000000U)                                        /*!< enable the automatic zero-quanta generation function */
#define ENET_ZERO_QUANTA_PAUSE_DISABLE           ENET_MAC_Q0_TX_FLOW_CTRL_DZPQ                                  /*!< disable the automatic zero-quanta generation function */
#define ENET_ZERO_QUANTA_PAUSE                   ENET_MAC_Q0_TX_FLOW_CTRL_DZPQ                                  /*!< the automatic zero-quanta generation function */

#define ENET_TX_FLOWCONTROL_ENABLE               ENET_MAC_Q0_TX_FLOW_CTRL_TFE                                   /*!< enable the flow control operation in the MAC */
#define ENET_TX_FLOWCONTROL_DISABLE              ((uint32_t)0x00000000U)                                        /*!< disable the flow control operation in the MAC */
#define ENET_TX_FLOWCONTROL                      ENET_MAC_Q0_TX_FLOW_CTRL_TFE                                   /*!< the flow control operation in the MAC */

#define ENET_BACK_PRESSURE_ENABLE                ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA                               /*!< enable the back pressure operation in the MAC */
#define ENET_BACK_PRESSURE_DISABLE               ((uint32_t)0x00000000U)                                        /*!< disable the back pressure operation in the MAC */
#define ENET_BACK_PRESSURE                       ENET_MAC_Q0_TX_FLOW_CTRL_FCB_BPA                               /*!< the back pressure operation in the MAC */

/* MAC receive flow control register value */
#define ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT (ENET_MAC_RX_FLOW_CTRL_UP << 8)                                /*!< besides the unique multicast address, MAC also use the MAC0 address to detect pause frame */
#define ENET_UNIQUE_PAUSEDETECT                  ((uint32_t)0x00000000U)                                        /*!< only the unique multicast address for pause frame which is specified in IEEE802.3 can be detected */

#define ENET_RX_FLOWCONTROL_ENABLE               (ENET_MAC_RX_FLOW_CTRL_RFE << 8)                               /*!< enable decoding function for the received pause frame and process it */
#define ENET_RX_FLOWCONTROL_DISABLE              ((uint32_t)0x00000000U)                                        /*!< decode function for pause frame is disabled */
#define ENET_RX_FLOWCONTROL                      ENET_RX_FLOWCONTROL_ENABLE                                      /*!< decoding function for the received pause frame and process it */

/* ENET_MAC_RXQ_CTRL4 register value */
#define MAC_UNICAST_ADDRESS_FLITER_FAIL                 ENET_MAC_RXQ_CTRL4_UFFQE                                /*!< unicast address filter fail packets queuing enable */
#define MAC_MULTICAST_ADDRESS_FLITER_FAIL               ENET_MAC_RXQ_CTRL4_MFFQE                                /*!< multicast address filter fail packets queuing enable */
#define MAC_VLAN_TAG_FLITER_FAIL                        ENET_MAC_RXQ_CTRL4_VFFQE                                /*!< VLAN tag filter fail packets queuing enable */
#define MAC_UNICAST_ADDRESS_FLITER_FAIL_QUEUE(regval)   (BIT(1) & ((uint32_t)(regval) << 1))                    /*!< unicast address filter fail packets queue */
#define MAC_MULTICAST_ADDRESS_FLITER_FAIL_QUEUE(regval) (BIT(9) & ((uint32_t)(regval) << 9))                    /*!< multicast address filter fail packets queue */
#define MAC_VLAN_TAG_FLITER_FAIL_QUEUE(regval)          (BIT(17) & ((uint32_t)(regval) << 17))                  /*!< VLAN tag filter fail packets queue */


/* ENET_MAC_RXQ_CTRL1 register value */
#define MAC_RXQ_CTRL1_MCBCQEN(regval)                  (BIT(20) & ((uint32_t)(regval) << 20))                /*!< multicast and broadcast queue enable */
#define MAC_RXQ_CTRL1_TACPQE(regval)                   (BIT(21) & ((uint32_t)(regval) << 21))                /*!< tagged AV control packets queuing enable */
#define MAC_RXQ_CTRL1_TPQC(regval)                     (BITS(22,23) & ((uint32_t)(regval) << 22))            /*!< tagged PTP over ethernet packets queuing control */
#define MAC_RXQ_CTRL1_OMCBCQ(regval)                   (BIT(28) & ((uint32_t)(regval) << 28))                /*!< over-riding MC-BC queue priority select */
#define MAC_RXQ_CTRL1_TBRQE(regval)                    (BIT(29) & ((uint32_t)(regval) << 29))                /*!< type field based Rx queuing enable */

#define MAC_RXQ_MCBC_PRIORITY_ENABLE          MAC_RXQ_CTRL1_MCBCQEN(1)              /*!< multicast and broadcast queue enable */
#define MAC_RXQ_MCBC_PRIORITY_DISABLE         ~MAC_RXQ_MCBC_PRIORITY_ENABLE         /*!< multicast and broadcast queue disable */

