sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define MAC_RXQ_PTPOE_AS_GENERIC_VLAN         ~MAC_RXQ_CTRL1_TPQC(3)                /*!< VLAN Tagged PTPoE packets are routed as generic VLAN Tagged packet */
#define MAC_RXQ_PTPOE_TO_PTPQ                 MAC_RXQ_CTRL1_TPQC(1)                 /*!< VLAN Tagged PTPoE packets are routed to Rx Queue specified by PTPQ field */
#define MAC_RXQ_PTPOE_TO_PSRQ                 MAC_RXQ_CTRL1_TPQC(2)                 /*!< VLAN Tagged PTPoE packets are routed to only AV enabled Rx Queues based on PSRQ */

#define MAC_AV_TAG_PACKET_QUEUE_ENABLE        MAC_RXQ_CTRL1_TACPQE(1)               /*!< tagged AV control packets queuing enable */
#define MAC_AV_TAG_PACKET_QUEUE_DISABLE       ~MAC_AV_TAG_PACKET_QUEUE_ENABLE       /*!< tagged AV control packets queuing disable */

#define MAC_RXQ_MCBC_PRIORITY_OVER_ENABLE     MAC_RXQ_CTRL1_OMCBCQ(1)               /*!< over-riding MC-BC queue priority select enable */
#define MAC_RXQ_MCBC_PRIORITY_OVER_DISABLE    ~MAC_RXQ_MCBC_PRIORITY_OVER_ENABLE    /*!< over-riding MC-BC queue priority select disable */

#define MAC_RXQ_TYPE_BASED_ENABLE             MAC_RXQ_CTRL1_TBRQE(1)                /*!< type field based Rx queuing enable */
#define MAC_RXQ_TYPE_BASED_DISABLE            ~MAC_RXQ_TYPE_BASED_ENABLE            /*!< type field based Rx queuing disable */

/* MAC PMT control and status register value */
#define ENET_PMT_FLAG_RWKFILTRST                  MAC_PMT_CONTROL_STATUS_RWKFILTRST                              /*!< remote wake-up packet filter register pointer reset */
#define ENET_PMT_WAKE_UP_PACKET_FORWARDING        MAC_PMT_CONTROL_STATUS_RWKPFE                                  /*!< enable remote wake-up Packet Forwarding enabled */
#define ENET_PMT_FLAG_RWKPRCVD                    MAC_PMT_CONTROL_STATUS_RWKPRCVD                                /*!< wakeup frame received */
#define ENET_PMT_FLAG_MGKPRCVD                    MAC_PMT_CONTROL_STATUS_MGKPRCVD                                /*!< magic packet received */
#define ENET_PMT_POWER_DOWN                       MAC_PMT_CONTROL_STATUS_PWRDWN                                  /*!< power down mode */
#define ENET_PMT_MAGIC_PACKET_FRAME               MAC_PMT_CONTROL_STATUS_RWKPKTEN                                /*!< enable a wakeup event due to magic packet reception */
#define ENET_PMT_WAKE_UP_FRAME                    MAC_PMT_CONTROL_STATUS_MGKPKTEN                                /*!< enable a wakeup event due to wakeup frame reception */
#define ENET_PMT_GLOBAL_UNICAST                   MAC_PMT_CONTROL_STATUS_GLBLUCAST                               /*!< any received unicast frame passed filter is considered to be a wakeup frame */

/* MAC PMT control and status register value */
#define ENET_LPI_TXCLOCK_STOP                     ENET_MAC_LPI_CONTROL_STATUS_LPITCSE                            /*!< stop LPI Tx clock */
#define ENET_LPI_TX_AUTOMATE                      ENET_MAC_LPI_CONTROL_STATUS_LPITXA                             /*!< LPI Tx automate */

#define ENET_PHY_LINK_UP                          ENET_MAC_LPI_CONTROL_STATUS_PLS                                /*!< the link is considered to be okay (UP) */
#define ENET_PHY_LINK_DOWN                        ((uint32_t)0x00000000U)                                        /*!< the link is considered to be down */

#define ENET_LPI_STATE_ENTER                      ENET_MAC_LPI_CONTROL_STATUS_LPIEN                              /*!< it instructs the MAC transmitter to enter the LPI state */
#define ENET_LPI_STATE_EXIT                       ((uint32_t)0x00000000U)                                        /*!< it instructs the MAC to exit the LPI state and resume normal transmission */

#define ENET_RX_LPI_STATE_DETECTED                ENET_MAC_LPI_CONTROL_STATUS_RLPIST                             /*!< receive LPI state detected */
#define ENET_TX_LPI_STATE_DETECTED                ENET_MAC_LPI_CONTROL_STATUS_TLPIST                             /*!< transmit LPI state detected */
#define ENET_RX_LPI_EXIT_DETECTED                 ENET_MAC_LPI_CONTROL_STATUS_RLPIEX                             /*!< receive LPI exit detected */
#define ENET_RX_LPI_ENTRY_DETECTED                ENET_MAC_LPI_CONTROL_STATUS_RLPIEN                             /*!< receive LPI entry detected */
#define ENET_TX_LPI_EXIT_DETECTED                 ENET_MAC_LPI_CONTROL_STATUS_TLPIEX                             /*!< transmit LPI exit detected */
#define ENET_TX_LPI_ENTRY_DETECTED                ENET_MAC_LPI_CONTROL_STATUS_TLPIEN                             /*!< transmit LPI entry detected */

/* MAC LPI timers control register value */
#define MAC_LPI_TIMERS_CONTROL_LST(regval)        (BITS(16,25) & ((uint32_t)(regval) << 16))                     /*!< write value to ENET_MAC_LPI_TIMERS_CONTROL_LST bit field */
#define MAC_LPI_TIMERS_CONTROL_TWT(regval)        (BITS(0,15) & ((uint32_t)(regval) << 0))                       /*!< write value to ENET_MAC_LPI_TIMERS_CONTROL_TWT bit field */

/* MAC LPI entry timer register value */
#define MAC_LPI_ENTRY_TIMER_LPIET(regval)         (BITS(3,19) & ((uint32_t)(regval) << 3))                       /*!< write value to ENET_MAC_LPI_ENTRY_TIMER_LPIET bit field */

/* MAC 1 microsecond tic counter register value */
#define MAC_1US_TIC_COUNTER_TIC_1US_CNTR(regval)  (BITS(0,11) & ((uint32_t)(regval) << 0))                       /*!< write value to ENET_MAC_1US_TIC_COUNTER_TIC_1US_CNTR bit field */

/* MAC debug register value */
#define ENET_MAC_TRANSMITTER_STATUS                     ENET_MAC_DEBUG_TFCSTS                         /*!< status of MAC transmitter */
#define ENET_MAC_TX_PROTOCOL_ENGINE_STATUS_DETECTED     ENET_MAC_DEBUG_TPESTS                         /*!< it indicates that the MAC MII transmit protocol engine is actively transmitting data, and it is not in the idle state */
#define ENET_RX_CONTROLLER_FIFO_STATUS                  ENET_MAC_DEBUG_RFCFCSTS                       /*!< MAC receive packet controller FIFO status */
#define ENET_MAC_RX_PROTOCOL_ENGINE_STATUS_DETECTED     ENET_MAC_DEBUG_RPESTS                         /*!< it indicates that the MAC MII receive protocol engine is actively receiving data, and it is not in the idle state. */

#define GET_MAC_DEBUG_RPESTS(regval)                    GET_BITS((regval),1,2)                        /*!< get value of ENET_MAC_DEBUG_RPESTS bit field */

#define GET_MAC_DEBUG_TPESTS(regval)                    GET_BITS((regval),17,18)                      /*!< get value of ENET_MAC_DEBUG_TPESTS bit field */

/* MAC FSM control register value */
#define ENET_PTP_DOMAIN_LARGE_MODE                      ENET_MAC_FSM_CONTROL_PLGRNML                  /*!< large mode tic generation is used for PTP domain */
#define ENET_PTP_DOMAIN_NORMAL_MODE                     ((uint32_t)0x00000000U)                       /*!< large mode tic generation is used for PTP domain */

