sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_APP_DOMAIN_LARGE_MODE                      ENET_MAC_FSM_CONTROL_ALGRNML                  /*!< large mode tic generation is used for APP domain */
#define ENET_APP_DOMAIN_NORMAL_MODE                     ((uint32_t)0x00000000U)                       /*!< large mode tic generation is used for APP domain */

#define ENET_CSR_DOMAIN_LARGE_MODE                      ENET_MAC_FSM_CONTROL_CLGRNML                  /*!< large mode tic generation is used for CSR domain */
#define ENET_CSR_DOMAIN_NORMAL_MODE                     ((uint32_t)0x00000000U)                       /*!< large mode tic generation is used for CSR domain */

#define ENET_RX_DOMAIN_LARGE_MODE                       ENET_MAC_FSM_CONTROL_RLGRNML                  /*!< large mode tic generation is used for Rx domain */
#define ENET_RX_DOMAIN_NORMAL_MODE                      ((uint32_t)0x00000000U)                       /*!< large mode tic generation is used for Rx domain */

#define ENET_TX_DOMAIN_LARGE_MODE                       ENET_MAC_FSM_CONTROL_TLGRNML                  /*!< large mode tic generation is used for Tx domain */
#define ENET_TX_DOMAIN_NORMAL_MODE                      ((uint32_t)0x00000000U)                       /*!< large mode tic generation is used for Tx domain */

#define ENET_PTP_FSM_PARITY_ERROR_INJECTION_ENABLE      ENET_MAC_FSM_CONTROL_PPEIN                    /*!< PTP FSM parity error injection is enabled */
#define ENET_PTP_FSM_PARITY_ERROR_INJECTION_DISABLE     ((uint32_t)0x00000000U)                       /*!< PTP FSM parity error injection is disabled */

#define ENET_APP_FSM_PARITY_ERROR_INJECTION_ENABLE      ENET_MAC_FSM_CONTROL_APEIN                    /*!< APP FSM parity error injection is enabled */
#define ENET_APP_FSM_PARITY_ERROR_INJECTION_DISABLE     ((uint32_t)0x00000000U)                       /*!< APP FSM parity error injection is disabled */

#define ENET_CSR_FSM_ONEHOTPROTECTION_ERROR_INJECTION_ENABLE  ENET_MAC_FSM_CONTROL_CPEIN                    /*!< CSR FSM one hot protection error injection is enabled */
#define ENET_CSR_FSM_ONEHOTPROTECTION_ERROR_INJECTION_DISABLE ((uint32_t)0x00000000U)                       /*!< CSR FSM one hot protection error injection is disabled */

#define ENET_RX_FSM_PARITY_ERROR_INJECTION_ENABLE       ENET_MAC_FSM_CONTROL_RPEIN                    /*!< Rx FSM parity error injection is enabled */
#define ENET_RX_FSM_PARITY_ERROR_INJECTION_DISABLE      ((uint32_t)0x00000000U)                       /*!< Rx FSM parity error injection is disabled */

#define ENET_TX_FSM_PARITY_ERROR_INJECTION_ENABLE       ENET_MAC_FSM_CONTROL_TPEIN                    /*!< Tx FSM parity error injection is enabled */
#define ENET_TX_FSM_PARITY_ERROR_INJECTION_DISABLE      ((uint32_t)0x00000000U)                       /*!< Tx FSM parity error injection is disabled */

#define ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE     ENET_MAC_FSM_CONTROL_PTEIN                    /*!< PTP FSM timeout error injection is enabled */
#define ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_DISABLE    ((uint32_t)0x00000000U)                       /*!< PTP FSM timeout error injection is disabled */

#define ENET_APP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE     ENET_MAC_FSM_CONTROL_ATEIN                    /*!< APP FSM timeout error injection is enabled */
#define ENET_APP_FSM_TIMEOUT_ERROR_INJECTION_DISABLE    ((uint32_t)0x00000000U)                       /*!< APP FSM timeout error injection is disabled */

#define ENET_CSR_FSM_TIMEOUT_ERROR_INJECTION_ENABLE     ENET_MAC_FSM_CONTROL_CTEIN                    /*!< CSR FSM timeout error injection is enabled */
#define ENET_CSR_FSM_TIMEOUT_ERROR_INJECTION_DISABLE    ((uint32_t)0x00000000U)                       /*!< CSR FSM timeout error injection is disabled */

#define ENET_RX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE      ENET_MAC_FSM_CONTROL_RTEIN                    /*!< Rx FSM timeout error injection is enabled */
#define ENET_RX_FSM_TIMEOUT_ERROR_INJECTION_DISABLE     ((uint32_t)0x00000000U)                       /*!< Rx FSM timeout error injection is disabled */

#define ENET_TX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE      ENET_MAC_FSM_CONTROL_TTEIN                    /*!< Tx FSM timeout error injection is enabled */
#define ENET_TX_FSM_TIMEOUT_ERROR_INJECTION_DISABLE     ((uint32_t)0x00000000U)                       /*!< Tx FSM timeout error injection is disabled */



#define ENET_FSM_PARITY_FEATURE_ENABLE                  ENET_MAC_FSM_CONTROL_PRTYEN                   /*!< FSM parity feature is enabled */
#define ENET_FSM_PARITY_FEATURE_DISABLE                 ((uint32_t)0x00000000U)                       /*!< FSM parity feature is disabled */

#define ENET_FSM_TIMEOUT_FEATURE_ENABLE                 ENET_MAC_FSM_CONTROL_TMOUTEN                  /*!< FSM timeout feature is enabled */
#define ENET_FSM_TIMEOUT_FEATURE_DISABLE                ((uint32_t)0x00000000U)                       /*!< FSM timeout feature is disabled */

/* MAC FSM ACT timer register value */
#define MAC_FSM_ACT_TIMER_LTMRMD(regval)                (BITS(20,23) & ((uint32_t)(regval) << 20))    /*!< write value to ENET_MAC_FSM_ACT_TIMER_LTMRMD bit field */
#define ENET_FSM_LARGE_MODE_TIMEOUT_DISABLE             MAC_FSM_ACT_TIMER_LTMRMD(0)                   /*!< timer disabled */
#define ENET_FSM_LARGE_MODE_TIMEOUT_1US                 MAC_FSM_ACT_TIMER_LTMRMD(1)                   /*!< 1us */
#define ENET_FSM_LARGE_MODE_TIMEOUT_4MS                 MAC_FSM_ACT_TIMER_LTMRMD(2)                   /*!< 1.024ms (~4ms) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_16MS                MAC_FSM_ACT_TIMER_LTMRMD(3)                   /*!< 16.384ms (~16ms) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_64MS                MAC_FSM_ACT_TIMER_LTMRMD(4)                   /*!< 65.536ms (~64ms) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_256MS               MAC_FSM_ACT_TIMER_LTMRMD(5)                   /*!< 262.144ms (~256ms) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_1SEC                MAC_FSM_ACT_TIMER_LTMRMD(6)                   /*!< 1.048sec (~1sec) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_4SEC                MAC_FSM_ACT_TIMER_LTMRMD(7)                   /*!< 4.194sec (~4sec) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_16SEC               MAC_FSM_ACT_TIMER_LTMRMD(8)                   /*!< 16.777sec (~16sec) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_32SEC               MAC_FSM_ACT_TIMER_LTMRMD(9)                   /*!< 33.554sec (~32sec) */
#define ENET_FSM_LARGE_MODE_TIMEOUT_64SEC               MAC_FSM_ACT_TIMER_LTMRMD(10)                  /*!< 67.108sec (~64sec) */

/* MAC FSM ACT timer register value */
#define MAC_FSM_ACT_TIMER_NTMRMD(regval)                (BITS(16,19) & ((uint32_t)(regval) << 16))    /*!< write value to ENET_MAC_FSM_ACT_TIMER_NTMRMD bit field */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_DISABLE             MAC_FSM_ACT_TIMER_NTMRMD(0)                   /*!< timer disabled */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_1US                 MAC_FSM_ACT_TIMER_NTMRMD(1)                   /*!< 1us */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_4MS                 MAC_FSM_ACT_TIMER_NTMRMD(2)                   /*!< 1.024ms (~4ms) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_16MS                MAC_FSM_ACT_TIMER_NTMRMD(3)                   /*!< 16.384ms (~16ms) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_64MS                MAC_FSM_ACT_TIMER_NTMRMD(4)                   /*!< 65.536ms (~64ms) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_256MS               MAC_FSM_ACT_TIMER_NTMRMD(5)                   /*!< 262.144ms (~256ms) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_1SEC                MAC_FSM_ACT_TIMER_NTMRMD(6)                   /*!< 1.048sec (~1sec) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_4SEC                MAC_FSM_ACT_TIMER_NTMRMD(7)                   /*!< 4.194sec (~4sec) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_16SEC               MAC_FSM_ACT_TIMER_NTMRMD(8)                   /*!< 16.777sec (~16sec) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_32SEC               MAC_FSM_ACT_TIMER_NTMRMD(9)                   /*!< 33.554sec (~32sec) */
#define ENET_FSM_NORMAL_MODE_TIMEOUT_64SEC               MAC_FSM_ACT_TIMER_NTMRMD(10)                  /*!< 67.108sec (~64sec) */

