sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define MAC_FSM_ACT_TIMER_TIMEOUT(regval)                (BITS(0,3) & ((uint32_t)(regval) << 0))       /*!< set timeout value */
#define ENET_FSM_TIMEOUT_DISABLE                         MAC_FSM_ACT_TIMER_TIMEOUT(0)                   /*!< timer disabled */
#define ENET_FSM_TIMEOUT_1US                             MAC_FSM_ACT_TIMER_TIMEOUT(1)                   /*!< 1us */
#define ENET_FSM_TIMEOUT_4MS                             MAC_FSM_ACT_TIMER_TIMEOUT(2)                   /*!< 1.024ms (~4ms) */
#define ENET_FSM_TIMEOUT_16MS                            MAC_FSM_ACT_TIMER_TIMEOUT(3)                   /*!< 16.384ms (~16ms) */
#define ENET_FSM_TIMEOUT_64MS                            MAC_FSM_ACT_TIMER_TIMEOUT(4)                   /*!< 65.536ms (~64ms) */
#define ENET_FSM_TIMEOUT_256MS                           MAC_FSM_ACT_TIMER_TIMEOUT(5)                   /*!< 262.144ms (~256ms) */
#define ENET_FSM_TIMEOUT_1SEC                            MAC_FSM_ACT_TIMER_TIMEOUT(6)                   /*!< 1.048sec (~1sec) */
#define ENET_FSM_TIMEOUT_4SEC                            MAC_FSM_ACT_TIMER_TIMEOUT(7)                   /*!< 4.194sec (~4sec) */
#define ENET_FSM_TIMEOUT_16SEC                           MAC_FSM_ACT_TIMER_TIMEOUT(8)                   /*!< 16.777sec (~16sec) */
#define ENET_FSM_TIMEOUT_32SEC                           MAC_FSM_ACT_TIMER_TIMEOUT(9)                   /*!< 33.554sec (~32sec) */
#define ENET_FSM_TIMEOUT_64SEC                           MAC_FSM_ACT_TIMER_TIMEOUT(10)                  /*!< 67.108sec (~64sec) */

#define MAC_FSM_ACT_TIMER_TMR(regval)                   (BITS(0,9) & ((uint32_t)(regval) << 0))         /*!< write value to ENET_MAC_FSM_ACT_TIMER_TMR bit field */

#define MAC_MDIO_ADDRESS_GOC(regval)                     (BITS(2,3) & ((uint32_t)(regval) << 2))       /*!< write value to ENET_MAC_MDIO_ADDRESS_GOC bit field */
#define ENET_MDIO_OPERATION_WRITE                        MAC_MDIO_ADDRESS_GOC(1)                       /*!< write */
#define ENET_MDIO_POSTREAD_INCREMENT_ADDRESS             MAC_MDIO_ADDRESS_GOC(2)                       /*!< post read increment address for Clause 45 PHY */
#define ENET_MDIO_OPERATION_READ                         MAC_MDIO_ADDRESS_GOC(3)                       /*!< read */

#define MAC_MDIO_ADDRESS_NTC(regval)                    (BITS(12,14) & ((uint32_t)(regval) << 12))     /*!< write value to ENET_MAC_MDIO_ADDRESS_NTC bit field */

#define MAC_MDIO_ADDRESS_RDA(regval)                    (BITS(16,20) & ((uint32_t)(regval) << 16))     /*!< write value to ENET_MAC_MDIO_ADDRESS_RDA bit field */

#define MAC_MDIO_ADDRESS_PA(regval)                     (BITS(21,25) & ((uint32_t)(regval) << 21))     /*!< write value to ENET_MAC_MDIO_ADDRESS_PA bit field */

#define ENET_PHY_CLAUSE_45                              ENET_MAC_MDIO_ADDRESS_C45E                    /*!< Clause 45 PHY is enabled */
#define ENET_PHY_CLAUSE_22                              ((uint32_t)0x00000000U)                       /*!< Clause 22 PHY is enabled */

/* MAC MDIO data register value */
#define MAC_MDIO_DATA_GD(regval)                        (BITS(0,15) & ((uint32_t)(regval) << 0))       /*!< write value to ENET_MAC_MDIO_ADDRESS_GD bit field */

#define MAC_MDIO_DATA_RA(regval)                        (BITS(16,31) & ((uint32_t)(regval) << 16))      /*!< write value to ENET_MAC_MDIO_ADDRESS_RA bit field */

/* MAC ARP address register value */
#define MAC_ARP_ADDRESS_ARPPA(regval)               (BITS(0,31) & ((uint32_t)(regval) << 0))       /*!< write value to ENET_MAC_MAC_ARP_ADDRESS_ARPPA bit field */

/* MAC CSR software control register value */
#define ENET_SLAVE_ERROR_RESPONSE_ENABLE                ENET_MAC_CSR_SW_CTRL_SEEN                      /*!< the MAC responds with Slave Error for accesses to reserved registers in CSR space. */
#define ENET_SLAVE_ERROR_RESPONSE_DISABLE               ((uint32_t)0x00000000U)                        /*!< the MAC responds with Okay response to any register accessed from CSR space */

#define ENET_REGISTER_CLEAR_ON_WRITE_1                  ENET_MAC_CSR_SW_CTRL_RCWE                      /*!< the access mode of some register fields changes to Clear on Write 1, the application needs to set that respective bit to 1 to clear it */
#define ENET_REGISTER_CLEAR_ON_READ                     ((uint32_t)0x00000000U)                        /*!< the access mode of these register fields remain as Clear on Read */

/* MAC FPE control STS register value */
#define ENET_TRANSMITTED_RESPOND_FRAME                  ENET_MAC_FPE_CTRL_STS_TRSP                     /*!< transmitted respond frame */
#define ENET_TRANSMITTED_VERIFY_FRAME                   ENET_MAC_FPE_CTRL_STS_TVER                     /*!< transmitted verify frame */
#define ENET_RECEIVED_RESPOND_FRAME                     ENET_MAC_FPE_CTRL_STS_RRSP                     /*!< received respond frame */
#define ENET_RECEIVED_VERIFY_FRAME                      ENET_MAC_FPE_CTRL_STS_RVER                     /*!< received verify frame */
#define ENET_SEND_RESPOND_FRAME                         ENET_MAC_FPE_CTRL_STS_SRSP                     /*!< send respond frame */
#define ENET_SEND_VERIFY_FRAME                          ENET_MAC_FPE_CTRL_STS_SVER                     /*!< send verify frame */

#define ENET_AUTOGENERATE_RESPOND_MPACKET_ENABLE        ENET_MAC_FPE_CTRL_STS_ARV                      /*!< autogenerate respond mPacket on receiving verify mPacket is enabled */
#define ENET_AUTOGENERATE_RESPOND_MPACKET_DISABLE       ((uint32_t)0x00000000U)                        /*!< autogenerate respond mPacket on receiving verify mPacket is disable */
#define ENET_AUTOGENERATE_RESPOND_MPACKET               ENET_MAC_FPE_CTRL_STS_ARV           

#define ENET_TX_FRAME_PREEMPTION_ENABLE                 ENET_MAC_FPE_CTRL_STS_EFPE                     /*!< Tx frame preemption is enabled */
#define ENET_TX_FRAME_PREEMPTION_DISABLE                ((uint32_t)0x00000000U)                               /*!< Tx frame preemption is disable */
#define ENET_TX_FRAME_PREEMPTION                        ENET_MAC_FPE_CTRL_STS_EFPE
/* MAC presentation time register value */
#define MAC_PRESN_TIME_NS_MPTN(regval)                  (BITS(0,31) & ((uint32_t)(regval) << 0))       /*!< write value to ENET_MAC_PRESN_TIME_NS_MPTN bit field */

/* MAC pesentation time update register value */
#define MAC_PRESN_TIME_UPDT_MPTU(regval)                (BITS(0,31) & ((uint32_t)(regval) << 0))       /*!< write value to ENET_MAC_PRESN_TIME_UPDT_MPTU bit field */

/* MAC address 0 high register value */
#define MAC_ADDR0H_ADDRH(regval)                        (BITS(0,15) & ((uint32_t)(regval) << 0))      /*!< write value to ENET_MAC_ADDRESS0_HIGH_ADDRH bit field */

/* MAC addressx high register value, x = 1,2 */
#define MAC_ADDR12H_ADDR12H(regval)                     (BITS(0,15) & ((uint32_t)(regval) << 0))      /*!< write value to ENET_MAC_ADDRESSx_ADDRH(x=1,2) bit field */

#define ENET_ADDRESS_MASK_NONE                          ((uint32_t)0x00000000)                        /*!< do not mask any bytes */
#define ENET_ADDRESS_MASK_BYTE0                         BIT(24)                                       /*!< low register bits [7:0] */
#define ENET_ADDRESS_MASK_BYTE1                         BIT(25)                                       /*!< low register bits [15:8] */
#define ENET_ADDRESS_MASK_BYTE2                         BIT(26)                                       /*!< low register bits [23:16] */
#define ENET_ADDRESS_MASK_BYTE3                         BIT(27)                                       /*!< low register bits [31:24] */
#define ENET_ADDRESS_MASK_BYTE4                         BIT(28)                                       /*!< high register bits [7:0] */
#define ENET_ADDRESS_MASK_BYTE5                         BIT(29)                                       /*!< high register bits [15:8] */

