sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_ADDRESS_FILTER_SA                          BIT(30)                                       /*!< use MAC address[47:0] is to compare with the SA fields of the received frame */
#define ENET_ADDRESS_FILTER_DA                         ((uint32_t)0x00000000)                         /*!< use MAC address[47:0] is to compare with the DA fields of the received frame */

/* MMC control register value */
#define ENET_MMC_DROPPED_BROADCAST_UPDATE         ENET_MMC_CONTROL_UCDBC                             /*!< update MMC counters for dropped broadcast packets */
#define ENET_MMC_COUNTER_STOP_ROLLOVER            ENET_MMC_CONTROL_CNTSTOPRO                         /*!< counter stop rollover */
#define ENET_MMC_RESET_ON_READ                    ENET_MMC_CONTROL_RSTONRD                           /*!< reset on read */
#define ENET_MMC_COUNTERS_FREEZE                  ENET_MMC_CONTROL_CNTFREEZ                          /*!< MMC counter freeze */

/* MAC layer 3 layer 4 control register value */
#define MAC_L3_L4_CONTROL_L3HDBM0(regval)              (BITS(11,15) & ((uint32_t)(regval) << 11))     /*!< write value to ENET_MAC_L3_L4_CONTROL_L3HDBM0 bit field */

#define MAC_L3_L4_CONTROL_L3HSBM0(regval)              (BITS(6,10) & ((uint32_t)(regval) << 6))       /*!< write value to ENET_MAC_L3_L4_CONTROL_L3HSBM0 bit field */

#define MAC_L3_L4_CONTROL_DMCHN0(regval)               (BIT(24) & ((uint32_t)(regval) << 24))         /*!< write value to ENET_MAC_L3_L4_CONTROL_DMCHN0 bit field */

#define ENET_L3L4FILTER_DMA_CHANNEL_SELECT              ENET_MAC_L3_L4_CONTROL_DMCHEN0                /*!< enable the selection of the DMA channel number for the packet that is passed by L3_L4 filter */
#define ENET_L3L4FILTER_DMA_CHANNEL_1                   ENET_MAC_L3_L4_CONTROL_DMCHN0                 /*!< selects the DMA Channel 1 to which the packet passed by this filter is routed */
#define ENET_L3L4FILTER_DMA_CHANNEL_0                   ((uint32_t)0x00000000)                        /*!< selects the DMA Channel 0 to which the packet passed by this filter is routed */

#define ENET_L4_DEST_PORT_NORMAL_MATCH                  ENET_MAC_L3_L4_CONTROL_L4DPM0                                       /*!< the layer 4 destination port number field is configurated for matching */
#define ENET_L4_DEST_PORT_INVERSE_MATCH                (ENET_MAC_L3_L4_CONTROL_L4DPM0 | ENET_MAC_L3_L4_CONTROL_L4DPIM0)     /*!< the layer 4 destination port number field is configurated for inverse matching */
#define ENET_L4_DEST_PORT_MATCH_DISABLE                ((uint32_t)0x00000000)                                               /*!< the MAC ignores the layer 4 destination port number field for matching */

#define ENET_L4_SRC_PORT_NORMAL_MATCH            ENET_MAC_L3_L4_CONTROL_L4SPM0                                       /*!< the layer 4 source port number field is configurated for matching */
#define ENET_L4_SRC_PORT_INVERSE_MATCH           (ENET_MAC_L3_L4_CONTROL_L4SPM0 | ENET_MAC_L3_L4_CONTROL_L4SPIM0)    /*!< the layer 4 source port number field is configurated for inverse matching */
#define ENET_L4_SRC_PORT_MATCH_DISABLE                  ((uint32_t)0x00000000)                                              /*!< the MAC ignores the layer 4 source port number field for matching */

#define ENET_L4_PROTOCOL_MATCH_UDP                      ENET_MAC_L3_L4_CONTROL_L4PEN0                 /*!< the source and destination port number fields of UDP packets are used for matching */


#define ENET_L3_DEST_IPADDR_NORMAL_MATCH                ENET_MAC_L3_L4_CONTROL_L3DAM0                                      /*!< the layer 3 IP destination address field is configurated for matching */
#define ENET_L3_DEST_IPADDR_INVERSE_MATCH              (ENET_MAC_L3_L4_CONTROL_L3DAM0 | ENET_MAC_L3_L4_CONTROL_L3DAIM0)    /*!< the layer 3 IP destination address field is configurated for inverse matching */
#define ENET_L3_DEST_IPADDR_MATCH_DISABLE              ((uint32_t)0x00000000)                                              /*!< the MAC ignores the layer 4 destination port number field for matching */

#define ENET_L3_SRC_IPADDR_NORMAL_MATCH                ENET_MAC_L3_L4_CONTROL_L3SAM0                                       /*!< the Layer 3 IP source address field is configurated for matching */
#define ENET_L3_SRC_IPADDR_INVERSE_MATCH              (ENET_MAC_L3_L4_CONTROL_L3SAM0 | ENET_MAC_L3_L4_CONTROL_L3SAIM0)     /*!< the layer 3 IP source address field is configurated for inverse matching */
#define ENET_L3_SRC_IPADDR_MATCH_DISABLE              ((uint32_t)0x00000000)                                               /*!< the MAC ignores the layer 3 IP source address field for matching */

#define ENET_L3_PROTOCOL_MATCH_IPV6                   ENET_MAC_L3_L4_CONTROL_L3PEN0                                        /*!< the layer 3 IP source or destination address matching is configurated for IPv6 packets */
#define ENET_L3_PROTOCOL_MATCH_IPV4                   ((uint32_t)0x00000000)                                               /*!< the layer 3 IP source or destination address matching is configurated for IPv4 packets */


/* MAC layer 4 address register value */
#define MAC_LAYER4_ADDRESS_L4DP0(regval)               (BITS(16,31) & ((uint32_t)(regval) << 16))               /*!< write value to ENET_MAC_LAYER4_ADDRESS_L4DP0 bit field */

#define MAC_LAYER4_ADDRESS_L4SP0(regval)               (BITS(0,15) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MAC_LAYER4_ADDRESS_L4SP0 bit field */

/* MAC indirect access control register value */
#define MAC_INDIR_ACCESS_CTRL_MSEL(regval)              (BITS(16,19) & ((uint32_t)(regval) << 16))               /*!< write value to ENET_MAC_INDIR_ACCESS_CTRL_MSEL bit field */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REGS                MAC_INDIR_ACCESS_CTRL_MSE(0)                             /*!< MAC_TMRQ_Regs */

#define MAC_INDIR_ACCESS_CTRL_AOFF(regval)             (BITS(8,15) & ((uint32_t)(regval) << 8))                 /*!< write value to ENET_MAC_INDIR_ACCESS_CTRL_AOFF bit field */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG0                MAC_INDIR_ACCESS_CTRL_AOFF(0)                            /*!< MAC_TMRQ_Reg0 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG1                MAC_INDIR_ACCESS_CTRL_AOFF(1)                            /*!< MAC_TMRQ_Reg1 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG2                MAC_INDIR_ACCESS_CTRL_AOFF(2)                            /*!< MAC_TMRQ_Reg2 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG3                MAC_INDIR_ACCESS_CTRL_AOFF(3)                            /*!< MAC_TMRQ_Reg3 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG4                MAC_INDIR_ACCESS_CTRL_AOFF(4)                            /*!< MAC_TMRQ_Reg4 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG5                MAC_INDIR_ACCESS_CTRL_AOFF(5)                            /*!< MAC_TMRQ_Reg5 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG6                MAC_INDIR_ACCESS_CTRL_AOFF(6)                            /*!< MAC_TMRQ_Reg6 */
#define ENET_INDIR_ACCESS_MAC_TMRQ_REG7                MAC_INDIR_ACCESS_CTRL_AOFF(7)                            /*!< MAC_TMRQ_Reg7 */

#define ENET_ADDR_OFFSET_AUTO_INCREMENT                ENET_MAC_INDIR_ACCESS_CTRL_AUTO                          /*!< AOFF is incremented by 1 */
#define ENET_INDIR_ACCESS_READ                         ENET_MAC_INDIR_ACCESS_CTRL_COM                           /*!< read operation */
#define ENET_INDIR_ACCESS_WRITE                        ((uint32_t)0x00000000)                                   /*!< write operation */
#define ENET_INDIR_ACCESS_BUSY                         ENET_MAC_INDIR_ACCESS_CTRL_OB                            /*!< operation busy */



/* MAC type match recieve queue number register value */
#define MAC_TMRQ_REGS_PFEX(regval)                    (BIT(20) & ((uint32_t)(regval) << 20))                   /*!< write value to ENET_MAC_TMRQ_REGS_PFEX bit field */

