sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define MAC_TMRQ_REGS_TMRQ(regval)                    (BITS(16,18) & ((uint32_t)(regval) << 16))               /*!< write value to ENET_MAC_TMRQ_REGS_TMRQ bit field */

#define MAC_TMRQ_REGS_TYP(regval)                     (BITS(0,15) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MAC_TMRQ_REGS_TYP bit field */

/* MAC_Timestamp_Control register value */
#define ENET_RXTX_TIMESTAMP                           ENET_MAC_TIMESTAMP_CONTROL_TSENA                          /*!< enable timestamp function for transmit and receive frames */
#define ENET_PRESENTATION_TIMESTAMP                   ENET_MAC_TIMESTAMP_CONTROL_PTGE                           /*!< enable presentation time generation function */
#define ENET_ALL_RX_TIMESTAMP                         ENET_MAC_TIMESTAMP_CONTROL_TSENALL                        /*!< all received frames are taken snapshot */
#define ENET_NONTYPE_FRAME_SNAPSHOT                   ENET_MAC_TIMESTAMP_CONTROL_TSIPENA                        /*!< take snapshot when received non type frame */
#define ENET_IPV6_FRAME_SNAPSHOT                      ENET_MAC_TIMESTAMP_CONTROL_TSIPV6ENA                      /*!< take snapshot for IPv6 frame */
#define ENET_IPV4_FRAME_SNAPSHOT                      ENET_MAC_TIMESTAMP_CONTROL_TSIPV4ENA                      /*!< take snapshot for IPv4 frame */
#define ENET_PTP_FRAME_USE_MACADDRESS_FILTER          ENET_MAC_TIMESTAMP_CONTROL_TSENMACADDR                    /*!< enable MAC address to filter the PTP frame */
#define ENET_TX_TIMESTAMP_OVERWRITE                   ENET_MAC_TIMESTAMP_CONTROL_TXTSSTSM                    /*!< enable transmit timestamp status mode */
#define ENET_AV8021_AS_MODE                           ENET_MAC_TIMESTAMP_CONTROL_AV8021ASMEN                    /*!< enable AV 802.1AS mode-  the MAC processes only untagged PTP over Ethernet packets */


/* MAC_Sub_Second_Increment register value */
#define PTP_SUB_SECOND_INCREMENT_SSINC(regval)        (BITS(16,23) & ((uint32_t)(regval) << 16))           /*!< write value to MAC_PTP_SUB_SECOND_INCREMENT_SSINC bit field */
#define PTP_SUB_SECOND_INCREMENT_SNSINC(regval)       (BITS(8,15) & ((uint32_t)(regval) << 8))             /*!< write value to MAC_PTP_SUB_SECOND_INCREMENT_SNSINC bit field */

/* MAC_System_Time_Nanoseconds register value */
#define GET_PTP_SYSTIME_TSSSS(regval)                  GET_BITS((uint32_t)(regval),0,30)                   /*!< get value of ENET_MAC_SYSTEM_TIME_NANOSECONDS_TSSS bit field */

/* MAC_System_Time_Nanoseconds_Update register value */
#define MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS(regval)     (BITS(0,30) & ((uint32_t)(regval) << 0))       /*!< write value to ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_TSSS bit field */

#define ENET_PTP_ADD_TO_TIME                      ((uint32_t)0x00000000)                                   /*!< timestamp update value is added to system time */
#define ENET_PTP_SUBSTRACT_FROM_TIME              ENET_MAC_SYSTEM_TIME_NANOSECONDS_UPDATE_ADDSUB           /*!< timestamp update value is subtracted from system time */

/* MAC system time higher word in seconds register value */
#define MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR(regval)   (BITS(0,15) & ((uint32_t)(regval) << 0))          /*!< write value to ENET_MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS_TSHWR bit field */

/* MAC receive clock domain time increment value register value */
#define MAC_RX_DOMAIN_TIME_INCR_RXSNS(regval)               (BITS(8,15) & ((uint32_t)(regval) << 8))          /*!< write value to ENET_MAC_RX_DOMAIN_TIME_INCR_RXSNS bit field */

#define MAC_RX_DOMAIN_TIME_INCR_RXNS(regval)                (BITS(16,31) & ((uint32_t)(regval) << 31))        /*!< write value to ENET_MAC_RX_DOMAIN_TIME_INCR_RXNS bit field */

/* MAC receive clock domain time increment value register value */
#define MAC_TX_DOMAIN_TIME_INCR_TXSNS(regval)               (BITS(8,15) & ((uint32_t)(regval) << 8))          /*!< write value to ENET_MAC_TX_DOMAIN_TIME_INCR_TXSNS bit field */

#define MAC_TX_DOMAIN_TIME_INCR_TXNS(regval)                (BITS(16,31) & ((uint32_t)(regval) << 31))        /*!< write value to ENET_MAC_TX_DOMAIN_TIME_INCR_TXNS bit field */

/* MAC transmit timestamp status in nanoseconds register value */
#define GET_TX_TIMESTAMP_STATUS_LOW(regval)                 GET_BITS((uint32_t)(regval),0,30)                 /*!< get value of ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO bit field */

#define ENET_TX_TIMESTAMP_STATUS_MISSED                     ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS /*!< enable timestamp function for transmit and receive frames */

/* MAC timestamp ingress correction in subnanoseconds register value */
#define MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS(regval) (BITS(8,15) & ((uint32_t)(regval) << 8))          /*!< write value to ENET_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS bit field */

/* MAC timestamp egress correction in subnanoseconds register value */
#define MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS(regval) (BITS(8,15) & ((uint32_t)(regval) << 8))          /*!< write value to ENET_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS bit field */

/* MAC timestamp ingress latency register value */
#define MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS(regval)       (BITS(8,15) & ((uint32_t)(regval) << 8))           /*!< write value to ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS bit field */

#define MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS(regval)         (BITS(16,27) & ((uint32_t)(regval) << 16))         /*!< write value to ENET_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS bit field */

/* MAC timestamp egress latency register value */
#define MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS(regval)       (BITS(8,15) & ((uint32_t)(regval) << 8))           /*!< write value to ENET_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS bit field */

#define MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS(regval)         (BITS(16,27) & ((uint32_t)(regval) << 16))         /*!< write value to ENET_TIMESTAMP_EGRESS_LATENCY_ETLNS bit field */

/* MAC PPS control register value */
#define MAC_PPS_CONTROL_PPSCTRL_PPSCMD(regval)     (BITS(0,3) & ((uint32_t)(regval) << 0))                    /*!< write value to ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD bit field */
#define ENET_PPSOFC_1HZ                            MAC_PPS_CONTROL_PPSCTRL_PPSCMD(0)                          /*!< PPS output 1Hz frequency */
#define ENET_PPSOFC_2HZ                            MAC_PPS_CONTROL_PPSCTRL_PPSCMD(1)                          /*!< PPS output 2Hz frequency */
#define ENET_PPSOFC_4HZ                            MAC_PPS_CONTROL_PPSCTRL_PPSCMD(2)                          /*!< PPS output 4Hz frequency */
#define ENET_PPSOFC_8HZ                            MAC_PPS_CONTROL_PPSCTRL_PPSCMD(3)                          /*!< PPS output 8Hz frequency */
#define ENET_PPSOFC_16HZ                           MAC_PPS_CONTROL_PPSCTRL_PPSCMD(4)                          /*!< PPS output 16Hz frequency */
#define ENET_PPSOFC_32HZ                           MAC_PPS_CONTROL_PPSCTRL_PPSCMD(5)                          /*!< PPS output 32Hz frequency */
#define ENET_PPSOFC_64HZ                           MAC_PPS_CONTROL_PPSCTRL_PPSCMD(6)                          /*!< PPS output 64Hz frequency */
#define ENET_PPSOFC_128HZ                          MAC_PPS_CONTROL_PPSCTRL_PPSCMD(7)                          /*!< PPS output 128Hz frequency */
#define ENET_PPSOFC_256HZ                          MAC_PPS_CONTROL_PPSCTRL_PPSCMD(8)                          /*!< PPS output 256Hz frequency */
#define ENET_PPSOFC_512HZ                          MAC_PPS_CONTROL_PPSCTRL_PPSCMD(9)                          /*!< PPS output 512Hz frequency */
#define ENET_PPSOFC_1024HZ                         MAC_PPS_CONTROL_PPSCTRL_PPSCMD(10)                         /*!< PPS output 1024Hz frequency */
#define ENET_PPSOFC_2048HZ                         MAC_PPS_CONTROL_PPSCTRL_PPSCMD(11)                         /*!< PPS output 2048Hz frequency */
#define ENET_PPSOFC_4096HZ                         MAC_PPS_CONTROL_PPSCTRL_PPSCMD(12)                         /*!< PPS output 4096Hz frequency */
#define ENET_PPSOFC_8192HZ                         MAC_PPS_CONTROL_PPSCTRL_PPSCMD(13)                         /*!< PPS output 8192Hz frequency */
#define ENET_PPSOFC_16384HZ                        MAC_PPS_CONTROL_PPSCTRL_PPSCMD(14)                         /*!< PPS output 16384Hz frequency */
#define ENET_PPSOFC_32768HZ                        MAC_PPS_CONTROL_PPSCTRL_PPSCMD(15)                         /*!< PPS output 32768Hz frequency */

#define ENET_FLEXIBLE_PPS0_START_SINGLE_PULSE       MAC_PPS_CONTROL_PPSCTRL_PPSCMD(1)                          /*!< generates single pulse rising at the start point */
#define ENET_FLEXIBLE_PPS0_START_PULSE_TRAIN        MAC_PPS_CONTROL_PPSCTRL_PPSCMD(2)                          /*!< generates the train of pulses rising at the start point */
#define ENET_FLEXIBLE_PPS0_CANCEL_START             MAC_PPS_CONTROL_PPSCTRL_PPSCMD(3)                          /*!< cancels the start single pulse and start pulse train commands */
#define ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_AT_TIME MAC_PPS_CONTROL_PPSCTRL_PPSCMD(4)                          /*!< stops the train of pulses after the time programmed in the Target Time registers elapses */
#define ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_NOW     MAC_PPS_CONTROL_PPSCTRL_PPSCMD(5)                          /*!< immediately stops the train of pulses  */
#define ENET_FLEXIBLE_PPS0_CANCEL_STOP_PULSE_TRAIN  MAC_PPS_CONTROL_PPSCTRL_PPSCMD(6)                          /*!< cancels the stop pulse train at time command if the programmed stop time has not elapsed */

