sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_MCGR0_OPERATION_NONE                   MAC_PPS_CONTROL_PPSCTRL_PPSCMD(0)                          /*!< MCGR operation is not carried out */
#define ENET_MCGR0_CAPTURE_RISING                   MAC_PPS_CONTROL_PPSCTRL_PPSCMD(1)                          /*!< capture the presentation time at the rising edge */
#define ENET_MCGR0_CAPTURE_FALLING                  MAC_PPS_CONTROL_PPSCTRL_PPSCMD(2)                          /*!< capture the presentation time at the falling edge */
#define ENET_MCGR0_CAPTURE_BOTH                     MAC_PPS_CONTROL_PPSCTRL_PPSCMD(3)                          /*!< capture the presentation time at both edges */
#define ENET_MCGR0_OUTPUT_TOGGLE                    MAC_PPS_CONTROL_PPSCTRL_PPSCMD(9)                          /*!< toggle output on compare */
#define ENET_MCGR0_OUTPUT_LOW                       MAC_PPS_CONTROL_PPSCTRL_PPSCMD(10)                         /*!< pulse output low on compare for one PTP-clock cycle */
#define ENET_MCGR0_OUTPUT_HIGH                      MAC_PPS_CONTROL_PPSCTRL_PPSCMD(11)                         /*!< pulse output high on compare for one PTP-clock cycle */

#define MAC_PPS_CONTROL_TRGTMODSEL0(regval)       (BITS(5,6) & ((uint32_t)(regval) << 5))                     /*!< write value to ENET_MAC_PPS_CONTROL_TRGTMODSEL0 bit field */
#define ENET_PPS0_GENERATE_INT_ONLY               MAC_PPS_CONTROL_TRGTMODSEL0(0)                              /*!< target time registers are programmed only for generating the interrupt event */
#define ENET_PPS0_MCGR_INT_ENBALE                 MAC_PPS_CONTROL_TRGTMODSEL0(1)                              /*!< enables MCGR interrupt */
#define ENET_PPS0_GENERATE_INT_AND_OUTPUT         MAC_PPS_CONTROL_TRGTMODSEL0(2)                              /*!< target time registers are programmed for generating the interrupt event and starting or stopping the PPS output signal generation */
#define ENET_PPS0_GENERATE_OUTPUT_ONLY            MAC_PPS_CONTROL_TRGTMODSEL0(3)                              /*!< target time registers are programmed only for starting or stopping the PPS output signal generation */

#define MAC_PPS_CONTROL_PPSCMD1(regval)              (BITS(8,11) & ((uint32_t)(regval) << 8))                    /*!< write value to ENET_MAC_PPS_CONTROL_PPSCMD1 bit field */

#define ENET_FLEXIBLE_PPS1_START_SINGLE_PULSE         MAC_PPS_CONTROL_PPSCMD1(1)                              /*!< generates single pulse rising at the start point */
#define ENET_FLEXIBLE_PPS1_START_PULSE_TRAIN          MAC_PPS_CONTROL_PPSCMD1(2)                              /*!< generates the train of pulses rising at the start point */
#define ENET_FLEXIBLE_PPS1_CANCEL_START               MAC_PPS_CONTROL_PPSCMD1(3)                              /*!< cancels the start single pulse and start pulse train commands */
#define ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_AT_TIME   MAC_PPS_CONTROL_PPSCMD1(4)                              /*!< stops the train of pulses after the time programmed in the Target Time registers elapses */
#define ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_NOW       MAC_PPS_CONTROL_PPSCMD1(5)                              /*!< immediately stops the train of pulses  */
#define ENET_FLEXIBLE_PPS1_CANCEL_STOP_PULSE_TRAIN    MAC_PPS_CONTROL_PPSCMD1(6)                              /*!< cancels the stop pulse train at time command if the programmed stop time has not elapsed */

#define ENET_MCGR1_OPERATION_NONE                     MAC_PPS_CONTROL_PPSCMD1(0)                              /*!< MCGR operation is not carried out */
#define ENET_MCGR1_CAPTURE_RISING                     MAC_PPS_CONTROL_PPSCMD1(1)                             /*!< capture the presentation time at the rising edge */
#define ENET_MCGR1_CAPTURE_FALLING                    MAC_PPS_CONTROL_PPSCMD1(2)                              /*!< capture the presentation time at the falling edge */
#define ENET_MCGR1_CAPTURE_BOTH                       MAC_PPS_CONTROL_PPSCMD1(3)                              /*!< capture the presentation time at both edges */
#define ENET_MCGR1_OUTPUT_TOGGLE                      MAC_PPS_CONTROL_PPSCMD1(9)                             /*!< toggle output on compare */
#define ENET_MCGR1_OUTPUT_LOW                         MAC_PPS_CONTROL_PPSCMD1(10)                             /*!< pulse output low on compare for one PTP-clock cycle */
#define ENET_MCGR1_OUTPUT_HIGH                        MAC_PPS_CONTROL_PPSCMD1(11)                             /*!< pulse output high on compare for one PTP-clock cycle */

#define MAC_PPS_CONTROL_TRGTMODSEL1(regval)           (BITS(13,14) & ((uint32_t)(regval) << 13))                 /*!< write value to ENET_MAC_PPS_CONTROL_TRGTMODSEL1 bit field */
#define ENET_PPS1_GENERATE_INT_ONLY                   MAC_PPS_CONTROL_TRGTMODSEL1(0)                          /*!< target time registers are programmed only for generating the interrupt event */
#define ENET_PPS1_MCGR_INT_ENBALE                     MAC_PPS_CONTROL_TRGTMODSEL1(1)                          /*!< enables MCGR interrupt */
#define ENET_PPS1_GENERATE_INT_AND_OUTPUT             MAC_PPS_CONTROL_TRGTMODSEL1(2)                          /*!< target time registers are programmed for generating the interrupt event and starting or stopping the PPS output signal generation */
#define ENET_PPS1_GENERATE_OUTPUT_ONLY                MAC_PPS_CONTROL_TRGTMODSEL1(3)                          /*!< target time registers are programmed only for starting or stopping the PPS output signal generation */

#define MAC_PPS_CONTROL_PPSCMD2(regval)              (BITS(16,19) & ((uint32_t)(regval) << 16))               /*!< write value to ENET_MAC_PPS_CONTROL_PPSCMD2 bit field */

#define ENET_FLEXIBLE_PPS2_START_SINGLE_PULSE         MAC_PPS_CONTROL_PPSCMD2(1)                              /*!< generates single pulse rising at the start point */
#define ENET_FLEXIBLE_PPS2_START_PULSE_TRAIN          MAC_PPS_CONTROL_PPSCMD2(2)                              /*!< generates the train of pulses rising at the start point */
#define ENET_FLEXIBLE_PPS2_CANCEL_START               MAC_PPS_CONTROL_PPSCMD2(3)                              /*!< cancels the start single pulse and start pulse train commands */
#define ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_AT_TIME   MAC_PPS_CONTROL_PPSCMD2(4)                              /*!< stops the train of pulses after the time programmed in the Target Time registers elapses */
#define ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_NOW       MAC_PPS_CONTROL_PPSCMD2(5)                              /*!< immediately stops the train of pulses  */
#define ENET_FLEXIBLE_PPS2_CANCEL_STOP_PULSE_TRAIN    MAC_PPS_CONTROL_PPSCMD2(6)                              /*!< cancels the stop pulse train at time command if the programmed stop time has not elapsed */

#define ENET_MCGR2_OPERATION_NONE                     MAC_PPS_CONTROL_PPSCMD2(0)                              /*!< MCGR operation is not carried out */
#define ENET_MCGR2_CAPTURE_RISING                     MAC_PPS_CONTROL_PPSCMD2(1)                              /*!< capture the presentation time at the rising edge */
#define ENET_MCGR2_CAPTURE_FALLING                    MAC_PPS_CONTROL_PPSCMD2(2)                              /*!< capture the presentation time at the falling edge */
#define ENET_MCGR2_CAPTURE_BOTH                       MAC_PPS_CONTROL_PPSCMD2(3)                              /*!< capture the presentation time at both edges */
#define ENET_MCGR2_OUTPUT_TOGGLE                      MAC_PPS_CONTROL_PPSCMD2(9)                              /*!< toggle output on compare */
#define ENET_MCGR2_OUTPUT_LOW                         MAC_PPS_CONTROL_PPSCMD2(10)                             /*!< pulse output low on compare for one PTP-clock cycle */
#define ENET_MCGR2_OUTPUT_HIGH                        MAC_PPS_CONTROL_PPSCMD2(11)                             /*!< pulse output high on compare for one PTP-clock cycle */

#define MAC_PPS_CONTROL_TRGTMODSEL2(regval)           (BITS(21,22) & ((uint32_t)(regval) << 21))              /*!< write value to ENET_MAC_PPS_CONTROL_TRGTMODSEL2 bit field */
#define ENET_PPS2_GENERATE_INT_ONLY                   MAC_PPS_CONTROL_TRGTMODSEL2(0)                          /*!< target time registers are programmed only for generating the interrupt event */
#define ENET_PPS2_MCGR_INT_ENBALE                     MAC_PPS_CONTROL_TRGTMODSEL2(1)                          /*!< enables MCGR interrupt */
#define ENET_PPS2_GENERATE_INT_AND_OUTPUT             MAC_PPS_CONTROL_TRGTMODSEL2(2)                          /*!< target time registers are programmed for generating the interrupt event and starting or stopping the PPS output signal generation */
#define ENET_PPS2_GENERATE_OUTPUT_ONLY                MAC_PPS_CONTROL_TRGTMODSEL2(3)                          /*!< target time registers are programmed only for starting or stopping the PPS output signal generation */

#define MAC_PPS_CONTROL_PPSCMD3(regval)              (BITS(24,27) & ((uint32_t)(regval) << 24))               /*!< write value to ENET_MAC_PPS_CONTROL_PPSCMD3 bit field */

#define ENET_FLEXIBLE_PPS3_START_SINGLE_PULSE         MAC_PPS_CONTROL_PPSCMD3(1)                              /*!< generates single pulse rising at the start point */
#define ENET_FLEXIBLE_PPS3_START_PULSE_TRAIN          MAC_PPS_CONTROL_PPSCMD3(2)                              /*!< generates the train of pulses rising at the start point */
#define ENET_FLEXIBLE_PPS3_CANCEL_START               MAC_PPS_CONTROL_PPSCMD3(3)                              /*!< cancels the start single pulse and start pulse train commands */
#define ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_AT_TIME   MAC_PPS_CONTROL_PPSCMD3(4)                              /*!< stops the train of pulses after the time programmed in the Target Time registers elapses */
#define ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_NOW       MAC_PPS_CONTROL_PPSCMD3(5)                              /*!< immediately stops the train of pulses  */
#define ENET_FLEXIBLE_PPS3_CANCEL_STOP_PULSE_TRAIN    MAC_PPS_CONTROL_PPSCMD3(6)                              /*!< cancels the stop pulse train at time command if the programmed stop time has not elapsed */

#define ENET_MCGR3_OPERATION_NONE                     MAC_PPS_CONTROL_PPSCMD3(0)                              /*!< MCGR operation is not carried out */
#define ENET_MCGR3_CAPTURE_RISING                     MAC_PPS_CONTROL_PPSCMD3(1)                             /*!< capture the presentation time at the rising edge */
#define ENET_MCGR3_CAPTURE_FALLING                    MAC_PPS_CONTROL_PPSCMD3(2)                              /*!< capture the presentation time at the falling edge */
#define ENET_MCGR3_CAPTURE_BOTH                       MAC_PPS_CONTROL_PPSCMD3(3)                              /*!< capture the presentation time at both edges */
#define ENET_MCGR3_OUTPUT_TOGGLE                      MAC_PPS_CONTROL_PPSCMD3(9)                             /*!< toggle output on compare */
#define ENET_MCGR3_OUTPUT_LOW                         MAC_PPS_CONTROL_PPSCMD3(10)                             /*!< pulse output low on compare for one PTP-clock cycle */
#define ENET_MCGR3_OUTPUT_HIGH                        MAC_PPS_CONTROL_PPSCMD3(11)                             /*!< pulse output high on compare for one PTP-clock cycle */

#define MAC_PPS_CONTROL_TRGTMODSEL3(regval)           (BITS(29,30) & ((uint32_t)(regval) << 29))              /*!< write value to ENET_MAC_PPS_CONTROL_TRGTMODSEL3 bit field */
#define ENET_PPS3_GENERATE_INT_ONLY                   MAC_PPS_CONTROL_TRGTMODSEL3(0)                          /*!< target time registers are programmed only for generating the interrupt event */
#define ENET_PPS3_MCGR_INT_ENBALE                     MAC_PPS_CONTROL_TRGTMODSEL3(1)                          /*!< enables MCGR interrupt */
#define ENET_PPS3_GENERATE_INT_AND_OUTPUT             MAC_PPS_CONTROL_TRGTMODSEL3(2)                          /*!< target time registers are programmed for generating the interrupt event and starting or stopping the PPS output signal generation */
#define ENET_PPS3_GENERATE_OUTPUT_ONLY                MAC_PPS_CONTROL_TRGTMODSEL3(3)                          /*!< target time registers are programmed only for starting or stopping the PPS output signal generation */

#define ENET_FLEXIBLE_PPS_OUTPUT_MODE                 ENET_MAC_PPS_CONTROL_PPSEN0                             /*!< flexible PPS output mode */
#define ENET_PPS_OUTPUT_MODE                          ((uint32_t)0x00000000)                                  /*!< PPS output mode */
#define ENET_PPS0_MCGR_MODE                           ENET_MAC_PPS_CONTROL_MCGREN0                            /*!< 0th PPS instance is enabled to operate in MCGR mode */
#define ENET_PPS0_NORMAL_MODE                         ((uint32_t)0x00000000)                                  /*!< 0th PPS instance is enabled to operate in PPS mode */
#define ENET_PPS1_MCGR_MODE                           ENET_MAC_PPS_CONTROL_MCGREN1                            /*!< 1th PPS instance is enabled to operate in MCGR mode */
#define ENET_PPS1_NORMAL_MODE                         ((uint32_t)0x00000000)                                  /*!< 1th PPS instance is enabled to operate in PPS mode */
#define ENET_PPS2_MCGR_MODE                           ENET_MAC_PPS_CONTROL_MCGREN2                            /*!< 2th PPS instance is enabled to operate in MCGR mode */
#define ENET_PPS2_NORMAL_MODE                         ((uint32_t)0x00000000)                                  /*!< 2th PPS instance is enabled to operate in PPS mode */
#define ENET_PPS3_MCGR_MODE                           ENET_MAC_PPS_CONTROL_MCGREN3                            /*!< 3th PPS instance is enabled to operate in MCGR mode */
#define ENET_PPS3_NORMAL_MODE                         ((uint32_t)0x00000000)                                  /*!< 3th PPS instance is enabled to operate in PPS mode */
#define ENET_MCGR_CAPTURE_PTP_TIME                    ENET_MAC_PPS_CONTROL_TIMESEL                            /*!< 64 bit PTP time is used to capture time at MCGR trigger[0] input */
#define ENET_MCGR_CAPTURE_PRESENTATION_TIME           ((uint32_t)0x00000000)                                  /*!< presentation time is used to capture time at trigger input, maintaining backward compatibility */

