sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* MAC PPS target time in nanoseconds register value */
#define MAC_PPS_TARGET_TIME_NANOSECONDS_TTSL0(regval) (BITS(0,30) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MAC_PPS_TARGET_TIME_NANOSECONDS_TTSL0 bit field */

#define ENET_PPS_TARGET_TIME_REG_BUSY                 ENET_MAC_PPS_TARGET_TIME_NANOSECONDS_TRGTBUSY0           /*!< PPS Target Time Register Busy is detected */

/* MTL operation mode register value */
#define MTL_OPERATION_MODE_SCHALG(regval)             (BITS(5,6) & ((uint32_t)(regval) << 5))                 /*!< write value to ENET_MTL_OPERATION_MODE_SCHALG bit field */
#define ENET_TX_SCHEDULING_ALGO_WRR                    MTL_OPERATION_MODE_SCHALG(0)                           /*!< WRR algorithm */
#define ENET_TX_SCHEDULING_ALGO_SP                     MTL_OPERATION_MODE_SCHALG(3)                           /*!< Strict priority algorithm */

#define MTL_OPERATION_MODE_RAA(regval)                (BIT(2) & ((uint32_t)(regval) << 2))                    /*!< write value to MTL_OPERATION_MODE_RAA bit field */

#define ENET_TX_STATUS_DROP                           ENET_MTL_OPERATION_MODE_DTXSTS                          /*!< Tx packet status received from the MAC is dropped in the MTL */
#define ENET_TX_STATUS_FORWARD                        ((uint32_t)0x00000000)                                  /*!< Tx packet status received from the MAC is forwarded to the application */
#define ENET_RXQ_ARBITRATION_WSP                      ENET_MTL_OPERATION_MODE_RAA                             /*!< weighted strict priority */
#define ENET_RXQ_ARBITRATION_SP                       ((uint32_t)0x00000000)                                  /*!< strict priority. Queue 0 has the lowest priority and the last queue has the highest priority */
#define ENET_MTL_COUNTER_PRESET                       ENET_MTL_OPERATION_MODE_CNTPRST                         /*!< counters Preset is enabled */
#define ENET_MTL_COUNTER_RESET                        ENET_MTL_OPERATION_MODE_CNTCLR                          /*!< all counters are reset */
#define ENET_RX_PARSE_ERR_DROP                        ENET_MTL_OPERATION_MODE_RXPED                           /*!< flexible Rx parser, packet drop in case software error is enabled */
#define ENET_RX_PARSER_ENABLE                         ENET_MTL_OPERATION_MODE_FRPE                            /*!< flexible Rx parser is enabled */
#define ENET_RX_PARSER_DISABLE                        ((uint32_t)0x00000000)                                  /*!< flexible Rx parser is disabled */

/* MTL debug control register value */
#define MTL_DBG_CTL_BYTEEN(regval)                   (BITS(2,3) & ((uint32_t)(regval) << 2))                 /*!< write value to ENET_MTL_DBG_CTL_BYTEEN bit field */
#define ENET_BYTE0_VALID                             MTL_DBG_CTL_BYTEEN(0)                                   /*!< byte 0 valid */
#define ENET_BYTE0_BYTE1_VALID                       MTL_DBG_CTL_BYTEEN(1)                                   /*!< byte 0 valid */
#define ENET_BYTE0_BYTE1_BYTE2_VALID                 MTL_DBG_CTL_BYTEEN(2)                                   /*!< byte 0, byte 1, and byte 2 are valid */
#define ENET_ALL_FOUR_BYTES_VALID                    MTL_DBG_CTL_BYTEEN(3)                                   /*!< all four bytes are valid */

#define MTL_DBG_CTL_PKTSTATE(regval)                 (BITS(5,6) & ((uint32_t)(regval) << 5))                 /*!< write value to ENET_MTL_DBG_CTL_PKTSTATE bit field */
#define ENET_WRITE_PACKET_DATA_TO_TXFIFO             MTL_DBG_CTL_PKTSTATE(0)                                 /*!< write the packet data to the Tx FIFO */
#define ENET_WRITE_CONTROL_WORD_TO_TXFIFO            MTL_DBG_CTL_PKTSTATE(1)                                 /*!< write the control word to the Tx FIFO */
#define ENET_WRITE_SOP_DATA_TO_TXFIFO                MTL_DBG_CTL_PKTSTATE(2)                                 /*!< write the SOP data to the Tx FIFO */
#define ENET_WRITE_EOP_DATA_TO_TXFIFO                MTL_DBG_CTL_PKTSTATE(3)                                 /*!< write the EOP data to the Tx FIFO */
#define ENET_WRITE_PACKET_DATA_TO_RXFIFO             MTL_DBG_CTL_PKTSTATE(0)                                 /*!< write the packet data to the Rx FIFO */
#define ENET_WRITE_NORMAL_WORD_TO_RXFIFO             MTL_DBG_CTL_PKTSTATE(1)                                 /*!< write the normal status to the Rx FIFO */
#define ENET_WRITE_LAST_STATUS_TO_RXFIFO             MTL_DBG_CTL_PKTSTATE(2)                                 /*!< write the last status to the Rx FIFO */
#define ENET_WRITE_EOP_DATA_TO_RXFIFO                MTL_DBG_CTL_PKTSTATE(3)                                 /*!< write the EOP data to the Rx FIFO */

#define MTL_DBG_CTL_FIFOSEL(regval)                  (BITS(12,13) & ((uint32_t)(regval) << 12))              /*!< write value to ENET_MTL_DBG_CTL_FIFOSEL bit field */
#define ENET_DBG_ACCESS_TXFIFO                       MTL_DBG_CTL_FIFOSEL(0)                                  /*!< the Tx FIFO selected for debug access */
#define ENET_DBG_ACCESS_TXSTATUSFIFO                 MTL_DBG_CTL_FIFOSEL(1)                                  /*!< the Tx Status FIFO selected for debug access */
#define ENET_DBG_ACCESS_RXFIFO                       MTL_DBG_CTL_FIFOSEL(3)                                  /*!< the Rx FIFO selected for debug access */

#define ENET_FIFO_DBG_ACCESS_ENABLE                  ENET_MTL_DBG_CTL_FDBGEN                                 /*!< FIFO debug access is enabled */
#define ENET_FIFO_DBG_ACCESS_DISABLE                 ((uint32_t)0x00000000)                                  /*!< FIFO debug access is disabled */
#define ENET_DBG_NORMAL_ACCESS_FIFO                  ENET_MTL_DBG_CTL_DBGMOD                                 /*!< indicates that the current access to the FIFO is read, write, and debug access */
#define ENET_DBG_SLAVE_ACCESS_FIFO                   ((uint32_t)0x00000000)                                  /*!< indicates that the current access to the FIFO is slave access bypassing the DMA */
#define ENET_DBG_ALL_POINTERS_RESET                  ENET_MTL_DBG_CTL_RSTALL                                 /*!< the pointers of all FIFOs are reset when FIFO Debug Access is enabled */
#define ENET_DBG_SELECTED_POINTERS_RESET             ENET_MTL_DBG_CTL_RSTSEL                                 /*!< the pointers of the currently-selected FIFO are reset when FIFO debug access is enabled */
#define ENET_DBG_FIFO_READ                           ENET_MTL_DBG_CTL_FIFORDEN                               /*!< it enables the read operation on selected FIFO when FIFO debug access is enabled */
#define ENET_DBG_FIFO_WRITE                          ENET_MTL_DBG_CTL_FIFOWREN                               /*!< it enables the write operation on selected FIFO when FIFO debug access is enabled */
#define ENET_MTL_INSERT_ECC_ERR_1BIT                 ENET_MTL_DBG_CTL_EIEE                                   /*!< ECC inject 1-bit error for Tx, Rx memories */
#define ENET_MTL_INSERT_ECC_ERR_2BIT                 ENET_MTL_DBG_CTL_EIEE | ENET_MTL_DBG_CTL_EIEC           /*!< ECC inject 2-bit error for Tx, Rx memories */
#define ENET_MTL_INSERT_ECC_ADDR_ERR_1BIT            ENET_MTL_DBG_CTL_EIAEE                                  /*!< ECC inject 1-bit address error for Tx, Rx memories */
#define ENET_MTL_INSERT_ECC_ADDR_ERR_2BIT            ENET_MTL_DBG_CTL_EIAEE | ENET_MTL_DBG_CTL_EIEC          /*!< ECC inject 2-bit address error for Tx, Rx memories */

