sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* MTL receive queue and DMA channel mapping 0 register value */
#define ENET_RXQ0_MAPPED_TO_DMACH1                   ENET_MTL_RXQ_DMA_MAP0_Q0MDMACH                          /*!< the routing of the packet received in Queue 0 to the DMA channel 1 */
#define ENET_RXQ0_MAPPED_TO_DMACH0                   ((uint32_t)0x00000000)                                  /*!< the routing of the packet received in Queue 0 to the DMA channel 0 */
#define ENET_RXQ0_DMACHSEL_BASED_DA                  ENET_MTL_RXQ_DMA_MAP0_Q0DDMACH                          /*!< queue 0 enabled for DA-based DMA channel selection */
#define ENET_RXQ1_MAPPED_TO_DMACH1                   ENET_MTL_RXQ_DMA_MAP0_Q1MDMACH                          /*!< the routing of the packet received in Queue 1 to the DMA channel 1 */
#define ENET_RXQ1_MAPPED_TO_DMACH0                   ((uint32_t)0x00000000)                                  /*!< the routing of the packet received in Queue 1 to the DMA channel 0 */
#define ENET_RXQ1_DMACHSEL_BASED_DA                  ENET_MTL_RXQ_DMA_MAP0_Q1DDMACH                          /*!< queue 1 enabled for DA-based DMA channel selection */

/* MTL TBS control register value */
#define MTL_TBS_CTRL_LEGOS(regval)                   (BITS(4,6) & ((uint32_t)(regval) << 4))                 /*!< write value to ENET_MTL_TBS_CTRL_LEGOS bit field */

#define MTL_TBS_CTRL_LEOS(regval)                    (BITS(8,31) & ((uint32_t)(regval) << 8))                /*!< write value to ENET_MTL_TBS_CTRL_LEOS bit field */

#define MTL_TBS_CTRL_ESTM(regval)                    (BIT(0) & ((uint32_t)(regval) << 0))                    /*!< write value to ENET_MTL_TBS_CTRL_ESTM bit field */

#define ENET_TBS_NORMAL_ABSOLUTE_MODE                MTL_TBS_CTRL_ESTM(1)                                    /*!< the launch time value used in time based scheduling is interpreted as an EST offset value */
#define ENET_TBS_EST_OFFSET_MODE                     MTL_TBS_CTRL_ESTM(0)                                    /*!< the launch time value is used as an absolute value */
#define ENET_TBS_LAUNCH_EXPIRY_OFFSET_VALID          ENET_MTL_TBS_CTRL_LEOV                                  /*!< the LEOS field is valid */

/* MTL EST control register value */
#define MTL_EST_CONTROL_LCSE(regval)                 (BITS(6,7) & ((uint32_t)(regval) << 6))                 /*!< write value to ENET_MTL_EST_CONTROL_LCSE bit field */
#define ENET_GCL_INTERATE_4                          MTL_EST_CONTROL_LCSE(0)                                 /*!< 4 of GCL list iterations before reporting an HLBS error */
#define ENET_GCL_INTERATE_8                          MTL_EST_CONTROL_LCSE(1)                                 /*!< 8 of GCL list iterations before reporting an HLBS error */
#define ENET_GCL_INTERATE_16                         MTL_EST_CONTROL_LCSE(2)                                 /*!< 16 of GCL list iterations before reporting an HLBS error */
#define ENET_GCL_INTERATE_32                         MTL_EST_CONTROL_LCSE(3)                                 /*!< 32 of GCL list iterations before reporting an HLBS error */

#define MTL_EST_CONTROL_TILS(regval)                 (BITS(8,10) & ((uint32_t)(regval) << 8))                /*!< write value to ENET_MTL_EST_CONTROL_TILS bit field */
#define ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_0          MTL_EST_CONTROL_TILS(0)                                 /*!< left shift 0 for the programmed Time Interval values */
#define ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_1          MTL_EST_CONTROL_TILS(1)                                 /*!< left shift 1 for the programmed Time Interval values */
#define ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_2          MTL_EST_CONTROL_TILS(2)                                 /*!< left shift 2 for the programmed Time Interval values */
#define ENET_GCL_TIME_INTERVAL_LEFT_SHIFT_7          MTL_EST_CONTROL_TILS(4)                                 /*!< left shift 7 for the programmed Time Interval values */

#define MTL_EST_CONTROL_CTOV(regval)                 (BITS(12,23) & ((uint32_t)(regval) << 12))              /*!< write value to ENET_MTL_EST_CONTROL_CTOV bit field */

#define MTL_EST_CONTROL_PTOV(regval)                 (BITS(24,31) & ((uint32_t)(regval) << 24))              /*!< write value to ENET_MTL_EST_CONTROL_PTOV bit field */

#define ENET_EST_ENABLE                              ENET_MTL_EST_CONTROL_EEST                               /*!< EST is enabled */
#define ENET_EST_DISABLE                             ((uint32_t)0x00000000)                                  /*!< EST is disabled */
#define ENET_OWNED_GCL_LIST_SWITCH                   ENET_MTL_EST_CONTROL_SSWL                               /*!< the software has programmed that list that it currently owns */
#define ENET_QUICK_ASSERT_HLBF_ERR_ENABLE            ENET_MTL_EST_CONTROL_QHLBF                              /*!< time window for head-of-line blocking due to frame size error is 1 to 2 loop count of GCL list */
#define ENET_QUICK_ASSERT_HLBF_ERR_DISABLE          ((uint32_t)0x00000000)                                   /*!< time window for head-of-line blocking due to frame size error is 2 to 3 loop count of GCL list */
#define ENET_EST_DONT_DROP_SIZE_ERR_FRAME            ENET_MTL_EST_CONTROL_DDBF                               /*!< frames are not being dropped during Head-of-Line blocking due to Frame Size Error */
#define ENET_EST_DROP_SIZE_ERR_FRAME                 ((uint32_t)0x00000000)                                  /*!< frames are dropped during Head-of-Line blocking due to Frame Size Error */
#define ENET_EST_DROP_SCHEDULING_ERR_FRAME           ENET_MTL_EST_CONTROL_DFBS                               /*!< drop frames causing scheduling error */
#define ENET_EST_DONT_DROP_SCHEDULING_ERR_FRAME     ((uint32_t)0x00000000)                                   /*!< drop frames causing scheduling error */

/* MTL EST extend control register value */
#define MTL_EST_EXT_CONTROL_OVHD(regval)             (BITS(0,5) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MTL_EST_EXT_CONTROL_OVHD bit field */

