sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* MTL EST status register value */
#define GET_CURRENT_GCL_NUM(regval)                        GET_BITS((uint32_t)(regval),16,19)                      /*!< get value of ENET_MTL_EST_STATUS_CGSN bit field */
#define GET_BTR_ERROR_LOOP_COUNT(regval)                   GET_BITS((uint32_t)(regval),8,15)                      /*!< get value of ENET_MTL_EST_STATUS_BTRL bit field */

/* MTL EST schedule error register value */
#define MTL_EST_SCH_ERROR_SEQN(regval)               (BITS(0,1) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MTL_EST_SCH_ERROR_SEQN bit field */
#define ENET_EST_SCHEDULE_ERR_Q0                     MTL_EST_SCH_ERROR_SEQN(1)                               /*!< queue 0 that have experienced error/timeout */
#define ENET_EST_SCHEDULE_ERR_Q1                     MTL_EST_SCH_ERROR_SEQN(2)                               /*!< queue 1 that have experienced error/timeou */

/* MTL EST frame size error register value */
#define MTL_EST_FRM_SIZE_ERROR_FEQN(regval)          (BITS(0,1) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MTL_EST_FRM_SIZE_ERROR_FEQN bit field */
#define ENET_EST_FRAME_SIZE_ERR_Q0                    MTL_EST_FRM_SIZE_ERROR_FEQN(1)                         /*!< queue 0 that have experienced frame size error */
#define ENET_EST_FRAME_SIZE_ERR_Q1                    MTL_EST_FRM_SIZE_ERROR_FEQN(2)                         /*!< queue 1 that have experienced frame size error */

/* MTL EST frame size capture register value */
#define GET_HLBF_FRAME_SIZE(regval)                   GET_BITS((uint32_t)(regval),0,14)                      /*!< get value of ENET_MTL_EST_FRM_SIZE_CAPTURE_HBFS bit field */

#define ENET_Q0_FISRT_EXPERIENCING_HLBF               ((uint32_t)0x00000000)                                 /*!< queue 0 first experiencing HLBF error */
#define ENET_Q1_FISRT_EXPERIENCING_HLBF               ENET_MTL_EST_CONTROL_HBFQ                              /*!< queue 1 first experiencing HLBF error */

/* MTL EST GCL control register value */
#define MTL_EST_GCL_CONTROL_ADDR(regval)              (BITS(8,15) & ((uint32_t)(regval) << 8))                     /*!< write value to ENET_MTL_EST_GCL_CONTROL_ADDR bit field */
#define ENET_GCL_BTR_LOW                              MTL_EST_GCL_CONTROL_ADDR(0) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< BTR low (31:0) */
#define ENET_GCL_BTR_HIGH                             MTL_EST_GCL_CONTROL_ADDR(1) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< BTR high (63:31) */
#define ENET_GCL_CTR_LOW                              MTL_EST_GCL_CONTROL_ADDR(2) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< CTR low (31:0) */
#define ENET_GCL_CTR_HIGH                             MTL_EST_GCL_CONTROL_ADDR(3) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< CTR high (39:32) */
#define ENET_GCL_TER                                  MTL_EST_GCL_CONTROL_ADDR(4) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< TER (22:0)(26:0)(30:0) */
#define ENET_GCL_LLR                                  MTL_EST_GCL_CONTROL_ADDR(5) | ENET_MTL_EST_GCL_CONTROL_GCRR  /*!< LLR (5:0)(6:0)(7:0)(8:0)(9:0) */

#define ENET_GCL_READ_WRITE_START                     ENET_MTL_EST_GCL_CONTROL_SRWO                                /*!< the start / progress of a read / write operation */
#define ENET_GCL_READ                                 ENET_MTL_EST_GCL_CONTROL_R1W0                                /*!< read operation */
#define ENET_GCL_WRITE                                ((uint32_t)0x00000000)                                       /*!< write operation */
#define ENET_GCL_DBG_MODE_ENABLE                      ENET_MTL_EST_GCL_CONTROL_DBGM                                /*!< debug mode is enabled */
#define ENET_GCL_DBG_MODE_DISABLE                     ((uint32_t)0x00000000)                                       /*!< debug mode is disabled */
#define ENET_GCL_DBG_MODE_BANK1                       ENET_MTL_EST_GCL_CONTROL_DBGB                                /*!< r / w in debug mode should be directed to Bank 1 */
#define ENET_GCL_DBG_MODE_BANK0                       ((uint32_t)0x00000000)                                       /*!< r / w in debug mode should be directed to Bank 0 */
#define ENET_EST_INSERT_ECC_ERR_1BIT                  ENET_MTL_EST_GCL_CONTROL_ESTEIEE                                        /*!< ECC inject 1-bit error for EST */
#define ENET_EST_INSERT_ECC_ERR_2BIT                  ENET_MTL_EST_GCL_CONTROL_ESTEIEE | ENET_MTL_EST_GCL_CONTROL_ESTEIEC     /*!< ECC inject 2-bit error for EST */
#define ENET_EST_INSERT_ECC_ADDR_ERR_1BIT             ENET_MTL_EST_GCL_CONTROL_ESTEIAEE                                       /*!< ECC inject 1-bit address error for EST */
#define ENET_EST_INSERT_ECC_ADDR_ERR_2BIT             ENET_MTL_EST_GCL_CONTROL_ESTEIAEE | ENET_MTL_EST_GCL_CONTROL_ESTEIEC    /*!< ECC inject 2-bit address error for EST */

/* MTL FPE control status register value */
#define MTL_FPE_CTRL_STS_AFSZ(regval)                (BITS(0,1) & ((uint32_t)(regval) << 0)) << 4U           /*!< write value to ENET_MTL_FPE_CTRL_STS_AFSZ bit field */
#define ENET_FPE_ADD_FRAG_SIZE_64B                    MTL_FPE_CTRL_STS_AFSZ(0)                               /*!< the minimum non-final fragment size is 64 bytes */
#define ENET_FPE_ADD_FRAG_SIZE_128B                   MTL_FPE_CTRL_STS_AFSZ(1)                               /*!< the minimum non-final fragment size is 128 bytes */
#define ENET_FPE_ADD_FRAG_SIZE_192B                   MTL_FPE_CTRL_STS_AFSZ(2)                               /*!< the minimum non-final fragment size is 192 bytes */
#define ENET_FPE_ADD_FRAG_SIZE_256B                   MTL_FPE_CTRL_STS_AFSZ(3)                               /*!< the minimum non-final fragment size is 256 bytes */

#define MTL_FPE_CTRL_STS_PEC(regval)                 (BITS(8,9) & ((uint32_t)(regval) << 8)) << 4U           /*!< write value to ENET_MTL_FPE_CTRL_STS_PEC bit field */
#define ENET_FPE_Q0_AS_PREEMPTABLE                   MTL_FPE_CTRL_STS_PEC(1)                                 /*!< the queue 0 must be classified as preemptable */
#define ENET_FPE_Q1_AS_PREEMPTABLE                   MTL_FPE_CTRL_STS_PEC(2)                                 /*!< the queue 1 must be classified as preemptable */

#define ENET_GCL_LEVEL_BASED_HOLD_TRANSITION_ENABLE         ENET_MTL_FPE_CTRL_STS_LBHT << 4U                 /*!< enable hold operation in second row of EST GCL if hold request is set in second GCL row for first loop of new GCL */
#define ENET_GCL_LEVEL_BASED_HOLD_TRANSITION_DISABLE        ((uint32_t)0x00000000)                           /*!< disable hold operation in second row of EST GCL if hold request is set in second GCL row for first loop of new GCL */

#define ENET_PMAC_HOLD_STATE                         ENET_MTL_FPE_CTRL_STS_HRS                               /*!< indicates a Set-and-Hold-MAC operation was last executed and the pMAC is in Hold State */
#define ENET_PMAC_RELEASE_STATE                      ((uint32_t)0x00000000)                                  /*!< indicates a Set-and-Hold-MAC operation was last executed and the pMAC is in Release State */

/* MTL FPE Advance register value */
#define GET_HOLD_ADVANCE(regval)                     GET_BITS((uint32_t)(regval),0,15)                      /*!< get value of ENET_MTL_FPE_ADVANCE_HADV bit field */
#define GET_RELEASE_ADVANCE(regval)                  GET_BITS((uint32_t)(regval),16,31)                     /*!< get value of ENET_MTL_FPE_ADVANCE_RADV bit field */

/* MTL FPE Advance register value */
#define MTL_HOLD_ADVANCE(regval)                    (BITS(0,15) & ((uint32_t)(regval) << 0))                      /*!< write value of ENET_MTL_FPE_ADVANCE_HADV bit field */
#define MTL_RELEASE_ADVANCE(regval)                 (BITS(16,31) & ((uint32_t)(regval) << 16))                     /*!< write value of ENET_MTL_FPE_ADVANCE_RADV bit field */

/* MTL Rx parser control status register value */
#define MTL_RXP_CONTROL_STATUS_NVE(regval)           (BITS(0,7) & ((uint32_t)(regval) << 0))                /*!< write value to ENET_MTL_RXP_CONTROL_STATUS_NVE bit field */

#define MTL_RXP_CONTROL_STATUS_NPE(regval)           (BITS(16,23) & ((uint32_t)(regval) << 16))             /*!< write value to ENET_MTL_RXP_CONTROL_STATUS_NPE bit field */

#define ENET_LAST_INSTRUCTION_IN_RXSTATUS            ENET_MTL_RXP_CONTROL_STATUS_ELIRS                      /*!< RDES2[31:16] indicates the index of the last instruction excecuted in Rx Parse */
#define ENET_RXPARSER_IN_IDLE_STATE                  ENET_MTL_RXP_CONTROL_STATUS_RXPI                       /*!< RX Parser in Idle state */

/* MTL Rx parser indirect access control and status register value */
#define MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(regval)   (BITS(0,7) & ((uint32_t)(regval) << 0))          /*!< write value to ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR bit field */

#define ENET_RXP_MEM_WRITE                           ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN         /*!< indicates the write operation to the Rx parser memory */
#define ENET_RXP_MEM_READ                            ((uint32_t)0x00000000)                                 /*!< indicates the read operation to the Rx parser memory */
#define ENET_RXP_INSERT_ECC_ERR_1BIT                 (ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE | ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC)      /*!< ECC inject 1-bit error for Rx parser memory */
#define ENET_RXP_INSERT_ECC_ERR_2BIT                 ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE       /*!< ECC inject 2-bit error for Rx parser memory */
#define ENET_RXP_INSERT_ECC_ADDR_ERR_1BIT            (ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE | ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC)                                                        /*!< ECC inject 1-bit address error for Rx parser memory */
#define ENET_RXP_INSERT_ECC_ADDR_ERR_2BIT            ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE      /*!< ECC inject 2-bit address error for Rx parser memory */
#define ENET_RXP_MEM_WRITE_READ_START                ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY     /*!< indicates the write operation to the Rx parser memory */

/* MTL Rx parser indirect access control and status register value */
#define ENET_MTL_TXFIFO_ECC_ENABLE                   ENET_MTL_ECC_CONTROL_MTXEE                             /*!< enables the ECC feature for MTL Tx FIFO memory */
#define ENET_MTL_TXFIFO_ECC_DISABLE                  ((uint32_t)0x00000000)                                 /*!< disables the ECC feature for MTL Tx FIFO memory */
#define ENET_MTL_RXFIFO_ECC_ENABLE                   ENET_MTL_ECC_CONTROL_MRXEE                             /*!< enables the ECC feature for MTL Rx FIFO memory */
#define ENET_MTL_RXFIFO_ECC_DISABLE                  ((uint32_t)0x00000000)                                 /*!< disables the ECC feature for MTL Rx FIFO memory */
#define ENET_MTL_EST_ECC_ENABLE                      ENET_MTL_ECC_CONTROL_MESTEE                            /*!< enables the ECC feature for EST memory */
#define ENET_MTL_EST_ECC_DISABLE                     ((uint32_t)0x00000000)                                 /*!< disables the ECC feature for EST memory */
#define ENET_MTL_RXP_ECC_ENABLE                      ENET_MTL_ECC_CONTROL_MRXPEE                            /*!< enables the ECC feature for Rx parser memory */
#define ENET_MTL_RXP_ECC_DISABLE                     ((uint32_t)0x00000000)                                 /*!< disables the ECC feature for Rx parser memory */
#define ENET_MTL_EXX_ERR_ADDR_STATUS_OVERRIDE_ENABLE ENET_MTL_ECC_CONTROL_MEEAO                             /*!< MTL ECC error address status over-ride is enabled */
#define ENET_MTL_EXX_ERR_ADDR_STATUS_OVERRIDE_DISABLE ((uint32_t)0x00000000)                                /*!< MTL ECC error address status over-ride is enabled */

/* MTL ECC error status rctl register value */
#define MTL_ECC_ERR_STS_RCTL_EMS(regval)              (BITS(1,3) & ((uint32_t)(regval) << 1))                 /*!< write value to ENET_MTL_ECC_ERR_STS_RCTL_EMS bit field */
#define ENET_MTL_ECC_SELECT_TX_MEM                    MTL_ECC_ERR_STS_RCTL_EMS(0)                             /*!< MTL Tx memory */
#define ENET_MTL_ECC_SELECT_RX_MEM                    MTL_ECC_ERR_STS_RCTL_EMS(1)                             /*!< MTL Rx memory */
#define ENET_MTL_ECC_SELECT_EST_MEM                   MTL_ECC_ERR_STS_RCTL_EMS(2)                             /*!< MTL EST memory */
#define ENET_MTL_ECC_SELECT_RXP_MEM                   MTL_ECC_ERR_STS_RCTL_EMS(3)                             /*!< MTL RXP memory */

#define ENET_MTL_ECC_ERR_STATUS_READ_ENABLE           ENET_MTL_ECC_ERR_STS_RCTL_EESRE                                          /*!< MTL ECC error status read enable */
#define ENET_MTL_UNCORRECTABLE_ERR_STATUS_CLEAR       (ENET_MTL_ECC_ERR_STS_RCTL_EESRE|ENET_MTL_ECC_ERR_STS_RCTL_CUES)         /*!< clear unCorrectable error status */
#define ENET_MTL_CORRECTABLE_ERR_STATUS_CLEAR         (ENET_MTL_ECC_ERR_STS_RCTL_EESRE|ENET_MTL_ECC_ERR_STS_RCTL_CCES)         /*!< clear Correctable error status */

