sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET_MTL_ECC_ERR_ADDR_STATUS */
#define GET_UNCORRECTABLE_ERR_ADDRESS(regval)         GET_BITS((uint32_t)(regval),0,15)                       /*!< get value of ENET_MTL_ECC_ERR_ADDR_STATUS_ECEAS bit field */
#define GET_CORRECTABLE_ERR_ADDRESS(regval)           GET_BITS((uint32_t)(regval),16,31)                      /*!< get value of ENET_MTL_ECC_ERR_ADDR_STATUS_EUEAS bit field */

#define ENET_MTL_UNCORRECTABLE_ERR_ADDRESS            ENET_MTL_ECC_ERR_ADDR_STATUS_ECEAS                      /*!< MTL ECC correctable error address status */
#define ENET_MTL_CORRECTABLE_ERR_ADDRESS              ENET_MTL_ECC_ERR_ADDR_STATUS_EUEAS                      /*!< MTL ECC uncorrectable error address status */

/* ENET_MTL_ECC_ERR_CNTR_STATUS */
#define GET_UNCORRECTABLE_ERR_COUNT(regval)           GET_BITS((uint32_t)(regval),16,19)                        /*!< get value of ENET_MTL_ECC_ERR_CNTR_STATUS_ECECS bit field */
#define GET_CORRECTABLE_ERR_COUNT(regval)             GET_BITS((uint32_t)(regval),0,7)                      /*!< get value of ENET_MTL_ECC_ERR_CNTR_STATUS_EUECS bit field */

#define ENET_MTL_UNCORRECTABLE_ERR_COUNT              ENET_MTL_ECC_ERR_CNTR_STATUS_ECECS                      /*!< MTL ECC correctable error counter status */
#define ENET_MTL_CORRECTABLE_ERR_COUNT                ENET_MTL_ECC_ERR_CNTR_STATUS_EUECS                      /*!< MTL ECC uncorrectable error counter status */


/* MTL data parity protection control register value */
#define ENET_DATA_PATH_PARITY_PROTECTION_ENABLE       ENET_MTL_DPP_CONTROL_EDPP                               /*!< data path parity protection is enabled */
#define ENET_DATA_PATH_PARITY_PROTECTION_DISABLE      ((uint32_t)0x00000000)                                  /*!< data path parity protection is disabled */
#define ENET_DPP_ODD_PARITY_ENABLE                    ENET_MTL_DPP_CONTROL_OPE                                /*!< odd parity is enabled */
#define ENET_DPP_ODD_PARITY_DISABLE                   ((uint32_t)0x00000000)                                  /*!< odd parity is disabled */
#define ENET_DPP_PARITY_ON_SLAVE_INTERFACE_ENABLE     ENET_MTL_DPP_CONTROL_EPSI                               /*!< parity on slave interface port is enabled  */
#define ENET_DPP_PARITY_ON_SLAVE_INTERFACE_DISABLE    ((uint32_t)0x00000000)                                  /*!< parity on slave interface port is disabled  */
#define ENET_DPP_IPETID_ENABLE                        ENET_MTL_DPP_CONTROL_IPETID                             /*!< insert parity error in Tx interface data parity checker is enabled */
#define ENET_DPP_IPETID_DISABLE                       ((uint32_t)0x00000000)                                  /*!< insert parity error in Tx interface data parity checker is disabled */
#define ENET_DPP_IPETRD_ENABLE                        ENET_MTL_DPP_CONTROL_IPETRD                             /*!< insert parity error in DMA Tx/Rx descriptor parity checker is enabled */
#define ENET_DPP_IPETRD_DISABLE                       ((uint32_t)0x00000000)                                  /*!< insert parity error in DMA Tx/Rx descriptor parity checker is disabled */
#define ENET_DPP_IPEMTF_ENABLE                        ENET_MTL_DPP_CONTROL_IPEMTF                             /*!< insert parity error in MTL Tx FIFO write data parity checker is enabled */
#define ENET_DPP_IPEMTF_DISABLE                       ((uint32_t)0x00000000)                                  /*!< insert parity error in MTL Tx FIFO write data parity checker is disabled */
#define ENET_DPP_IPEMTS_ENABLE                        ENET_MTL_DPP_CONTROL_IPEMTS                             /*!< insert parity error in MTL Tx Status FIFO parity checker is enabled */
#define ENET_DPP_IPEMTS_DISABLE                       ((uint32_t)0x00000000)                                  /*!< insert parity error in MTL Tx Status FIFO parity checker is disabled */
#define ENET_DPP_IPERID_ENABLE                        ENET_MTL_DPP_CONTROL_IPERID                             /*!< insert parity error in RX interface data parity checker is enabled */
#define ENET_DPP_IPERID_DISABLE                       ((uint32_t)0x00000000)                                  /*!< insert parity error in RX interface data parity checker is disabled */
#define ENET_DPP_IPEMTBU_ENABLE                       ENET_MTL_DPP_CONTROL_IPEMTBU                            /*!< insert parity error in MAC TBU data parity checker is enabled */
#define ENET_DPP_IPEMTBU_DISABLE                      ((uint32_t)0x00000000)                                  /*!< insert parity error in MAC TBU data parity checker is disabled */
#define ENET_DPP_IPEMTFC_ENABLE                       ENET_MTL_DPP_CONTROL_IPEMTFC                            /*!< insert parity error in MAC TFC data parity checker is enabled */
#define ENET_DPP_IPEMTFC_DISABLE                      ((uint32_t)0x00000000)                                  /*!< insert parity error in MAC TFC data parity checker is disabled */
#define ENET_DPP_IPEMRWC_ENABLE                       ENET_MTL_DPP_CONTROL_IPEMRWC                            /*!< insert parity error in MTL RWC data parity checker is enabled */
#define ENET_DPP_IPEMRWC_DISABLE                      ((uint32_t)0x00000000)                                  /*!< insert parity error in MTL RWC data parity checker is disabled */

/* MTL ECC/DPP error injection register value */
#define MTL_DPP_ECC_EIC_BLEI(regval)                   (BITS(0,7) & ((uint32_t)(regval) << 0))                /*!< write value to ENET_MTL_DPP_ECC_EIC_BLEI bit field */

#define ENET_ERR_INJTECTION_ON_ECC_PARITY              ENET_MTL_DPP_ECC_EIC_EIM                               /*!< indicate error injection on ECC/Parity bits */
#define ENET_ERR_INJTECTION_ON_DATA                    ((uint32_t)0x00000000)                                 /*!< indicate error injection on data */

/* MTL transmit queue operation mode register value */
#define MTL_TXQ_OPERATION_MODE_TTC(regval)            (BITS(4,6) & ((uint32_t)(regval) << 4))                 /*!< write value to ENET_MTL_TXQ_OPERATION_MODE_TTC bit field */
#define ENET_TX_THRESHOLD_32BYTES                     MTL_TXQ_OPERATION_MODE_TTC(0)                           /*!< threshold level is 32 Bytes */
#define ENET_TX_THRESHOLD_64BYTES                     MTL_TXQ_OPERATION_MODE_TTC(1)                           /*!< threshold level is 64 Bytes */
#define ENET_TX_THRESHOLD_96BYTES                     MTL_TXQ_OPERATION_MODE_TTC(2)                           /*!< threshold level is 96 Bytes */
#define ENET_TX_THRESHOLD_128BYTES                    MTL_TXQ_OPERATION_MODE_TTC(3)                           /*!< threshold level is 128 Bytes */
#define ENET_TX_THRESHOLD_192BYTES                    MTL_TXQ_OPERATION_MODE_TTC(4)                           /*!< threshold level is 192 Bytes */
#define ENET_TX_THRESHOLD_256BYTES                    MTL_TXQ_OPERATION_MODE_TTC(5)                           /*!< threshold level is 256 Bytes */
#define ENET_TX_THRESHOLD_284BYTES                    MTL_TXQ_OPERATION_MODE_TTC(6)                           /*!< threshold level is 284 Bytes */
#define ENET_TX_THRESHOLD_512BYTES                    MTL_TXQ_OPERATION_MODE_TTC(7)                           /*!< threshold level is 512 Bytes */

#define MTL_TXQ_OPERATION_MODE_TQS(regval)            (BITS(16,20) & ((uint32_t)(regval) << 16))              /*!< write value to ENET_MTL_TXQ_OPERATION_MODE_TQS bit field */
#define ENET_TXQ_SIZE_256BYTES                        MTL_TXQ_OPERATION_MODE_TQS(0)                           /*!< the size of the queue is 256 bytes */
#define ENET_TXQ_SIZE_512BYTES                        MTL_TXQ_OPERATION_MODE_TQS(1)                           /*!< the size of the queue is 512 bytes */
#define ENET_TXQ_SIZE_768BYTES                        MTL_TXQ_OPERATION_MODE_TQS(2)                           /*!< the size of the queue is 768 bytes */
#define ENET_TXQ_SIZE_1024BYTES                       MTL_TXQ_OPERATION_MODE_TQS(3)                           /*!< the size of the queue is 1024 bytes */
#define ENET_TXQ_SIZE_1280BYTES                       MTL_TXQ_OPERATION_MODE_TQS(4)                           /*!< the size of the queue is 1280 bytes */
#define ENET_TXQ_SIZE_1536BYTES                       MTL_TXQ_OPERATION_MODE_TQS(5)                           /*!< the size of the queue is 1536 bytes */
#define ENET_TXQ_SIZE_1792BYTES                       MTL_TXQ_OPERATION_MODE_TQS(6)                           /*!< the size of the queue is 1792 bytes */
#define ENET_TXQ_SIZE_2048BYTES                       MTL_TXQ_OPERATION_MODE_TQS(7)                           /*!< the size of the queue is 2048 bytes */
#define ENET_TXQ_SIZE_2304BYTES                       MTL_TXQ_OPERATION_MODE_TQS(8)                           /*!< the size of the queue is 2304 bytes */
#define ENET_TXQ_SIZE_2560BYTES                       MTL_TXQ_OPERATION_MODE_TQS(9)                           /*!< the size of the queue is 2560 bytes */
#define ENET_TXQ_SIZE_2816BYTES                       MTL_TXQ_OPERATION_MODE_TQS(10)                          /*!< the size of the queue is 2816 bytes */
#define ENET_TXQ_SIZE_3072BYTES                       MTL_TXQ_OPERATION_MODE_TQS(11)                          /*!< the size of the queue is 3072 bytes */
#define ENET_TXQ_SIZE_3328BYTES                       MTL_TXQ_OPERATION_MODE_TQS(12)                          /*!< the size of the queue is 3328 bytes */
#define ENET_TXQ_SIZE_3584BYTES                       MTL_TXQ_OPERATION_MODE_TQS(13)                          /*!< the size of the queue is 3584 bytes */
#define ENET_TXQ_SIZE_3840BYTES                       MTL_TXQ_OPERATION_MODE_TQS(14)                          /*!< the size of the queue is 3840 bytes */
#define ENET_TXQ_SIZE_4096BYTES                       MTL_TXQ_OPERATION_MODE_TQS(15)                          /*!< the size of the queue is 4096 bytes */
#define ENET_TXQ_SIZE_4352BYTES                       MTL_TXQ_OPERATION_MODE_TQS(16)                          /*!< the size of the queue is 4352 bytes */
#define ENET_TXQ_SIZE_4608BYTES                       MTL_TXQ_OPERATION_MODE_TQS(17)                          /*!< the size of the queue is 4608 bytes */
#define ENET_TXQ_SIZE_4864BYTES                       MTL_TXQ_OPERATION_MODE_TQS(18)                          /*!< the size of the queue is 4864 bytes */
#define ENET_TXQ_SIZE_5120BYTES                       MTL_TXQ_OPERATION_MODE_TQS(19)                          /*!< the size of the queue is 5120 bytes */
#define ENET_TXQ_SIZE_5376BYTES                       MTL_TXQ_OPERATION_MODE_TQS(20)                          /*!< the size of the queue is 5376 bytes */
#define ENET_TXQ_SIZE_5632BYTES                       MTL_TXQ_OPERATION_MODE_TQS(21)                          /*!< the size of the queue is 5632 bytes */
#define ENET_TXQ_SIZE_5888BYTES                       MTL_TXQ_OPERATION_MODE_TQS(22)                          /*!< the size of the queue is 5888 bytes */
#define ENET_TXQ_SIZE_6144BYTES                       MTL_TXQ_OPERATION_MODE_TQS(23)                          /*!< the size of the queue is 6144 bytes */
#define ENET_TXQ_SIZE_6400BYTES                       MTL_TXQ_OPERATION_MODE_TQS(24)                          /*!< the size of the queue is 6400 bytes */
#define ENET_TXQ_SIZE_6656BYTES                       MTL_TXQ_OPERATION_MODE_TQS(25)                          /*!< the size of the queue is 6656 bytes */
#define ENET_TXQ_SIZE_6912BYTES                       MTL_TXQ_OPERATION_MODE_TQS(26)                          /*!< the size of the queue is 6912 bytes */
#define ENET_TXQ_SIZE_7168BYTES                       MTL_TXQ_OPERATION_MODE_TQS(27)                          /*!< the size of the queue is 7168 bytes */
#define ENET_TXQ_SIZE_7424BYTES                       MTL_TXQ_OPERATION_MODE_TQS(28)                          /*!< the size of the queue is 7424 bytes */
#define ENET_TXQ_SIZE_7680BYTES                       MTL_TXQ_OPERATION_MODE_TQS(29)                          /*!< the size of the queue is 7680 bytes */
#define ENET_TXQ_SIZE_7936BYTES                       MTL_TXQ_OPERATION_MODE_TQS(30)                          /*!< the size of the queue is 7936 bytes */
#define ENET_TXQ_SIZE_8192BYTES                       MTL_TXQ_OPERATION_MODE_TQS(31)                          /*!< the size of the queue is 8192 bytes */


#define ENET_TX_MODE_STOREFORWARD                     ENET_MTL_TXQ0_OPERATION_MODE_TSF                        /*!< TxFIFO operates in store-and-forward mode */
#define ENET_TX_MODE_CUTTHROUGH                       ((uint32_t)0x00000000)                                  /*!< TxFIFO operates in cut-through mode */

/* MTL transmit queue underflow counter register value */
#define GET_UNDERFLOW_PACKET_COUNTER(regval)          GET_BITS((uint32_t)(regval),0,10)                       /*!< get value of ENET_MTL_TXQ0_UNDERFLOW_UFFRMCNT bit field */

