sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_TX_UNDERFLOW_PACKET_COUNTER_OVERFLOW     ENET_MTL_TXQ0_UNDERFLOW_UFCNTOVF                        /*!< overflow detected for underflow packet */

/* MTL transmit queue debug register value */
#define GET_TXQ_PACKETS_NUMBER(regval)                GET_BITS((uint32_t)(regval),16,18)                      /*!< get value of ENET_MTL_TXQ0_DEBUG_PTXQ bit field */
#define GET_TXQ_STATUS_WORD_NUMBER(regval)            GET_BITS((uint32_t)(regval),20,22)                      /*!< get value of ENET_MTL_TXQ0_DEBUG_STXSTSF bit field */

#define ENET_TXQ_STATUS_FIFO_FULL_DETECT              ENET_MTL_TXQ1_DEBUG_TXSTSFSTS                            /*!< MTL Tx status FIFO full status is detected */
#define ENET_TXQ_STATUS_FIFO_FULL_NOT_DETECT          ((uint32_t)0x00000000)                                  /*!< MTL Tx status FIFO full status is not detected */

#define ENET_TXQ_STATUS_FIFO_NOT_EMPTY_DETECT         ENET_MTL_TXQ1_DEBUG_TXQSTS                               /*!< MTL Tx status FIFO not empty status is detected */
#define ENET_TXQ_STATUS_FIFO_NOT_EMPTY_NOT_DETECT     ((uint32_t)0x00000000)                                  /*!< MTL Tx status not empty full status is not detected */

#define ENET_TXQ_WRITE_CONTROL_DETECT                 ENET_MTL_TXQ1_DEBUG_TWCSTS                               /*!< MTL Tx queue write controller status is detected */
#define ENET_TXQ_WRITE_CONTROL_NOT_DETECT             ((uint32_t)0x00000000)                                  /*!< MTL Tx queue write controller status is not detected */

#define MTL_TXQ_DEBUG_TRCSTS(regval)                  (BITS(1,2) & ((uint32_t)(regval) << 1))                 /*!< write value to ENET_MTL_TXQ_DEBUG_TRCSTS bit field */
#define ENET_TXQ_READ_CONTROLLER_STATE_IDLE           MTL_TXQ_DEBUG_TRCSTS(0)                                 /*!< Tx queue read controller in idle state */
#define ENET_TXQ_READ_CONTROLLER_STATE_READ           MTL_TXQ_DEBUG_TRCSTS(1)                                 /*!< Tx queue read controller in read state */
#define ENET_TXQ_READ_CONTROLLER_STATE_WAITING        MTL_TXQ_DEBUG_TRCSTS(2)                                 /*!< Tx queue read controller is waiting for pending Tx status from the MAC transmitter */
#define ENET_TXQ_READ_CONTROLLER_STATE_FLUSHING       MTL_TXQ_DEBUG_TRCSTS(3)                                 /*!< Tx queue read controller is flushing the Tx queue because of the packet abort request from the MAC */

#define ENET_TXQ_IN_PAUSE_DETECT                     ENET_MTL_TXQ1_DEBUG_TXQPAUSED                                 /*!< MTL Tx queue in pause status is detected */
#define ENET_TXQ_IN_PAUSE_NOT_DETECT                ((uint32_t)0x00000000)                                        /*!< MTL Tx queue in pause status is not detected */
/* MTL transmit queue underflow counter register value */
#define GET_AVER_BITS(regval)                         GET_BITS((uint32_t)(regval),0,23)                       /*!< get value of ENET_MTL_TXQ_EST_STATUS_ABS bit field */

/* MTL transmit queue quantum weight register value */
#define MTL_TXQ_QUANTUM_ISCQW(regval)                (BITS(0,20) & ((uint32_t)(regval) << 0))                 /*!< write value to ENET_MTL_TXQ_QUANTUM_ISCQW bit field */

/* MTL receive queue operation mode register value */
#define MTL_RXQ_OPERATION_MODE_RTC(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))                  /*!< write value to ENET_DMA_CTL_RTHC bit field */
#define ENET_RX_THRESHOLD_64BYTES                     MTL_RXQ_OPERATION_MODE_RTC(0)                           /*!< threshold level is 64 Bytes */
#define ENET_RX_THRESHOLD_32BYTES                     MTL_RXQ_OPERATION_MODE_RTC(1)                           /*!< threshold level is 32 Bytes */
#define ENET_RX_THRESHOLD_96BYTES                     MTL_RXQ_OPERATION_MODE_RTC(2)                           /*!< threshold level is 96 Bytes */
#define ENET_RX_THRESHOLD_128BYTES                    MTL_RXQ_OPERATION_MODE_RTC(3)                           /*!< threshold level is 128 Bytes */

#define MTL_RXQ_OPERATION_MODE_RFA(regval)            (BITS(8,11) & ((uint32_t)(regval) << 8))                /*!< write value to ENET_MTL_RXQ_OPERATION_MODE_RFA bit field */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_1K           MTL_RXQ_OPERATION_MODE_RFA(0)                           /*!< full minus 1 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_1_5K         MTL_RXQ_OPERATION_MODE_RFA(1)                           /*!< full minus 1.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_2K           MTL_RXQ_OPERATION_MODE_RFA(2)                           /*!< full minus 2 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_2_5K         MTL_RXQ_OPERATION_MODE_RFA(3)                           /*!< full minus 2.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_3K           MTL_RXQ_OPERATION_MODE_RFA(4)                           /*!< full minus 3 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_3_5K         MTL_RXQ_OPERATION_MODE_RFA(5)                           /*!< full minus 3.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_4K           MTL_RXQ_OPERATION_MODE_RFA(6)                           /*!< full minus 4 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_4_5K         MTL_RXQ_OPERATION_MODE_RFA(7)                           /*!< full minus 4.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_5K           MTL_RXQ_OPERATION_MODE_RFA(8)                           /*!< full minus 5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_5_5K         MTL_RXQ_OPERATION_MODE_RFA(9)                           /*!< full minus 5.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_6K           MTL_RXQ_OPERATION_MODE_RFA(10)                           /*!< full minus 6 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_6_5K         MTL_RXQ_OPERATION_MODE_RFA(11)                           /*!< full minus 6.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_7K           MTL_RXQ_OPERATION_MODE_RFA(12)                           /*!< full minus 7 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_7_5K         MTL_RXQ_OPERATION_MODE_RFA(13)                           /*!< full minus 7.5 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_8K           MTL_RXQ_OPERATION_MODE_RFA(14)                           /*!< full minus 8 KB */
#define ENET_ACTIVE_THRESHOLD_FULL_MINUS_8_5K         MTL_RXQ_OPERATION_MODE_RFA(15)                           /*!< full minus 8.5 KB */

#define MTL_RXQ_OPERATION_MODE_RFD(regval)            (BITS(14,17) & ((uint32_t)(regval) << 14))              /*!< write value to ENET_MAC_FCTH_RFD bit field */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1K         MTL_RXQ_OPERATION_MODE_RFD(0)                           /*!< full minus 1 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1_5K       MTL_RXQ_OPERATION_MODE_RFD(1)                           /*!< full minus 1.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2K         MTL_RXQ_OPERATION_MODE_RFD(2)                           /*!< full minus 2 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2_5K       MTL_RXQ_OPERATION_MODE_RFD(3)                           /*!< full minus 2.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3K         MTL_RXQ_OPERATION_MODE_RFD(4)                           /*!< full minus 3 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3_5K       MTL_RXQ_OPERATION_MODE_RFD(5)                           /*!< full minus 3.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4K         MTL_RXQ_OPERATION_MODE_RFD(6)                           /*!< full minus 4 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4_5K       MTL_RXQ_OPERATION_MODE_RFD(7)                           /*!< full minus 4.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5K         MTL_RXQ_OPERATION_MODE_RFD(8)                           /*!< full minus 5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5_5K       MTL_RXQ_OPERATION_MODE_RFD(9)                           /*!< full minus 5.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6K         MTL_RXQ_OPERATION_MODE_RFD(10)                           /*!< full minus 6 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6_5K       MTL_RXQ_OPERATION_MODE_RFD(11)                           /*!< full minus 6.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7K         MTL_RXQ_OPERATION_MODE_RFD(12)                           /*!< full minus 7 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7_5K       MTL_RXQ_OPERATION_MODE_RFD(13)                           /*!< full minus 7.5 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8K         MTL_RXQ_OPERATION_MODE_RFD(14)                           /*!< full minus 8 KB */
#define ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8_5K       MTL_RXQ_OPERATION_MODE_RFD(15)                           /*!< full minus 8.5 KB */

