sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define MTL_RXQ_OPERATION_MODE_RQS(regval)            (BITS(20,24) & ((uint32_t)(regval) << 20))              /*!< write value to ENET_MTL_RXQ_OPERATION_MODE_RQS bit field */
#define ENET_RXQ_SIZE_256BYTES                        MTL_RXQ_OPERATION_MODE_RQS(0)                           /*!< the size of the queue is 256 bytes */
#define ENET_RXQ_SIZE_512BYTES                        MTL_RXQ_OPERATION_MODE_RQS(1)                           /*!< the size of the queue is 512 bytes */
#define ENET_RXQ_SIZE_768BYTES                        MTL_RXQ_OPERATION_MODE_RQS(2)                           /*!< the size of the queue is 768 bytes */
#define ENET_RXQ_SIZE_1024BYTES                       MTL_RXQ_OPERATION_MODE_RQS(3)                           /*!< the size of the queue is 1024 bytes */
#define ENET_RXQ_SIZE_1280BYTES                       MTL_RXQ_OPERATION_MODE_RQS(4)                           /*!< the size of the queue is 1280 bytes */
#define ENET_RXQ_SIZE_1536BYTES                       MTL_RXQ_OPERATION_MODE_RQS(5)                           /*!< the size of the queue is 1536 bytes */
#define ENET_RXQ_SIZE_1792BYTES                       MTL_RXQ_OPERATION_MODE_RQS(6)                           /*!< the size of the queue is 1792 bytes */
#define ENET_RXQ_SIZE_2048BYTES                       MTL_RXQ_OPERATION_MODE_RQS(7)                           /*!< the size of the queue is 2048 bytes */
#define ENET_RXQ_SIZE_2304BYTES                       MTL_RXQ_OPERATION_MODE_RQS(8)                           /*!< the size of the queue is 2304 bytes */
#define ENET_RXQ_SIZE_2560BYTES                       MTL_RXQ_OPERATION_MODE_RQS(9)                           /*!< the size of the queue is 2560 bytes */
#define ENET_RXQ_SIZE_2816BYTES                       MTL_RXQ_OPERATION_MODE_RQS(10)                          /*!< the size of the queue is 2816 bytes */
#define ENET_RXQ_SIZE_3072BYTES                       MTL_RXQ_OPERATION_MODE_RQS(11)                          /*!< the size of the queue is 3072 bytes */
#define ENET_RXQ_SIZE_3328BYTES                       MTL_RXQ_OPERATION_MODE_RQS(12)                          /*!< the size of the queue is 3328 bytes */
#define ENET_RXQ_SIZE_3584BYTES                       MTL_RXQ_OPERATION_MODE_RQS(13)                          /*!< the size of the queue is 3584 bytes */
#define ENET_RXQ_SIZE_3840BYTES                       MTL_RXQ_OPERATION_MODE_RQS(14)                          /*!< the size of the queue is 3840 bytes */
#define ENET_RXQ_SIZE_4096BYTES                       MTL_RXQ_OPERATION_MODE_RQS(15)                          /*!< the size of the queue is 4096 bytes */
#define ENET_RXQ_SIZE_4352BYTES                       MTL_RXQ_OPERATION_MODE_RQS(16)                          /*!< the size of the queue is 4352 bytes */
#define ENET_RXQ_SIZE_4608BYTES                       MTL_RXQ_OPERATION_MODE_RQS(17)                          /*!< the size of the queue is 4608 bytes */
#define ENET_RXQ_SIZE_4864BYTES                       MTL_RXQ_OPERATION_MODE_RQS(18)                          /*!< the size of the queue is 4864 bytes */
#define ENET_RXQ_SIZE_5120BYTES                       MTL_RXQ_OPERATION_MODE_RQS(19)                          /*!< the size of the queue is 5120 bytes */
#define ENET_RXQ_SIZE_5376BYTES                       MTL_RXQ_OPERATION_MODE_RQS(20)                          /*!< the size of the queue is 5376 bytes */
#define ENET_RXQ_SIZE_5632BYTES                       MTL_RXQ_OPERATION_MODE_RQS(21)                          /*!< the size of the queue is 5632 bytes */
#define ENET_RXQ_SIZE_5888BYTES                       MTL_RXQ_OPERATION_MODE_RQS(22)                          /*!< the size of the queue is 5888 bytes */
#define ENET_RXQ_SIZE_6144BYTES                       MTL_RXQ_OPERATION_MODE_RQS(23)                          /*!< the size of the queue is 6144 bytes */
#define ENET_RXQ_SIZE_6400BYTES                       MTL_RXQ_OPERATION_MODE_RQS(24)                          /*!< the size of the queue is 6400 bytes */
#define ENET_RXQ_SIZE_6656BYTES                       MTL_RXQ_OPERATION_MODE_RQS(25)                          /*!< the size of the queue is 6656 bytes */
#define ENET_RXQ_SIZE_6912BYTES                       MTL_RXQ_OPERATION_MODE_RQS(26)                          /*!< the size of the queue is 6912 bytes */
#define ENET_RXQ_SIZE_7168BYTES                       MTL_RXQ_OPERATION_MODE_RQS(27)                          /*!< the size of the queue is 7168 bytes */
#define ENET_RXQ_SIZE_7424BYTES                       MTL_RXQ_OPERATION_MODE_RQS(28)                          /*!< the size of the queue is 7424 bytes */
#define ENET_RXQ_SIZE_7680BYTES                       MTL_RXQ_OPERATION_MODE_RQS(29)                          /*!< the size of the queue is 7680 bytes */
#define ENET_RXQ_SIZE_7936BYTES                       MTL_RXQ_OPERATION_MODE_RQS(30)                          /*!< the size of the queue is 7936 bytes */
#define ENET_RXQ_SIZE_8192BYTES                       MTL_RXQ_OPERATION_MODE_RQS(31)                          /*!< the size of the queue is 8192 bytes */

#define ENET_FORWARD_UNDERSZ_GOODFRAMES_ENABLE        ENET_MTL_RXQ0_OPERATION_MODE_FUP                        /*!< forward undersized good frames */
#define ENET_FORWARD_UNDERSZ_GOODFRAMES_DISABLE       ((uint32_t)0x00000000)                                  /*!< RxFIFO drops all frames whose length is less than 64 bytes */
#define ENET_FORWARD_UNDERSZ_GOODFRAMES               ENET_MTL_RXQ0_OPERATION_MODE_FUP                        /*!< the function that forwarding undersized good frames */


#define ENET_FORWARD_ERRFRAMES_ENABLE                 ENET_MTL_RXQ0_OPERATION_MODE_FEP                        /*!< all frame received with error except runt error are forwarded to memory */
#define ENET_FORWARD_ERRFRAMES_DISABLE                ((uint32_t)0x00000000)                                  /*!< RxFIFO drop error frame */
#define ENET_FORWARD_ERRFRAMES                        ENET_MTL_RXQ0_OPERATION_MODE_FEP                        /*!< the function that all frame received with error except runt error are forwarded to memory */

#define ENET_RX_MODE_STOREFORWARD                     ENET_MTL_RXQ0_OPERATION_MODE_RSF                        /*!< RxFIFO operates in store-and-forward mode */
#define ENET_RX_MODE_CUTTHROUGH                       ((uint32_t)0x00000000)                                  /*!< RxFIFO operates in cut-through mode */

