sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_TCPIP_CKSUMERROR_ACCEPT                  ENET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF                 /*!< Rx frame with only payload error but no other errors will not be dropped */
#define ENET_TCPIP_CKSUMERROR_DROP                   ((uint32_t)0x00000000)                                   /*!< all error frames will be dropped when FEP = 0 */

#define ENET_RXQ0_HARDWARE_FLOW_CONTROL_ENABLE       (ENET_MTL_RXQ0_OPERATION_MODE_EHFC << 3U)                /*!< rxq0 hardware flow control is enabled */
#define ENET_RXQ0_HARDWARE_FLOW_CONTROL_DISABLE      ((uint32_t)0x00000000)                                   /*!< rxq0 hardware flow control is disabled */
#define ENET_RXQ1_HARDWARE_FLOW_CONTROL_ENABLE       (ENET_MTL_RXQ0_OPERATION_MODE_EHFC << 4U)                /*!< rxq1 hardware flow control is enabled */
#define ENET_RXQ1_HARDWARE_FLOW_CONTROL_DISABLE      ((uint32_t)0x00000000)                                   /*!< rxq1 hardware flow control is disabled */

#define ENET_HARDWARE_FLOW_CONTROL                    ENET_MTL_RXQ0_OPERATION_MODE_EHFC                       /*!< hardware flow control */

/* MTL receive queue missed frame overflow counter register value */
#define GET_OVERFLOW_PACKET_COUNTER(regval)           GET_BITS((uint32_t)(regval),0,10)                       /*!< get value of ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT bit field */

#define ENET_RX_OVERFLOW_COUNTER_OVERFLOW             ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF      /*!< overflow counter overflow detected */

#define GET_MISSED_PACKET_COUNTER(regval)             GET_BITS((uint32_t)(regval),16,26)                      /*!< get value of ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MFCNT bit field */

#define ENET_RX_MISSED_COUNTER_OVERFLOW               ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF      /*!< missed packet counter overflow detected */

/* MTL receive queue debug register value */
#define GET_RXQ_PACKETS_NUMBER(regval)                GET_BITS((uint32_t)(regval),16,29)                      /*!< get value of ENET_MTL_RXQ0_DEBUG_PRXQ bit field */

#define GET_RXQ_FILL_LEVEL(regval)                   (BITS(4,5) & ((uint32_t)(regval) << 4))                  /*!< get value of ENET_MTL_RXQ0_DEBUG_RXQSTS bit field */
#define ENET_RXQ_EMPTY                               ((uint32_t)0x00000000)                                   /*!< Rx queue empty */
#define ENET_RXQ_FILL_BELOW_DEACTIVATE_THRESHOLD     BIT(4)                                                   /*!< Rx queue fill-level below flow-control deactivate threshold */
#define ENET_RXQ_FILL_ABOVE_ACTIVATE_THRESHOLD       BIT(5)                                                   /*!< Rx queue fill-level above flow-control activate threshold */
#define ENET_RXQ_FULL                                BIT(4) | BIT(5)                                          /*!< Rx queue full */

#define GET_RXQ_READ_CONTROLLER_STATE(regval)        (BITS(1,2) & ((uint32_t)(regval) << 1))                  /*!< get value of ENET_MTL_RXQ0_DEBUG_RRCSTS bit field */
#define ENET_RXQ_READ_CONTROLLER_IDLE                ((uint32_t)0x00000000)                                   /*!< idle state */
#define ENET_RXQ_READ_CONTROLLER_READING_DATA        BIT(1)                                                   /*!< reading packet data */
#define ENET_RXQ_READ_CONTROLLER_READING_STATUS      BIT(2)                                                   /*!< reading packet status (or timestamp */
#define ENET_RXQ_READ_CONTROLLER_FLUSHING            BIT(1) | BIT(2)                                          /*!< flushing the packet data and status */

#define ENET_RXQ_WRITE_CONTROLLER_ACTIVE             ENET_MTL_RXQ0_DEBUG_RWCSTS                               /*!< indicates that the MTL Rx queue write controller is active */
#define ENET_RXQ_WRITE_CONTROLLER_INACTIVE           ((uint32_t)0x00000000)                                   /*!< indicates that the MTL Rx queue write controller is inactive */

/* MTL receive queue control register value */
#define MTL_RXQ_CONTROL_RXQ_WEGT(regval)             (BITS(0,2) & ((uint32_t)(regval) << 0))                  /*!< write value to ENET_MTL_RXQ_CONTROL_RXQ_WEGT bit field */

#define MTL_RXQ_PACKET_ARBITRATION(regval)           (BIT(3) & ((uint32_t)(regval) << 3))                     /*!< receive queue packet arbitration config */

/* MTL transmit queue 1 ETS control register value */
#define MTL_TXQ1_EST_CONTROL_SLC(regval)             (BITS(4,6) & ((uint32_t)(regval) << 4))                  /*!< write value to ENET_MTL_TXQ1_EST_CONTROL_SLC bit field */
#define ENET_CBS_1SLOT                               MTL_TXQ1_EST_CONTROL_SLC(0)                              /*!< 1 slot */
#define ENET_CBS_2SLOT                               MTL_TXQ1_EST_CONTROL_SLC(1)                              /*!< 2 slot */
#define ENET_CBS_4SLOT                               MTL_TXQ1_EST_CONTROL_SLC(2)                              /*!< 4 slot */
#define ENET_CBS_8SLOT                               MTL_TXQ1_EST_CONTROL_SLC(3)                              /*!< 8 slot */
#define ENET_CBS_16SLOT                              MTL_TXQ1_EST_CONTROL_SLC(4)                              /*!< 16 slot */

#define ENET_TXQ1_CREDIT_CONTROL_ENABLE              ENET_MTL_TXQ1_ETS_CONTROL_CC                             /*!< credit control is enable */
#define ENET_TXQ1_CREDIT_CONTROL_DISABLE             ~ENET_TXQ1_CREDIT_CONTROL_ENABLE                         /*!< credit control is disabled */
#define ENET_TXQ1_CREDIT_CONTROL                     ENET_MTL_TXQ1_ETS_CONTROL_CC                             /*!< the accumulated credit is not reset to zero when there is positive credit and no packet to transmit in Channel 1 */

#define ENET_TXQ1_AV_ALGO_ENABLE                     ENET_MTL_TXQ1_ETS_CONTROL_AVALG                         /*!< CBS algorithm is enable */
#define ENET_TXQ1_AV_ALGO_DISABLE                    ~ENET_TXQ1_AV_ALGO_ENABLE                                  /*!< CBS algorithm is disabled */
#define ENET_TXQ1_AV_ALGO                            ENET_MTL_TXQ1_ETS_CONTROL_AVALG                         /*!< when queue 1 is programmed for AV, this field configures the scheduling algorithm for this queue */

/* MTL transmit queue 1 sendSlopeCredit register value */
#define MTL_TXQ1_SENDSLOPECREDIT_SSC(regval)         (BITS(0,13) & ((uint32_t)(regval) << 0))                /*!< write value to ENET_MTL_TXQ1_SENDSLOPECREDIT_SSC bit field */

