sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* MTL transmit queue 1 high credit register value */
#define MTL_TXQ1_HICREDIT_HC(regval)                 (BITS(0,28) & ((uint32_t)(regval) << 0))                /*!< write value to ENET_MTL_TXQ1_HICREDIT_HC bit field */

/* MTL transmit queue 1 sendSlopeCredit register value */
#define MTL_TXQ1_LOCREDIT_LC(regval)                 (BITS(0,28) & ((uint32_t)(regval) << 0))                /*!< write value to ENET_MTL_TXQ1_LOCREDIT_LC bit field */

/* DMA mode register value */
#define DMA_MODE_TAA(regval)                         (BITS(2,4) & ((uint32_t)(regval) << 2))                 /*!< write value to ENET_DMA_MODE_TAA bit field */
#define ENET_TX_CHANNEL_ARBITRATION_FP               DMA_MODE_TAA(0)                                         /*!< select the fixed priority arbitration algorithm for the transmit side */
#define ENET_TX_CHANNEL_ARBITRATION_WSP              DMA_MODE_TAA(1)                                         /*!< select the weighted strict priority arbitration algorithm for the transmit side */
#define ENET_TX_CHANNEL_ARBITRATION_WRR              DMA_MODE_TAA(2)                                         /*!< select the weighted round-robin arbitration algorithm for the transmit side */

#define DMA_MODE_TXPR(regval)                     (BIT(11) & ((uint32_t)(regval) << 11))       /*!< write value to DMA_MODE_TXPR bit field */

#define DMA_MODE_PR(regval)                         (BITS(12,14) & ((uint32_t)(regval) << 12))               /*!< write value to ENET_DMA_MODE_TAA bit field */
#define ENET_ARBITRATION_RXTX_1_1                   DMA_MODE_PR(0)                                           /*!< receive and transmit priority ratio is 1:1 */
#define ENET_ARBITRATION_RXTX_2_1                   DMA_MODE_PR(1)                                           /*!< receive and transmit priority ratio is 2:1 */
#define ENET_ARBITRATION_RXTX_3_1                   DMA_MODE_PR(2)                                           /*!< receive and transmit priority ratio is 3:1 */
#define ENET_ARBITRATION_RXTX_4_1                   DMA_MODE_PR(3)                                           /*!< receive and transmit priority ratio is 4:1 */
#define ENET_ARBITRATION_RXTX_5_1                   DMA_MODE_PR(4)                                           /*!< receive and transmit priority ratio is 5:1 */
#define ENET_ARBITRATION_RXTX_6_1                   DMA_MODE_PR(5)                                           /*!< receive and transmit priority ratio is 6:1 */
#define ENET_ARBITRATION_RXTX_7_1                   DMA_MODE_PR(6)                                           /*!< receive and transmit priority ratio is 7:1 */
#define ENET_ARBITRATION_RXTX_8_1                   DMA_MODE_PR(7)                                           /*!< receive and transmit priority ratio is 8:1 */
#define ENET_ARBITRATION_TXRX_1_1                   (DMA_MODE_PR(0) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 1:1 */
#define ENET_ARBITRATION_TXRX_2_1                   (DMA_MODE_PR(1) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 2:1 */
#define ENET_ARBITRATION_TXRX_3_1                   (DMA_MODE_PR(2) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 3:1 */
#define ENET_ARBITRATION_TXRX_4_1                   (DMA_MODE_PR(3) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 4:1 */
#define ENET_ARBITRATION_TXRX_5_1                   (DMA_MODE_PR(4) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 5:1 */
#define ENET_ARBITRATION_TXRX_6_1                   (DMA_MODE_PR(5) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 6:1 */
#define ENET_ARBITRATION_TXRX_7_1                   (DMA_MODE_PR(6) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 7:1 */
#define ENET_ARBITRATION_TXRX_8_1                   (DMA_MODE_PR(7) | ENET_DMA_MODE_TXPR)                    /*!< transmit and receive priority ratio is 8:1 */
#define ENET_ARBITRATION_TXPRIORRX                  ENET_DMA_MODE_TXPR                                       /*!< TxDMA has higher priority than RxDMA */

#define DMA_MODE_INTM(regval)                       (BITS(16,17) & ((uint32_t)(regval) << 16))               /*!< write value to ENET_DMA_MODE_INTM bit field */
#define ENET_INTERRUPT_MODE0                        DMA_MODE_INTM(0)                                         /*!< interrupt mode 0 */
#define ENET_INTERRUPT_MODE1                        DMA_MODE_INTM(1)                                         /*!< interrupt mode 1 */
#define ENET_INTERRUPT_MODE2                        DMA_MODE_INTM(2)                                         /*!< interrupt mode 2 */

#define ENET_TXRX_FP                                ENET_DMA_MODE_DA                                         /*!< fixed priority */
#define ENET_TXRX_WRR                               ((uint32_t)0x00000000)                                   /*!< weighted round-robin */

/* DMA system bus mode register value */
#define ENET_FIXED_BURST_ENABLE                     ENET_DMA_SYSBUS_MODE_FB                                  /*!< AHB can only use SINGLE/INCR4/INCR8/INCR16 during start of normal burst transfers */
#define ENET_FIXED_BURST_DISABLE                    ((uint32_t)0x00000000)                                   /*!< AHB can use SINGLE/INCR burst transfer operations */

#define ENET_ADDRESS_ALIGN_ENABLE                   ENET_DMA_SYSBUS_MODE_AAL                                 /*!< enabled address-aligned */
#define ENET_ADDRESS_ALIGN_DISABLE                  ((uint32_t)0x00000000)                                   /*!< disable address-aligned */

#define ENET_MIXED_BURST_ENABLE                     ENET_DMA_SYSBUS_MODE_MB                                  /*!< AHB master interface transfer burst length greater than 16 with INCR */
#define ENET_MIXED_BURST_DISABLE                    ((uint32_t)0x00000000)                                   /*!< AHB master interface only transfer fixed burst length with 16 and below */

#define ENET_REBUILD_INCRx_BURST_ENABLE             ENET_DMA_SYSBUS_MODE_RB                                  /*!< rebuild INCRx Burst is enabled */
#define ENET_REBUILD_INCRx_BURST_DISABLE            ((uint32_t)0x00000000)                                   /*!< rebuild INCRx Burst is disabled */

/* DMA debug status 0 register value */
#define GET_RXDMACH0_PROCESS_STATE(regval)          (BITS(8,11) & ((uint32_t)(regval) << 8))                 /*!< get value of ENET_DMA_DEBUG_STATUS0_RPS0 bit field */
#define ENET_RXCH0_STATE_STOPPED                    ((uint32_t)0x00000000)                                   /*!< reset or stop rx command issued */
#define ENET_RXCH0_STATE_FETCHING                   BIT(8)                                                   /*!< fetching the Rx descriptor */
#define ENET_RXCH0_STATE_WAITING                    (BIT(8)|BIT(9))                                          /*!< waiting for receive packet */
#define ENET_RXCH0_STATE_SUSPENDED                  BIT(10)                                                  /*!< Rx descriptor unavailable */
#define ENET_RXCH0_STATE_CLOSING                    (BIT(8)|BIT(10))                                         /*!< closing receive descriptor */
#define ENET_RXCH0_STATE_WRITING                    (BIT(9)|BIT(10))                                         /*!< writing timestamp */
#define ENET_RXCH0_STATE_QUEUING                    (BIT(8)|BIT(9)|BIT(10))                                  /*!< transferring the receive packet data from recevie buffer to host memory */

