sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define GET_TXDMACH0_PROCESS_STATE(regval)          (BITS(12,15) & ((uint32_t)(regval) << 12))               /*!< get value of ENET_DMA_DEBUG_STATUS0_TPS0 bit field */
#define ENET_TXCH0_STATE_STOPPED                    ((uint32_t)0x00000000)                                   /*!< reset or stop Tx Command issued  */
#define ENET_TXCH0_STATE_FETCHING                   BIT(12)                                                  /*!< fetching the Tx descriptor */
#define ENET_TXCH0_STATE_WAITING                    BIT(13)                                                  /*!< waiting for status */
#define ENET_TXCH0_STATE_READING                    (BIT(12)|BIT(13))                                        /*!< reading the data from host memory buffer and queuing it to transmit buffer */
#define ENET_TXCH0_STATE_WRITING                    BIT(14)                                                  /*!< writing timestamp */
#define ENET_TXCH0_STATE_SUSPENDED                  (BIT(13)|BIT(14))                                        /*!< Tx descriptor unavailabe or transmit buffer underflow */
#define ENET_TXCH0_STATE_CLOSING                    (BIT(12)|BIT(13)|BIT(14))                                /*!< closing Tx descriptor */

#define GET_RXDMACH1_PROCESS_STATE(regval)          (BITS(16,19) & ((uint32_t)(regval) << 16))               /*!< get value of ENET_DMA_DEBUG_STATUS0_RPS1 bit field */
#define ENET_RXCH1_STATE_STOPPED                    ((uint32_t)0x00000000)                                   /*!< reset or stop rx command issued */
#define ENET_RXCH1_STATE_FETCHING                   BIT(16)                                                  /*!< fetching the Rx descriptor */
#define ENET_RXCH1_STATE_WAITING                    (BIT(16)|BIT(17))                                        /*!< waiting for receive packet */
#define ENET_RXCH1_STATE_SUSPENDED                  BIT(18)                                                  /*!< Rx descriptor unavailable */
#define ENET_RXCH1_STATE_CLOSING                    (BIT(16)|BIT(18))                                        /*!< closing receive descriptor */
#define ENET_RXCH1_STATE_WRITING                    (BIT(17)|BIT(18))                                        /*!< writing timestamp */
#define ENET_RXCH1_STATE_QUEUING                    (BIT(16)|BIT(17)|BIT(18))                                /*!< transferring the receive packet data from recevie buffer to host memory */

#define GET_TXDMACH1_PROCESS_STATE(regval)          (BITS(20,23) & ((uint32_t)(regval) << 20))               /*!< get value of ENET_DMA_DEBUG_STATUS0_TPS1 bit field */
#define ENET_TXCH1_STATE_STOPPED                    ((uint32_t)0x00000000)                                   /*!< reset or stop Tx Command issued  */
#define ENET_TXCH1_STATE_FETCHING                   BIT(20)                                                  /*!< fetching the Tx descriptor */
#define ENET_TXCH1_STATE_WAITING                    BIT(21)                                                  /*!< waiting for status */
#define ENET_TXCH1_STATE_READING                    (BIT(20)|BIT(21))                                        /*!< reading the data from host memory buffer and queuing it to transmit buffer */
#define ENET_TXCH1_STATE_WRITING                    BIT(22)                                                  /*!< writing timestamp */
#define ENET_TXCH1_STATE_SUSPENDED                  (BIT(21)|BIT(22))                                        /*!< Tx descriptor unavailabe or transmit buffer underflow */
#define ENET_TXCH1_STATE_CLOSING                    (BIT(21)|BIT(22)|BIT(23))                                /*!< closing Tx descriptor */

/* DMA TBS control 0 register value */
#define DMA_TBS_CTRL0_FGOS(regval)                  (BITS(4,6) & ((uint32_t)(regval) << 4))                  /*!< write value to ENET_DMA_TBS_CTRL0_FGOS bit field */

#define DMA_TBS_CTRL0_FTOS(regval)                  (BITS(8,31) & ((uint32_t)(regval) << 8))                 /*!< write value to ENET_DMA_TBS_CTRL0_FTOS bit field */

#define ENET_FETCH_TIME_OFFSET_VALID                 ENET_DMA_TBS_CTRL0_FTOV                                 /*!< the FTOS field is valid */

/* DMA channel control register value */
#define DMA_CH_CONTROL_DSL(regval)                   (BITS(18,20) & ((uint32_t)(regval) << 18))       /*!< write value to ENET_DMA_CH_CONTROL_DSL bit field */
#define GET_DMA_CH_CONTROL_DSL(regval)               GET_BITS((regval),18,20)                         /*!< get value of ENET_DMA_CH_CONTROL_DSL bit field */
#define ENET_DMA_CH_PBLx8_ENABLE                     ENET_DMA_CTL_DTCERFD                             /*!< 8xPBL mode is enabled */
#define ENET_DMA_CH_PBLx8_DISABLE                    ((uint32_t)0x00000000)                           /*!< 8xPBL mode is disabled */

/* DMA channel transmit control register value */
#define DMA_CH_TX_CONTROL_TxPBL(regval)           ((BITS(16,21) & ((uint32_t)(regval) << 16))>>8)                     /*!< write value to DMA_CH_TX_CONTROL_TxPBL bit field */
#define ENET_PGBL_1BEAT                           DMA_CH_TX_CONTROL_TxPBL(1)                                          /*!< maximum number of beats is 1 */
#define ENET_PGBL_2BEAT                           DMA_CH_TX_CONTROL_TxPBL(2)                                          /*!< maximum number of beats is 2 */
#define ENET_PGBL_4BEAT                           DMA_CH_TX_CONTROL_TxPBL(4)                                          /*!< maximum number of beats is 4 */
#define ENET_PGBL_8BEAT                           DMA_CH_TX_CONTROL_TxPBL(8)                                          /*!< maximum number of beats is 8 */
#define ENET_PGBL_16BEAT                          DMA_CH_TX_CONTROL_TxPBL(16)                                         /*!< maximum number of beats is 16 */
#define ENET_PGBL_32BEAT                          DMA_CH_TX_CONTROL_TxPBL(32)                                         /*!< maximum number of beats is 32 */
#define ENET_PGBL_8xPGBL_8BEAT                    (DMA_CH_TX_CONTROL_TxPBL(1)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats is 4 */
#define ENET_PGBL_8xPGBL_16BEAT                   (DMA_CH_TX_CONTROL_TxPBL(2)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats is 8 */
#define ENET_PGBL_8xPGBL_32BEAT                   (DMA_CH_TX_CONTROL_TxPBL(4)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats is 16 */
#define ENET_PGBL_8xPGBL_64BEAT                   (DMA_CH_TX_CONTROL_TxPBL(8)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats is 32 */
#define ENET_PGBL_8xPGBL_128BEAT                  (DMA_CH_TX_CONTROL_TxPBL(16)|(ENET_DMA_CH_CONTROL_PBLx8<<7))        /*!< maximum number of beats is 64 */
#define ENET_PGBL_8xPGBL_256BEAT                  (DMA_CH_TX_CONTROL_TxPBL(32)|(ENET_DMA_CH_CONTROL_PBLx8<<7))        /*!< maximum number of beats is 128 */

#define DMA_CH_TX_WEIGHT(regval)                       (BITS(1,3) & ((uint32_t)(regval) << 1))          /*!< write value to DMA_CH_TX_CONTROL_TCW bit field */
#define ENET_SECONDFRAME_OPT_ENABLE                    BIT(4)                                           /*!< TxDMA controller operate on second frame mode enable*/
#define ENET_SECONDFRAME_OPT_DISABLE                   ((uint32_t)0x00000000)                           /*!< TxDMA controller operate on second frame mode disable */
#define ENET_SECONDFRAME_OPT                           ENET_SECONDFRAME_OPT_ENABLE                      /*!< TxDMA controller operate on second frame function */
#define ENET_ENHANCED_DESCRIPTOR                       BIT(28)                                          /*!< enhanced mode descriptor */
#define ENET_NORMAL_DESCRIPTOR                        ((uint32_t)0x00000000U)                           /*!< normal mode descriptor */

/* DMA channel receive control register value */
#define ENET_FLUSH_RXFRAME_ENABLE                 BIT(31)                                                             /*!< RxDMA flushes all frames */
#define ENET_FLUSH_RXFRAME_DISABLE                ((uint32_t)0x00000000)                                              /*!< RxDMA does not flush any frames */
#define ENET_FLUSH_RXFRAME                        ENET_FLUSH_RXFRAME_ENABLE                                           /*!< RxDMA flushes frames function */

#define DMA_CH_RX_CONTROL_RxPBL(regval)           (BITS(16,22) & ((uint32_t)(regval) << 16))                          /*!< write value to DMA_CH_RX_CONTROL_RxPBL bit field */
#define ENET_RXDP_1BEAT                           DMA_CH_RX_CONTROL_RxPBL(1)                                          /*!< maximum number of beats 1 */
#define ENET_RXDP_2BEAT                           DMA_CH_RX_CONTROL_RxPBL(2)                                          /*!< maximum number of beats 2 */
#define ENET_RXDP_4BEAT                           DMA_CH_RX_CONTROL_RxPBL(4)                                          /*!< maximum number of beats 4 */
#define ENET_RXDP_8BEAT                           DMA_CH_RX_CONTROL_RxPBL(8)                                          /*!< maximum number of beats 8 */
#define ENET_RXDP_16BEAT                          DMA_CH_RX_CONTROL_RxPBL(16)                                         /*!< maximum number of beats 16 */
#define ENET_RXDP_32BEAT                          DMA_CH_RX_CONTROL_RxPBL(32)                                         /*!< maximum number of beats 32 */
#define ENET_RXDP_8xPGBL_8BEAT                    (DMA_CH_RX_CONTROL_RxPBL(1)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats 4 */
#define ENET_RXDP_8xPGBL_16BEAT                   (DMA_CH_RX_CONTROL_RxPBL(2)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats 8 */
#define ENET_RXDP_8xPGBL_32BEAT                   (DMA_CH_RX_CONTROL_RxPBL(4)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats 16 */
#define ENET_RXDP_8xPGBL_64BEAT                   (DMA_CH_RX_CONTROL_RxPBL(8)|(ENET_DMA_CH_CONTROL_PBLx8<<7))         /*!< maximum number of beats 32 */
#define ENET_RXDP_8xPGBL_128BEAT                  (DMA_CH_RX_CONTROL_RxPBL(16)|(ENET_DMA_CH_CONTROL_PBLx8<<7))        /*!< maximum number of beats 64 */
#define ENET_RXDP_8xPGBL_256BEAT                  (DMA_CH_RX_CONTROL_RxPBL(32)|(ENET_DMA_CH_CONTROL_PBLx8<<7))        /*!< maximum number of beats 128 */  
#define DMA_CH_RX_CONTROL_RBSZ(regval)                (BITS(1,14) & ((uint32_t)(regval) << 1))                        /*!< write value to DMA_CH_RX_CONTROL_RBSZ bit field */

/* DMA channel transmit descriptor ring length register value */
#define DMA_CH_TXDESC_RING_LENGTH_TDRL(regval)        (BITS(0,9) & ((uint32_t)(regval) << 0))           /*!< write value to ENET_DMA_CH0_TXDESC_RING_LENGTH_TDRL bit field */

/* DMA channel receive control 2 register value */
#define DMA_CH_RX_CONTROL2_RDRL(regval)               (BITS(0,9) & ((uint32_t)(regval) << 0))           /*!< write value to ENET_DMA_CH0_RX_CONTROL2_RDRL bit field */
#define DMA_CH_RX_CONTROL2_ARBS(regval)               (BITS(17,23) & ((uint32_t)(regval) << 17))        /*!< write value to ENET_DMA_CH0_RX_CONTROL2_ARBS bit field */

/* DMA channel receive interrupt watchdog timer register value */
#define DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT(regval) (BITS(0,7) & ((uint32_t)(regval) << 0))          /*!< write value to ENET_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT bit field */

#define DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(regval)   (BITS(16,17) & ((uint32_t)(regval) << 16))          /*!< write value to ENET_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU bit field */
#define ENET_RX_INT_WATCHDOG_TIMER_COUNT_256              DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(0)          /*!< 256 system clock cycles corresponding to one unit in RWT field */
#define ENET_RX_INT_WATCHDOG_TIMER_COUNT_512              DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(1)          /*!< 512 system clock cycles corresponding to one unit in RWT field */
#define ENET_RX_INT_WATCHDOG_TIMER_COUNT_1024             DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(2)          /*!< 1024 system clock cycles corresponding to one unit in RWT field */
#define ENET_RX_INT_WATCHDOG_TIMER_COUNT_2048             DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(3)          /*!< 2048 system clock cycles corresponding to one unit in RWT field */

/* DMA channel slot function control status register value */
#define GET_REF_SLOT_NUMBER(regval)                      GET_BITS((regval),16,19)         /*!< get value of ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_RSN bit field */
#define DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV(regval) (BITS(4,15) & ((uint32_t)(regval) << 4))           /*!< write value to ENET_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV bit field */

