sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_DMA_ADVANCE_SLOT_CHECK_ENABLE               BIT(1)                                           /*!< advance slot check is enabled */
#define ENET_DMA_ADVANCE_SLOT_CHECK_DISABLE              (uint32_t)0x00000000)                            /*!< advance slot check is disable */
#define ENET_DMA_ADVANCE_SLOT_CHECK                      ENET_DMA_ADVANCE_SLOT_CHECK_ENABLE               /*!< advance slot check function */

#define ENET_DMA_SLOT_COMPARISON_ENABLE                  BIT(0)                                           /*!< slot comparison is enabled */
#define ENET_DMA_SLOT_COMPARISON_DISABLE                 (uint32_t)0x00000000)                            /*!< slot comparison is disable */
#define ENET_DMA_SLOT_COMPARISON                         ENET_DMA_SLOT_COMPARISON_ENABLE                  /*!< slot comparison function */

/* DMA channel miss frame counter register value */
#define GET_DMA_CH_MISS_FRAME_CNT_MFC(regval)           GET_BITS((regval),0,10)                           /*!< get value of ENET_DMA_CH(#i)_MISS_FRAME_CNT_MFC bit field */

#define ENET_DMA_CH_MFC_COUNTER_OVERFLOW                BIT(15)                                           /*!< miss frame counter overflow occurred */

/* DMA channel receive parser accept counter register value */
#define GET_DMA_CH_RXP_ACCEPT_CNT_RXPAC(regval)         GET_BITS((regval),0,30)                           /*!< get value of ENET_DMA_CH(#i)_RXP_ACCEPT_CNT_RXPAC bit field */

#define ENET_RXP_ACCEPT_COUNTER_OVERFLOW                BIT(31)                                           /*!< Rx parser accept counter overflow occurred */

/* define bit position and its register index offset */
#define ENET_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define ENET_REG_VAL(periph)             (REG32(ENET + ((uint32_t)(periph) >> 6)))
#define ENET_BIT_POS(val)                ((uint32_t)(val) & 0x1FU)

/* register offset */
#define DMA_CH0_TDTADDR_REG_OFFSET           ((uint16_t)0x1114U)                                /*!< DMA channel 0 transmit descriptor table address register offset */
#define DMA_CH1_TDTADDR_REG_OFFSET           ((uint16_t)0x1194U)                                /*!< DMA channel 1 transmit descriptor table address register offset */
#define DMA_CH0_TDTAIL_REG_OFFSET            ((uint16_t)0x1120U)                                /*!< DMA channel 0 transmit descriptor tail pointer address register offset */
#define DMA_CH1_TDTAIL_REG_OFFSET            ((uint16_t)0x11A0U)                                /*!< DMA channel 1 transmit descriptor tail pointer  address register offset */
#define DMA_CH0_CTDADDR_REG_OFFSET           ((uint16_t)0x1144U)                                /*!< DMA channel 0 current transmit descriptor address register offset */
#define DMA_CH1_CTDADDR_REG_OFFSET           ((uint16_t)0x11C4U)                                /*!< DMA channel 1 current transmit descriptor address register offset */
#define DMA_CH0_CTBADDR_REG_OFFSET           ((uint16_t)0x1154U)                                /*!< DMA channel 0 current transmit buffer address register offset */
#define DMA_CH1_CTBADDR_REG_OFFSET           ((uint16_t)0x11D4U)                                /*!< DMA channel 1 current transmit buffer address register offset */

#define DMA_CH0_RDTADDR_REG_OFFSET           ((uint16_t)0x111CU)                                /*!< DMA channel 0 receive descriptor table address register offset */
#define DMA_CH1_RDTADDR_REG_OFFSET           ((uint16_t)0x119CU)                                /*!< DMA channel 1 receive descriptor table address register offset */
#define DMA_CH0_RDTAIL_REG_OFFSET            ((uint16_t)0x1128U)                                /*!< DMA channel 0 receive descriptor tail pointer address register offset */
#define DMA_CH1_RDTAIL_REG_OFFSET            ((uint16_t)0x11A8U)                                /*!< DMA channel 1 receive descriptor tail pointer  address register offset */
#define DMA_CH0_CRDADDR_REG_OFFSET           ((uint16_t)0x114CU)                                /*!< DMA channel 0 current receive descriptor address register offset */
#define DMA_CH1_CRDADDR_REG_OFFSET           ((uint16_t)0x11CCU)                                /*!< DMA channel 1 current receive descriptor address register offset */
#define DMA_CH0_CRBADDR_REG_OFFSET           ((uint16_t)0x115CU)                                /*!< DMA channel 0 current receive buffer address register offset */
#define DMA_CH1_CRBADDR_REG_OFFSET           ((uint16_t)0x11DCU)                                /*!< DMA channel 1 current receive buffer address register offset */

#define MAC_INTERRUPT_STATUS_REG_OFFSET          ((uint16_t)0x00B0U)                                /*!<MAC interrupt status register offset */
#define MAC_INTERRUPT_ENABLE_REG_OFFSET          ((uint16_t)0x00B4U)                                /*!< MAC interrupts enable register offset */
#define MAC_RX_TX_STATUS_REG_OFFSET              ((uint16_t)0x00B8U)                                /*!< The receive transmit satus register offset */
#define MAC_PMT_CONTROL_STATUS_REG_OFFSET        ((uint16_t)0x00C0U)                                /*!< MAC PMT control and status register offset */
#define MAC_LPI_CONTROL_STATUS_REG_OFFSET        ((uint16_t)0x00D0U)                                /*!< MAC LPI control and status register offset */
#define MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET  ((uint16_t)0x0140U)                                /*!< MAC DPP FSM interrupt status register offset */
#define MAC_FPE_CTRL_STS_REG_OFFSET              ((uint16_t)0x0234U)                                /*!< MAC FPE control status register offset */
#define MAC_TIMESTAMP_STATUS_REG_OFFSET          ((uint16_t)0x0B20U)                                /*!< MAC timestamp status register offset */
#define MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_REG_OFFSET   ((uint16_t)0x0B30U)                        /*!< MAC transmit timestamp status in nanoseconds register offset */
#define MTL_DBG_STS_REG_OFFSET                   ((uint16_t)0x0C0CU)                                /*!< MTL debug status register offset */

#define MMC_RX_INTERRUPT_REG_OFFSET                ((uint16_t)0x0704U)                              /*!< MMC receive interrupts enable register offset */
#define MMC_TX_INTERRUPT_REG_OFFSET                ((uint16_t)0x0708U)                              /*!< MMC transimit interrupts enable register offset */
#define MMC_RX_INTERRUPT_MASK_REG_OFFSET           ((uint16_t)0x070CU)                              /*!< MMC transimit interrupts mask register offset */
#define MMC_TX_INTERRUPT_MASK_REG_OFFSET           ((uint16_t)0x0710U)                              /*!< MMC transimit interrupts mask register offset */

#define MMC_TX_OCTET_COUNT_GOOD_BAD_REG_OFFSET               ((uint16_t)0x0714U)            /*!< ethernet transmit octet count good bad register offset */
#define MMC_TX_PACKET_COUNT_GOOD_BAD_REG_OFFSET              ((uint16_t)0x0718U)            /*!< ethernet transmit packet count good bad register offset */
#define MMC_TX_BROADCAST_PACKETS_GOOD_REG_OFFSET             ((uint16_t)0x071CU)            /*!< ethernet transmit broadcast packets good register offset */
#define MMC_TX_MULTICAST_PACKETS_GOOD_REG_OFFSET             ((uint16_t)0x0720U)            /*!< ethernet transmit multicast packets good register offset */
#define MMC_TX_64OCTETS_PACKETS_GOOD_BAD_REG_OFFSET          ((uint16_t)0x0724U)            /*!< ethernet transmit 64 octet packets good bad register offset */
#define MMC_TX_65TO127OCTET_PACKETS_GOOD_BAD_REG_OFFSET      ((uint16_t)0x0728U)            /*!< ethernet transmit 65 to 127 octet packets good bad register offset */
#define MMC_TX_128TO255OCTET_PACKETS_GOOD_BAD_REG_OFFSET     ((uint16_t)0x072CU)            /*!< ethernet transmit 128 to 255 octet packets good bad register offset */
#define MMC_TX_256TO511OCTET_PACKETS_GOOD_BAD_REG_OFFSET     ((uint16_t)0x0730U)            /*!< ethernet transmit 256 to 511 octet packets good bad register offset */
#define MMC_TX_512TO1023OCTET_PACKETS_GOOD_BAD_REG_OFFSET    ((uint16_t)0x0734U)            /*!< ethernet transmit 512 to 1023 octet packets good bad register offset */
#define MMC_TX_1024TOMAXOCTET_PACKETS_GOOD_BAD_REG_OFFSET    ((uint16_t)0x0738U)            /*!< ethernet transmit 1024 to max octet packets good bad register offset */
#define MMC_TX_UNICAST_PACKETS_GOOD_BAD_REG_OFFSET           ((uint16_t)0x073CU)            /*!< ethernet transmit unicast packets good bad register offset */
#define MMC_TX_MULTICAST_PACKETS_GOOD_BAD_REG_OFFSET         ((uint16_t)0x0740U)            /*!< ethernet transmit multicast packets good bad register offset */
#define MMC_TX_BROADCAST_PACKETS_GOOD_BAD_REG_OFFSET         ((uint16_t)0x0744U)            /*!< ethernet transmit broadcast packets good bad register offset */
#define MMC_TX_UNDERFLOW_ERROR_PACKETS_REG_OFFSET            ((uint16_t)0x0748U)            /*!< ethernet transmit underflow error packets register offset */
#define MMC_TX_SINGLE_COLLISION_GOOD_PACKETS_REG_OFFSET      ((uint16_t)0x074CU)            /*!< ethernet transmit single collision good packets register offset */
#define MMC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_REG_OFFSET    ((uint16_t)0x0750U)            /*!< ethernet transmit multiple collision good packets register offset */
#define MMC_TX_DEFERRED_PACKETS_REG_OFFSET                   ((uint16_t)0x0754U)            /*!< ethernet transmit deferred packets register offset */
#define MMC_TX_LATE_COLLISION_PACKETS_REG_OFFSET             ((uint16_t)0x0758U)            /*!< ethernet transmit late collision packets register offset */
#define MMC_TX_EXCESSIVE_COLLISION_PACKETS_REG_OFFSET        ((uint16_t)0x075CU)            /*!< ethernet transmit excessive collision packets register offset */
#define MMC_TX_CARRIER_ERROR_PACKETS_REG_OFFSET              ((uint16_t)0x0760U)            /*!< ethernet transmit carrier error packets register offset */
#define MMC_TX_OCTET_COUNT_GOOD_REG_OFFSET                   ((uint16_t)0x0764U)            /*!< ethernet transmit octet count good register offset */
#define MMC_TX_PACKET_COUNT_GOOD_REG_OFFSET                  ((uint16_t)0x0768U)            /*!< ethernet transmit packet count good register offset */
#define MMC_TX_EXCESSIVE_DEFERRAL_ERROR_REG_OFFSET           ((uint16_t)0x076CU)            /*!< ethernet transmit excessive deferral error register offset */
#define MMC_TX_PAUSE_PACKETS_REG_OFFSET                      ((uint16_t)0x0770U)            /*!< ethernet transmit pause packets register offset */
#define MMC_TX_VLAN_PACKETS_GOOD_REG_OFFSET                  ((uint16_t)0x0774U)            /*!< ethernet transmit vlan packets good register offset */
#define MMC_TX_OSIZE_PACKETS_GOOD_REG_OFFSET                 ((uint16_t)0x0778U)            /*!< ethernet transmit oversize packets good register offset */
#define MMC_RX_PACKETS_COUNT_GOOD_BAD_REG_OFFSET             ((uint16_t)0x0780U)            /*!< ethernet receive packet count good bad register offset */
#define MMC_RX_OCTET_COUNT_GOOD_BAD_REG_OFFSET               ((uint16_t)0x0784U)            /*!< ethernet receive octet count good bad register offset */
#define MMC_RX_OCTET_COUNT_GOOD_REG_OFFSET                   ((uint16_t)0x0788U)            /*!< ethernet receive octet count good register offset */
#define MMC_RX_BROADCAST_PACKETS_GOOD_REG_OFFSET             ((uint16_t)0x078CU)            /*!< ethernet receive broadcast packets good register offset */
#define MMC_RX_MULTICAST_PACKETS_GOOD_REG_OFFSET             ((uint16_t)0x0790U)            /*!< ethernet receive multicast packets good register offset */
#define MMC_RX_CRC_ERROR_PACKETS_REG_OFFSET                  ((uint16_t)0x0794U)            /*!< ethernet receive crc error packets register offset */
#define MMC_RX_ALIGNMENT_ERROR_PACKETS_REG_OFFSET            ((uint16_t)0x0798U)            /*!< ethernet receive alignment error packets register offset */
#define MMC_RX_RUNT_ERROR_PACKETS_REG_OFFSET                 ((uint16_t)0x079CU)            /*!< ethernet receive runt error packets register offset */
#define MMC_RX_JABBER_ERROR_PACKETS_REG_OFFSET               ((uint16_t)0x07A0U)            /*!< ethernet receive jabber error packets register offset */
#define MMC_RX_UNDERSIZE_PACKETS_GOOD_REG_OFFSET             ((uint16_t)0x07A4U)            /*!< ethernet receive undersize packets good register offset */
#define MMC_RX_OVERSIZE_PACKETS_GOOD_REG_OFFSET              ((uint16_t)0x07A8U)            /*!< ethernet receive oversize packets good register offset */
#define MMC_RX_64OCTET_PACKETS_GOOD_BAD_REG_OFFSET           ((uint16_t)0x07ACU)            /*!< ethernet receive 64 octet packets good bad register offset */
#define MMC_RX_65TO127OCTET_PACKETS_GOOD_BAD_REG_OFFSET      ((uint16_t)0x07B0U)            /*!< ethernet receive 65 to 127 octet packets good bad register offset */
#define MMC_RX_128TO255OCTET_PACKETS_GOOD_BAD_REG_OFFSET     ((uint16_t)0x07B4U)            /*!< ethernet receive 128 to 255 octet packets good bad register offset */
#define MMC_RX_256TO511OCTET_PACKETS_GOOD_BAD_REG_OFFSET     ((uint16_t)0x07B8U)            /*!< ethernet receive 256 to 511 octet packets good bad register offset */
#define MMC_RX_512TO1023OCTET_PACKETS_GOOD_BAD_REG_OFFSET    ((uint16_t)0x07BCU)            /*!< ethernet receive 512 to 1023 octet packets good bad register offset */
#define MMC_RX_1024TOMAXOCTET_PACKETS_GOOD_BAD_REG_OFFSET    ((uint16_t)0x07C0U)            /*!< ethernet receive 1024 to max octet packets good bad register offset */
#define MMC_RX_UNICAST_PACKETS_GOOD_REG_OFFSET               ((uint16_t)0x07C4U)            /*!< ethernet receive unicast packets good register offset */
#define MMC_RX_LENGTH_ERROR_PACKETS_REG_OFFSET               ((uint16_t)0x07C8U)            /*!< ethernet receive length error packets register offset */
#define MMC_RX_OUT_OF_RANGE_TYPE_PACKETS_REG_OFFSET          ((uint16_t)0x07CCU)            /*!< ethernet receive out of range type packets register offset */
#define MMC_RX_PAUSE_PACKETS_REG_OFFSET                      ((uint16_t)0x07D0U)            /*!< ethernet receive pause packets register offset */
#define MMC_RX_FIFO_OVERFLOW_PACKETS_REG_OFFSET              ((uint16_t)0x07D4U)            /*!< ethernet receive fifo overflow packets register offset */
#define MMC_RX_VLAN_PACKETS_GOOD_BAD_REG_OFFSET              ((uint16_t)0x07D8U)            /*!< ethernet receive vlan packets good bad register offset */
#define MMC_RX_WATCHDOG_ERROR_PACKETS_REG_OFFSET             ((uint16_t)0x07DCU)            /*!< ethernet receive watchdog error packets register offset */
#define MMC_RX_ERROR_PACKETS_REG_OFFSET                      ((uint16_t)0x07E0U)            /*!< ethernet receive error packets register offset */
#define MMC_RX_CONTROL_PACKETS_GOOD_REG_OFFSET               ((uint16_t)0x07E4U)            /*!< ethernet receive control packets good register offset */

