sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define ENET_TX_LPI_USEC_CNTR_REG_OFFSET                     ((uint16_t)0x07ECU)            /*!< ethernet transmit LPI microseconds counter register offset */
#define ENET_TX_LPI_TRAN_CNTR_REG_OFFSET                     ((uint16_t)0x07F0U)            /*!< ethernet transmit LPI transition counter register offset */
#define ENET_RX_LPI_USEC_CNTR_REG_OFFSET                     ((uint16_t)0x07F4U)            /*!< ethernet receive LPI microseconds counter register offset */
#define ENET_RX_LPI_TRAN_CNTR_REG_OFFSET                     ((uint16_t)0x07F8U)            /*!< ethernet receive LPI transition counter register offset */
#define MMC_RXIPV4_GOOD_PACKETS_REG_OFFSET                   ((uint16_t)0x0810U)            /*!< ethernet receive ipv4 good packets register */
#define MMC_RXIPV4_HEADER_ERROR_PACKETS_REG_OFFSET           ((uint16_t)0x0814U)            /*!< ethernet receive ipv4 header error packets register */
#define MMC_RXIPV4_NO_PAYLOAD_PACKETS_REG_OFFSET             ((uint16_t)0x0818U)            /*!< ethernet receive ipv4 no payload packets register */
#define MMC_RXIPV4_FRAGMENTED_PACKETS_REG_OFFSET             ((uint16_t)0x081CU)            /*!< ethernet receive ipv4 fragmented packets register */
#define MMC_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_REG_OFFSET  ((uint16_t)0x0820U)            /*!< ethernet receive ipv4 udp checksum disabled packets register */
#define MMC_RXIPV6_GOOD_PACKETS_REG_OFFSET                   ((uint16_t)0x0824U)            /*!< ethernet receive ipv6 good packets register */
#define MMC_RXIPV6_HEADER_ERROR_PACKETS_REG_OFFSET           ((uint16_t)0x0828U)            /*!< ethernet receive ipv6 header error packets register */
#define MMC_RXIPV6_NO_PAYLOAD_PACKETS_REG_OFFSET             ((uint16_t)0x082CU)            /*!< ethernet receive ipv6 no payload packets register */
#define MMC_RXUDP_GOOD_PACKETS_REG_OFFSET                    ((uint16_t)0x0830U)            /*!< ethernet receive udp good packets register */
#define MMC_RXUDP_ERROR_PACKETS_REG_OFFSET                   ((uint16_t)0x0834U)            /*!< ethernet receive udp error packets register */
#define MMC_RXTCP_GOOD_PACKETS_REG_OFFSET                    ((uint16_t)0x0838U)            /*!< ethernet receive tcp good packets register */
#define MMC_RXTCP_ERROR_PACKETS_REG_OFFSET                   ((uint16_t)0x083CU)            /*!< ethernet receive tcp error packets register */
#define MMC_RXICMP_GOOD_PACKETS_REG_OFFSET                   ((uint16_t)0x0840U)            /*!< ethernet receive icmp good packets register */
#define MMC_RXICMP_ERROR_PACKETS_REG_OFFSET                  ((uint16_t)0x0844U)            /*!< ethernet receive icmp error packets register */
#define MMC_RXIPV4_GOOD_OCTETS_REG_OFFSET                    ((uint16_t)0x0850U)            /*!< ethernet receive ipv4 good octets register */
#define MMC_RXIPV4_HEADER_ERROR_OCTETS_REG_OFFSET            ((uint16_t)0x0854U)            /*!< ethernet receive ipv4 header error octets register */
#define MMC_RXIPV4_NO_PAYLOAD_OCTETS_REG_OFFSET              ((uint16_t)0x0858U)            /*!< ethernet receive ipv4 no payload octets register */
#define MMC_RXIPV4_FRAGMENTED_OCTETS_REG_OFFSET              ((uint16_t)0x085CU)            /*!< ethernet receive ipv4 fragmented octets register */
#define MMC_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS_REG_OFFSET   ((uint16_t)0x0860U)            /*!< ethernet receive ipv4 udp checksum disabled octets register */
#define MMC_RXIPV6_GOOD_OCTETS_REG_OFFSET                    ((uint16_t)0x0864U)            /*!< ethernet receive ipv6 good octets register */
#define MMC_RXIPV6_HEADER_ERROR_OCTETS_REG_OFFSET            ((uint16_t)0x0868U)            /*!< ethernet receive ipv6 header error octets register */
#define MMC_RXIPV6_NO_PAYLOAD_OCTETS_REG_OFFSET              ((uint16_t)0x086CU)            /*!< ethernet receive ipv6 no payload octets register */
#define MMC_RXUDP_GOOD_OCTETS_REG_OFFSET                     ((uint16_t)0x0870U)            /*!< ethernet receive udp good octets register */
#define MMC_RXUDP_ERROR_OCTETS_REG_OFFSET                    ((uint16_t)0x0874U)            /*!< ethernet receive udp error octets register */
#define MMC_RXTCP_GOOD_OCTETS_REG_OFFSET                     ((uint16_t)0x0878U)            /*!< ethernet receive tcp good octets register */
#define MMC_RXTCP_ERROR_OCTETS_REG_OFFSET                    ((uint16_t)0x087CU)            /*!< ethernet receive tcp error octets register */
#define MMC_RXICMP_GOOD_OCTETS_REG_OFFSET                    ((uint16_t)0x0880U)            /*!< ethernet receive icmp good octets register */
#define MMC_RXICMP_ERROR_OCTETS_REG_OFFSET                   ((uint16_t)0x0884U)            /*!< ethernet receive icmp error octets register */
#define MMC_MMC_FPE_TX_FRAGMENT_CNTR_REG_OFFSET              ((uint16_t)0x08A8U)            /*!< ethernet MMC FPE transmit fragment counter register */
#define MMC_MMC_TX_HOLD_REQ_CNTR_REG_OFFSET                  ((uint16_t)0x08ACU)            /*!< ethernet MMC FPE hold request counter register */
#define MMC_RX_PACKETS_ASSEMBLY_ERR_CNTR_REG_OFFSET          ((uint16_t)0x08C8U)            /*!< ethernet MMC receive packets assembly error counter register */
#define MMC_RX_PACKETS_SMD_ERR_CNTR_REG_OFFSET               ((uint16_t)0x08CCU)            /*!< ethernet MMC receive packets SMD error counter register */
#define MMC_RX_PACKETS_ASSEMBLY_OK_CNTR_REG_OFFSET           ((uint16_t)0x08D0U)            /*!< ethernet MMC receive packets assembly ok counter register */
#define MMC_RX_FPE_FRAGMENT_CNTR_REG_OFFSET                  ((uint16_t)0x08D4U)            /*!< ethernet MMC receive FPE fragment counter register */

#define MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET                 ((uint16_t)0x0800U)            /*!< MTL FPE transimit interrupts mask register offset */
#define MMC_IPC_RX_INTERRUPT_REG_OFFSET                      ((uint16_t)0x0808U)            /*!< MTL FPE transimit interrupts mask register offset */

#define MMC_FPE_TX_INTERRUPT_REG_OFFSET                      ((uint16_t)0x08A0U)            /*!< MMC transmit FPE fragment counter interrupt status register offset */
#define MMC_FPE_TX_INTERRUPT_MASK_REG_OFFSET                 ((uint16_t)0x08A4U)            /*!< MTL FPE transimit interrupts mask register offset */
#define MMC_FPE_RX_INTERRUPT_REG_OFFSET                      ((uint16_t)0x08C0U)            /*!< MMC receive packet assembly error counter interrupt register offset */
#define MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET                 ((uint16_t)0x08C4U)            /*!< MMC FPE receive interrupt mask register offset */
#define MTL_DBG_CTL_REG_OFFSET                               ((uint16_t)0x0C08U)            /*!<MTL debug control register offset */
#define MTL_INTERRUPT_STATUS_REG_OFFSET                      ((uint16_t)0x0C20U)            /*!< MTL interrupt status register offset */
#define MTL_EST_STATUS_REG_OFFSET                            ((uint16_t)0x0C58U)            /*!< MTL EST status register offset */
#define MTL_FPE_CTRL_STS_REG_OFFSET                          ((uint16_t)0x0C90U)            /*!< MTL FPE control status register offset */
#define MTL_RXP_CONTROL_STATUS_REG_OFFSET                    ((uint16_t)0x0CA0U)            /*!< MTL Rx parser control status register offset */
#define MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET          ((uint16_t)0x0CA4U)            /*!< MTL Rx parser control status register offset */
#define MTL_SAFETY_INTERRUPT_STATUS_REG_OFFSET               ((uint16_t)0x0CC4U)            /*!< MTL Rx parser control status register offset */
#define MTL_ECC_INTERRUPT_ENABLE_REG_OFFSET                  ((uint16_t)0x0CC8U)            /*!< MTL ECC interrupt enable register offset */
#define MTL_ECC_INTERRUPT_STATUS_REG_OFFSET                  ((uint16_t)0x0CCCU)            /*!< MTL ECC interrupt status register offset */
#define MTL_EST_INTERRUPT_ENABLE_REG_OFFSET                  ((uint16_t)0x0C70U)            /*!< MTL EST interrupts enable register offset */
#define MTL_TXQ0_UNDERFLOW_REG_OFFSET                        ((uint16_t)0x0D04U)            /*!< MTL transmit queue 0 underflow counter register offset */
#define MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET       ((uint16_t)0x0D34U)            /*!< MTL receive queue 0 missed frame overflow counter register offset */
#define MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET           ((uint16_t)0x0D2CU)            /*!< MTL queue 0 interrupts enable and status register offset */
#define MTL_TXQ1_UNDERFLOW_REG_OFFSET                        ((uint16_t)0x0D44U)            /*!< MTL transmit queue 1 underflow counter register offset */
#define MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET       ((uint16_t)0x0D74U)            /*!< MTL receive queue 1 missed frame overflow counter register offset */
#define MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET           ((uint16_t)0x0D6CU)            /*!< MTL queue 1 interrupts enable and status register offset */
#define DMA_INTERRUPT_STATUS_REG_OFFSET                      ((uint16_t)0x1008U)            /*!< DMA interrupt status register offset */
#define DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET               ((uint16_t)0x1080U)            /*!< DDMA safety interrupt status register offset */
#define DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET                  ((uint16_t)0x1134U)            /*!< DMA channel 0 interrupt enable register offset */
#define DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET                  ((uint16_t)0x11B4U)            /*!< DMA channel 1 interrupt enable register offset */

#define DMA_CH0_STATUS_REG_OFFSET           ((uint16_t)0x1160U)                             /*!< DMA channel 0 status register offset */
#define DMA_CH0_MISS_FRAME_CNT_REG_OFFSET   ((uint16_t)0x1164U)                             /*!< DMA channel 0 miss frame counter register offset */
#define DMA_CH0_RXP_ACCEPT_CNT_REG_OFFSET   ((uint16_t)0x1168U)                             /*!< DMA channel 0 receive parser accept counter register offset */
#define DMA_CH1_STATUS_REG_OFFSET           ((uint16_t)0x11E0U)                             /*!< DMA channel 1 status register offset */
#define DMA_CH1_MISS_FRAME_CNT_REG_OFFSET   ((uint16_t)0x11E4U)                             /*!< DMA channel 1 miss frame counter register offset */
#define DMA_CH1_RXP_ACCEPT_CNT_REG_OFFSET   ((uint16_t)0x11E8U)                             /*!< DMA channel 1 receive parser accept counter register offset */

/* define MAC address configuration and reference address */
#define ENET_SET_MACADDRH(p)                 (((uint32_t)(p)[5] << 8) | (uint32_t)(p)[4])
#define ENET_SET_MACADDRL(p)                 (((uint32_t)(p)[3] << 24) | ((uint32_t)(p)[2] << 16) | ((uint32_t)(p)[1] << 8) | (uint32_t)(p)[0])
#define ENET_SET_IPV4ADDR(p)                 (((uint32_t)(p)[3] << 24) | ((uint32_t)(p)[2] << 16) | ((uint32_t)(p)[1] << 8) | (uint32_t)(p)[0])
#define ENET_SET_IPV6ADDR(p)                 (((uint32_t)(p)[3] << 24) | ((uint32_t)(p)[2] << 16) | ((uint32_t)(p)[1] << 8) | (uint32_t)(p)[0])
#define ENET_ADDRH_BASE                      ((ENET) + 0x300U)
#define ENET_ADDRL_BASE                      ((ENET) + 0x304U)
#define ENET_GET_MACADDR(offset, n)          ((uint8_t)((REG32((ENET_ADDRL_BASE + (offset)) - (((n) / 4U) * 4U)) >> (8U * ((n) % 4U))) & 0xFFU))

