sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
typedef enum {
    CVLAN = 0U,         /*!< C-VLAN */
    SVLAN = 1U          /*!< S-VLAN */
} enet_vlantype_enum;

/* ENET status flag get */
typedef enum {
    /* MAC_RX_TX_STATUS register */
    ENET_MAC_RX_TX_STATUS_FLAG_TJT                   = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 0U),         /*!< transmit jabber timeout status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_NCARR                 = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 1U),         /*!< no carrier status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_LCARR                 = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 2U),         /*!< loss of carrier status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_EXDEF                 = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 3U),         /*!< excessive deferral status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_LCOL                  = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 4U),         /*!< late collision status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_EXCOL                 = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 5U),         /*!< excessive collisions status flag */
    ENET_MAC_RX_TX_STATUS_FLAG_RWT                   = ENET_REGIDX_BIT(MAC_RX_TX_STATUS_REG_OFFSET, 8U),         /*!< receive watchdog timeout status flag */
    
    /* MAC_PMT_CONTROL_STATUS register */
    ENET_MAC_PMT_CONTROL_STATUS_FLAG_MGKPRCVD        = ENET_REGIDX_BIT(MAC_PMT_CONTROL_STATUS_REG_OFFSET, 5U),   /*!< magic packet received flag */
    ENET_MAC_PMT_CONTROL_STATUS_FLAG_RWKPRCVD        = ENET_REGIDX_BIT(MAC_PMT_CONTROL_STATUS_REG_OFFSET, 6U),   /*!< remote wake-pp packet received flag */
    
    /* MAC_LPI_CONTROL_STATUS register */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIEN          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 0U),   /*!< transmit LPI entry flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIEX          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 1U),   /*!< transmit LPI exit flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIEN          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 2U),   /*!< receive LPI entry flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIEX          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 3U),   /*!< receive LPI exit flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_TLPIST          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 8U),   /*!< transmit LPI state flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_RLPIST          = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 9U),   /*!< receive LPI state flag */
    ENET_MAC_LPI_CONTROL_STATUS_FLAG_PLS             = ENET_REGIDX_BIT(MAC_LPI_CONTROL_STATUS_REG_OFFSET, 17U),  /*!< PHY link status flag */
    
    /* MAC_FPE_CTRL_STS register */
    ENET_MAC_FPE_CTRL_STS_FLAG_RVER                  = ENET_REGIDX_BIT(MAC_FPE_CTRL_STS_REG_OFFSET, 16U),        /*!< received verify frame flag */
    ENET_MAC_FPE_CTRL_STS_FLAG_RRSP                  = ENET_REGIDX_BIT(MAC_FPE_CTRL_STS_REG_OFFSET, 17U),        /*!< received respond frame flag */
    ENET_MAC_FPE_CTRL_STS_FLAG_TVER                  = ENET_REGIDX_BIT(MAC_FPE_CTRL_STS_REG_OFFSET, 18U),        /*!< transmitted verify frame flag */
    ENET_MAC_FPE_CTRL_STS_FLAG_TRSP                  = ENET_REGIDX_BIT(MAC_FPE_CTRL_STS_REG_OFFSET, 19U),        /*!< transmitted respond frame flag */
    
    /* MAC_TIMESTAMP_STATUS register */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSSOVF            = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 0U),     /*!< timestamp seconds overflow flag */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT0          = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 1U),     /*!< timestamp target time reached flag for target time PPS0 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR0        = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 3U),     /*!< timestamp target time error flag for target time PPS0 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT1          = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 4U),     /*!< timestamp target time reached flag for target time PPS1 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR1        = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 5U),     /*!< timestamp target time error flag for target time PPS1 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT2          = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 6U),     /*!< timestamp target time reached flag for target time PPS2 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR2        = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 7U),     /*!< timestamp target time error flag for target time PPS2 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTARGT3          = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 8U),     /*!< timestamp target time reached flag for target time PPS3 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TSTRGTERR3        = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 9U),     /*!< timestamp target time error flag for target time PPS3 */
    ENET_MAC_TIMESTAMP_STATUS_FLAG_TXTSSIS           = ENET_REGIDX_BIT(MAC_TIMESTAMP_STATUS_REG_OFFSET, 15U),    /*!< Tx timestamp status interrupt status flag */
    
    /* MAC_TX_TIMESTAMP_STATUS_NANOSECONDS register */
    ENET_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_FLAG_TXTSSMIS  = ENET_REGIDX_BIT(MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_REG_OFFSET, 31U),    /*!< transmit timestamp status missed status flag */
    
    /* MTL_DBG_STS register */
    ENET_MTL_DBG_STS_FLAG_PKTI                       = ENET_REGIDX_BIT(MTL_DBG_CTL_REG_OFFSET, 8U),         /*!< receive packet available interrupt status flag */
    ENET_MTL_DBG_STS_FLAG_STSI                       = ENET_REGIDX_BIT(MTL_DBG_CTL_REG_OFFSET, 9U),         /*!< transmit status available interrupt status flag */
    /* MTL_EST_STATUS register */
    ENET_MTL_EST_STATUS_FLAG_SWLC                    = ENET_REGIDX_BIT(MTL_EST_STATUS_REG_OFFSET, 0U),         /*!< switch to S/W owned list complete flag */
    ENET_MTL_EST_STATUS_FLAG_BTRE                    = ENET_REGIDX_BIT(MTL_EST_STATUS_REG_OFFSET, 1U),         /*!< BTR error flag */
    ENET_MTL_EST_STATUS_FLAG_HLBF                    = ENET_REGIDX_BIT(MTL_EST_STATUS_REG_OFFSET, 2U),         /*!< Head-Of-Line blocking due to frame size flag */
    ENET_MTL_EST_STATUS_FLAG_HLBS                    = ENET_REGIDX_BIT(MTL_EST_STATUS_REG_OFFSET, 3U),         /*!< Head-Of-Line blocking due to scheduling flag */
    ENET_MTL_EST_STATUS_FLAG_CGCE                    = ENET_REGIDX_BIT(MTL_EST_STATUS_REG_OFFSET, 4U),         /*!< constant gate control error flag */
    /* MTL_FPE_CTRL_STS register */
    ENET_MTL_FPE_CTRL_STS_FLAG_HRS                   = ENET_REGIDX_BIT(MTL_FPE_CTRL_STS_REG_OFFSET, 28U),        /*!< hold/release status flag */
    /* MTL_RXP_CONTROL_STATUS register */
    ENET_MTL_RXP_CONTROL_STATUS_FLAG_RXPI            = ENET_REGIDX_BIT(MTL_FPE_CTRL_STS_REG_OFFSET, 31U),        /*!< RX parser in idle state flag */
    /* MTL_TXQ0_UNDERFLOW_REG_OFFSET register */
    ENET_MTL_TXQ0_UNDERFLOW_FLAG_UFCNTOVF            = ENET_REGIDX_BIT(MTL_TXQ0_UNDERFLOW_REG_OFFSET, 11U),        /*!< underflow packet counter overflow flag */
    /* MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET register */
    ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_FLAG_OVFCNTOVF  = ENET_REGIDX_BIT(MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET, 11U),        /*!< overflow counter overflow flag */
    ENET_MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_FLAG_MISCNTOVF  = ENET_REGIDX_BIT(MTL_RXQ0_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET, 27U),        /*!< missed packet counter overflow flag */
    /* MTL_TXQ0_UNDERFLOW_REG_OFFSET register */
    ENET_MTL_TXQ1_UNDERFLOW_FLAG_UFCNTOVF            = ENET_REGIDX_BIT(MTL_TXQ1_UNDERFLOW_REG_OFFSET, 11U),        /*!< underflow packet counter overflow flag */
    /* MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET register */
    ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_FLAG_OVFCNTOVF  = ENET_REGIDX_BIT(MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET, 11U),        /*!< overflow counter overflow flag */
    ENET_MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_FLAG_MISCNTOVF  = ENET_REGIDX_BIT(MTL_RXQ1_MISSED_PACKET_OVERFLOW_CNT_REG_OFFSET, 27U),        /*!< missed packet counter overflow flag */
    /* DMA_CH0_STATUS register */
    ENET_DMA_CH0_FLAG_TI            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 0U),     /*!< channel 0 transmit status flag */
    ENET_DMA_CH0_FLAG_TPS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 1U),     /*!< channel 0 transmit process stopped status flag */
    ENET_DMA_CH0_FLAG_TBU           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 2U),     /*!< channel 0 transmit buffer unavailable status flag */
    ENET_DMA_CH0_FLAG_RI            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 6U),     /*!< channel 0 receive status flag */
    ENET_DMA_CH0_FLAG_RBU           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 7U),     /*!< channel 0 receive buffer unavailable status flag */
    ENET_DMA_CH0_FLAG_RPS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 8U),     /*!< channel 0 receive process stopped status flag */
    ENET_DMA_CH0_FLAG_RWT           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 9U),     /*!< channel 0 receive watchdog timeout status flag */
    ENET_DMA_CH0_FLAG_ETI           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 10U),    /*!< channel 0 early transmit status flag */
    ENET_DMA_CH0_FLAG_ERIE          = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 11U),    /*!< channel 0 early receive status flag */
    ENET_DMA_CH0_FLAG_FBE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 12U),    /*!< channel 0 fatal bus error status flag */
    ENET_DMA_CH0_FLAG_CDE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 13U),    /*!< channel 0 context descriptor error status flag */
    ENET_DMA_CH0_FLAG_AIE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 14U),    /*!< channel 0 abnormal interrupt summary flag */
    ENET_DMA_CH0_FLAG_NIS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 15U),    /*!< channel 0 normal interrupt summary flag */
    /* DMA_CH0_MISS_FRAME_CNT register */
    ENET_DMA_CH0_MISS_FRAME_CNT_FLAG_MFCO       = ENET_REGIDX_BIT(DMA_CH0_MISS_FRAME_CNT_REG_OFFSET, 15U),     /*!< overflow status of the MFC counter flag */
    /* DMA_CH1_MISS_FRAME_CNT register */
    ENET_DMA_CH0_RXP_ACCEPT_CNT_FLAG_RXPACOF    = ENET_REGIDX_BIT(DMA_CH0_RXP_ACCEPT_CNT_REG_OFFSET, 31U),     /*!< Rx parser accept counter overflow flag */
    /* DMA_CH1_STATUS register */
    ENET_DMA_CH1_FLAG_TI            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 0U),     /*!< channel 1 transmit status flag */
    ENET_DMA_CH1_FLAG_TPS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 1U),     /*!< channel 1 transmit process stopped status flag */
    ENET_DMA_CH1_FLAG_TBU           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 2U),     /*!< channel 1 transmit buffer unavailable status flag */
    ENET_DMA_CH1_FLAG_RI            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 6U),     /*!< channel 1 receive status flag */
    ENET_DMA_CH1_FLAG_RBU           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 7U),     /*!< channel 1 receive buffer unavailable status flag */
    ENET_DMA_CH1_FLAG_RPS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 8U),     /*!< channel 1 receive process stopped status flag */
    ENET_DMA_CH1_FLAG_RWT           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 9U),     /*!< channel 1 receive watchdog timeout status flag */
    ENET_DMA_CH1_FLAG_ETI           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 10U),    /*!< channel 1 early transmit status flag */
    ENET_DMA_CH1_FLAG_ERIE          = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 11U),    /*!< channel 1 early receive status flag */
    ENET_DMA_CH1_FLAG_FBE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 12U),    /*!< channel 1 fatal bus error status flag */
    ENET_DMA_CH1_FLAG_CDE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 13U),    /*!< channel 1 context descriptor error status flag */
    ENET_DMA_CH1_FLAG_AIE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 14U),    /*!< channel 1 abnormal interrupt summary flag */
    ENET_DMA_CH1_FLAG_NIS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 15U),    /*!< channel 1 normal interrupt summary flag */
    /* DMA_CH1_MISS_FRAME_CNT register */
    ENET_DMA_CH1_MISS_FRAME_CNT_FLAG_MFCO       = ENET_REGIDX_BIT(DMA_CH1_MISS_FRAME_CNT_REG_OFFSET, 15U),     /*!< overflow status of the MFC counter flag */
    /* DMA_CH1_MISS_FRAME_CNT register */
    ENET_DMA_CH1_RXP_ACCEPT_CNT_FLAG_RXPACOF    = ENET_REGIDX_BIT(DMA_CH1_RXP_ACCEPT_CNT_REG_OFFSET, 31U),     /*!< Rx parser accept counter overflow flag */
}enet_flag_enum;

/* ENET stutus flag clear */
typedef enum
{
    /* MTL_EST_STATUS register */
    ENET_MTL_EST_STATUS_FLAG_CGCE_CLR                    = ENET_REGIDX_BIT(MAC_FPE_CTRL_STS_REG_OFFSET, 4U),         /*!< constant gate control error flag */
    /* MTL_DBG_STS register */
    ENET_MTL_DBG_STS_FLAG_PKTI_CLR      = ENET_REGIDX_BIT(MTL_DBG_CTL_REG_OFFSET, 8U),    /*!< receive packet available interrupt status flag */
    ENET_MTL_DBG_STS_FLAG_STSI_CLR      = ENET_REGIDX_BIT(MTL_DBG_CTL_REG_OFFSET, 9U),    /*!< transmit status available interrupt status flag */
    /* DMA_CH0_STATUS register */
    ENET_DMA_CH0_FLAG_TI_CLR            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 0U),     /*!< channel 0 transmit status flag */
    ENET_DMA_CH0_FLAG_TPS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 1U),     /*!< channel 0 transmit process stopped status flag */
    ENET_DMA_CH0_FLAG_TBU_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 2U),     /*!< channel 0 transmit buffer unavailable status flag */
    ENET_DMA_CH0_FLAG_RI_CLR            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 6U),     /*!< channel 0 receive status flag */
    ENET_DMA_CH0_FLAG_RBU_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 7U),     /*!< channel 0 receive buffer unavailable status flag */
    ENET_DMA_CH0_FLAG_RPS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 8U),     /*!< channel 0 receive process stopped status flag */
    ENET_DMA_CH0_FLAG_RWT_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 9U),     /*!< channel 0 receive watchdog timeout status flag */
    ENET_DMA_CH0_FLAG_ETI_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 10U),    /*!< channel 0 early transmit status flag */
    ENET_DMA_CH0_FLAG_ERIE_CLR          = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 11U),    /*!< channel 0 early receive status flag */
    ENET_DMA_CH0_FLAG_FBE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 12U),    /*!< channel 0 fatal bus error status flag */
    ENET_DMA_CH0_FLAG_CDE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 13U),    /*!< channel 0 context descriptor error status flag */
    ENET_DMA_CH0_FLAG_AIE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 14U),    /*!< channel 0 abnormal interrupt summary flag */
    ENET_DMA_CH0_FLAG_NIS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 15U),    /*!< channel 0 normal interrupt summary flag */
    /* DMA_CH1_STATUS register */
    ENET_DMA_CH1_FLAG_TI_CLR            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 0U),     /*!< channel 1 transmit status flag */
    ENET_DMA_CH1_FLAG_TPS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 1U),     /*!< channel 1 transmit process stopped status flag */
    ENET_DMA_CH1_FLAG_TBU_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 2U),     /*!< channel 1 transmit buffer unavailable status flag */
    ENET_DMA_CH1_FLAG_RI_CLR            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 6U),     /*!< channel 1 receive status flag */
    ENET_DMA_CH1_FLAG_RBU_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 7U),     /*!< channel 1 receive buffer unavailable status flag */
    ENET_DMA_CH1_FLAG_RPS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 8U),     /*!< channel 1 receive process stopped status flag */
    ENET_DMA_CH1_FLAG_RWT_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 9U),     /*!< channel 1 receive watchdog timeout status flag */
    ENET_DMA_CH1_FLAG_ETI_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 10U),    /*!< channel 1 early transmit status flag */
    ENET_DMA_CH1_FLAG_ERIE_CLR          = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 11U),    /*!< channel 1 early receive status flag */
    ENET_DMA_CH1_FLAG_FBE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 12U),    /*!< channel 1 fatal bus error status flag */
    ENET_DMA_CH1_FLAG_CDE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 13U),    /*!< channel 1 context descriptor error status flag */
    ENET_DMA_CH1_FLAG_AIE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 14U),    /*!< channel 1 abnormal interrupt summary flag */
    ENET_DMA_CH1_FLAG_NIS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 15U),    /*!< channel 1 normal interrupt summary flag */
} enet_flag_clear_enum;

