sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* ENET interrupt enable/disable */
typedef enum
{
    /* MAC_INTERRUPT_ENABLE register */
    ENET_MAC_INT_PHYIE              = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 3U),    /*!< PHY interrupt enable */
    ENET_MAC_INT_PMTIE              = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 4U),    /*!< PMT interrupt enable */
    ENET_MAC_INT_LPIIE              = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 5U),    /*!< LPI interrupt enable */
    ENET_MAC_INT_TSIE               = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 12U),   /*!< timestamp interrupt enable */
    ENET_MAC_INT_TXSTSIE            = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 13U),   /*!< transmit status interrupt enable */
    ENET_MAC_INT_RXSTSIE            = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 14U),   /*!< receive status interrupt enable */
    ENET_MAC_INT_FPEIE              = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 17U),   /*!< frame preemption interrupt enable */
    ENET_MAC_INT_MDIOIE             = ENET_REGIDX_BIT(MAC_INTERRUPT_ENABLE_REG_OFFSET, 18U),   /*!< MDIO interrupt enable */
    
    /* MMC_RX_INTERRUPT_MASK register */
    ENET_MMC_RX_INT_RXGBPKTIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 0U),                 /*!< MMC receive good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RXGBOCTIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 1U),                 /*!< MMC receive good bad octet counter interrupt mask */
    ENET_MMC_RX_INT_RXGOCTIM     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 2U),                 /*!< MMC receive good octet counter interrupt mask */
    ENET_MMC_RX_INT_RXBCGPIM     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 3U),                 /*!< MMC receive broadcast good packet counter interrupt mask */
    ENET_MMC_RX_INT_RXMCGPIM     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 4U),                 /*!< MMC receive multicast good packet counter interrupt mask */
    ENET_MMC_RX_INT_RXCRCERPIM   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 5U),                 /*!< MMC receive crc error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXALGNERPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 6U),                 /*!< MMC receive alignment error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXRUNTPIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 7U),                 /*!< MMC receive runt packet counter interrupt mask */
    ENET_MMC_RX_INT_RXJABERPIM   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 8U),                 /*!< MMC receive jabber error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXUSIZEGPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 9U),                 /*!< MMC receive undersize good packet counter interrupt mask */
    ENET_MMC_RX_INT_RXOSIZEGPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 10U),                /*!< MMC receive oversize good packet counter interrupt mask */
    ENET_MMC_RX_INT_RX64OCTGBPIM = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 11U),                /*!< MMC receive 64 octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RX65T127OCTGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 12U),           /*!< MMC receive 65 to 127 octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RX128T255OCTGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 13U),          /*!< MMC receive 128 to 255 octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RX256T511OCTGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 14U),          /*!< MMC receive 256 to 511 octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RX512T1023OCTGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 15U),         /*!< MMC receive 512 to 1023 octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RX1024TMAXOCTGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 16U),         /*!< MMC receive 1024 to maximum octet good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RXUCGPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 17U),                   /*!< MMC receive unicast good packet counter interrupt mask */
    ENET_MMC_RX_INT_RXLENERPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 18U),                 /*!< MMC receive length error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXORANGEPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 19U),                /*!< MMC receive out of range error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXPAUSPIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 20U),                /*!< MMC receive pause counter interrupt mask */
    ENET_MMC_RX_INT_RXFOVPIM     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 21U),                /*!< MMC receive FIFO overflow packet counter interrupt mask */
    ENET_MMC_RX_INT_RXVLANGBPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 22U),                /*!< MMC receive VLAN good bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RXWDOGPIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 23U),                /*!< MMC receive watchdog error bad packet counter interrupt mask */
    ENET_MMC_RX_INT_RXRCVERRPIM  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 24U),                /*!< MMC receive error packet counter interrupt mask */
    ENET_MMC_RX_INT_RXCTRLPIM    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 25U),                /*!< MMC receive control packet counter interrupt mask */
    ENET_MMC_RX_INT_RXLPIUSCIM   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 26U),                /*!< MMC receive LPI microsecond counter interrupt mask */
    ENET_MMC_RX_INT_RXLPITRCIM   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_MASK_REG_OFFSET, 27U),                /*!< MMC receive LPI transition counter interrupt mask */
    
    /* MMC_TX_INTERRUPT_MASK register */
    ENET_MMC_TX_INT_TXGBOCTIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 0U),                 /*!< MMC transmit good bad octet counter interrupt mask */
    ENET_MMC_TX_INT_TXGBPKTIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 1U),                 /*!< MMC transmit good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TXBCGPIM     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 2U),                 /*!< MMC transmit broadcast good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXMCGPIM     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 3U),                 /*!< MMC transmit multicast good packet counter interrupt mask */
    ENET_MMC_TX_INT_TX64OCTGBPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 4U),                /*!< MMC transmit 64 Octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TX65T127OCTGBPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 5U),            /*!< MMC transmit 65 to 127 octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TX128T255OCTGBPIM = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 6U),            /*!< MMC transmit 128 to 255 octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TX256T511OCTGBPIM = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 7U),            /*!< MMC transmit 256 to 511 octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TX512T1023OCTGBPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 8U),          /*!< MMC transmit 512 to 1023 octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TX1024TMAXOCTGBPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 9U),          /*!< MMC transmit 1024 to maximum octet good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TXUCGBPIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 10U),                /*!< MMC transmit unicast good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TXMCGBPIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 11U),                /*!< MMC transmit multicast good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TXBCGBPIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 12U),                /*!< MMC transmit broadcast good bad packet counter interrupt mask */
    ENET_MMC_TX_INT_TXUFLOWERPIM = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 13U),                /*!< MMC transmit underflow error packet counter interrupt mask */
    ENET_MMC_TX_INT_TXSCOLGPIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 14U),                /*!< MMC transmit single collision good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXMCOLGPIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 15U),                /*!< MMC transmit multiple collision good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXDEFPIM     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 16U),                /*!< MMC transmit deferred packet counter interrupt mask */
    ENET_MMC_TX_INT_TXLATCOLPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 17U),                /*!< MMC transmit late collision packet counter interrupt mask */
    ENET_MMC_TX_INT_TXEXCOLPIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 18U),                /*!< MMC transmit excessive collision packet counter interrupt mask */
    ENET_MMC_TX_INT_TXCARERPIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 19U),                /*!< MMC transmit carrier error packet counter interrupt mask */
    ENET_MMC_TX_INT_TXGOCTIM     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 20U),                /*!< MMC transmit good octet counter interrupt mask */
    ENET_MMC_TX_INT_TXGPKTIM     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 21U),                /*!< MMC transmit good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXEXDEFPIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 22U),                /*!< MMC transmit excessive deferral packet counter interrupt mask */
    ENET_MMC_TX_INT_TXPAUSPIM    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 24U),                /*!< MMC transmit VLAN good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXOSIZEGPIM  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 25U),                /*!< MMC transmit oversize good packet counter interrupt mask */
    ENET_MMC_TX_INT_TXLPIUSCIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 26U),                /*!< MMC transmit LPI microsecond counter interrupt mask */
    ENET_MMC_TX_INT_TXLPITRCIM   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_MASK_REG_OFFSET, 27U),                /*!< MMC transmit LPI transition counter interrupt mask */
    
