sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
    /* MMC_IPC_RX_INTERRUPT_MASK register */
    ENET_MMC_IPC_RX_INT_RXIPV4GPIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 0U),      /*!< MMC receive IPV4 good packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4HERPIM    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 1U),      /*!< MMC receive IPV4 header error packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4NOPAYPIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 2U),      /*!< MMC receive IPV4 no payload packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4FRAGPIM   = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 3U),      /*!< MMC receive IPV4 fragmented packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4UDSBLPIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 4U),      /*!< MMC receive IPV4 UDP checksum disabled packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6GPIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 5U),      /*!< MMC receive IPV6 good packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6HERPIM    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 6U),      /*!< MMC receive IPV6 header error packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6NOPAYPIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 7U),      /*!< MMC receive IPV6 no payload packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXUDPGPIM       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 8U),      /*!< MMC receive UDP good packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXUDPERPIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 9U),      /*!< MMC receive UDP error packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXTCPGPIM       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 10U),     /*!< MMC receive TCP good packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXTCPERPIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 11U),     /*!< MMC receive TCP error packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXICMPGPIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 12U),     /*!< MMC receive ICMP good packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXICMPERPIM     = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 13U),     /*!< MMC receive ICMP error packet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4GOIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 16U),      /*!< MMC receive IPV4 good octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4HEROIM    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 17U),      /*!< MMC receive IPV4 header error octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4NOPAYOIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 18U),      /*!< MMC receive IPV4 no payload octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4FRAGOIM   = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 19U),      /*!< MMC receive IPV4 fragmented octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV4UDSBLOIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 20U),      /*!< MMC receive IPV4 UDP checksum disabled octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6GOIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 21U),      /*!< MMC receive IPV6 good octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6HEROIM    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 22U),      /*!< MMC receive IPV6 header error octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXIPV6NOPAYOIM  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 23U),      /*!< MMC receive IPV6 no payload octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXUDPGOIM       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 24U),      /*!< MMC receive UDP good octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXUDPEROIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 25U),      /*!< MMC receive UDP error octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXTCPGOIM       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 26U),      /*!< MMC receive TCP good octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXTCPEROIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 27U),      /*!< MMC receive TCP error octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXICMPGOIM      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 28U),      /*!< MMC receive ICMP good octet counter interrupt mask */
    ENET_MMC_IPC_RX_INT_RXICMPEROIM     = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_MASK_REG_OFFSET, 29U),      /*!< MMC receive ICMP error octet counter interrupt mask */
    
    /* MMC_FPE_TX_INTERRUPT_MASK register */
    ENET_MMC_FPE_TX_INT_FCIM            = ENET_REGIDX_BIT(MMC_FPE_TX_INTERRUPT_MASK_REG_OFFSET, 0U),       /*!< MMC Tx FPE fragment counter interrupt mask */
    ENET_MMC_FPE_TX_INT_HRCIM           = ENET_REGIDX_BIT(MMC_FPE_TX_INTERRUPT_MASK_REG_OFFSET, 1U),       /*!< MMC Tx hold request counter interrupt mask */
    
    /* MMC_FPE_TX_INTERRUPT_MASK register */
    ENET_MMC_FPE_RX_INT_PAECIM          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET, 0U),       /*!< MMC Rx packet assembly error counter interrupt mask */
    ENET_MMC_FPE_RX_INT_PSECIM          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET, 1U),       /*!< MMC Rx packet SMD error counter interrupt mask */
    ENET_MMC_FPE_RX_INT_PAOCIM          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET, 2U),       /*!< MMC Rx packet assembly OK counter interrupt mask */
    ENET_MMC_FPE_RX_INT_FCIM            = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_MASK_REG_OFFSET, 3U),       /*!< MMC Rx FPE fragment counter interrupt mask */
    
    
    /* MTL_EST_INTERRUPT_ENABLE register */ 
    ENET_MTL_EST_INT_CGCEIE         = ENET_REGIDX_BIT(MTL_EST_INTERRUPT_ENABLE_REG_OFFSET, 4U), /*!< the constant gate control error interrupt enable */
    ENET_MTL_EST_INT_IEHSIE         = ENET_REGIDX_BIT(MTL_EST_INTERRUPT_ENABLE_REG_OFFSET, 3U), /*!< interrupt enable for HLBS */
    ENET_MTL_EST_INT_IEHFIE         = ENET_REGIDX_BIT(MTL_EST_INTERRUPT_ENABLE_REG_OFFSET, 2U), /*!< interrupt enable for HLBF */
    ENET_MTL_EST_INT_IEBEIE         = ENET_REGIDX_BIT(MTL_EST_INTERRUPT_ENABLE_REG_OFFSET, 1U), /*!< interrupt enable for BTR error */
    ENET_MTL_EST_INT_IECCIE         = ENET_REGIDX_BIT(MTL_EST_INTERRUPT_ENABLE_REG_OFFSET, 0U), /*!< interrupt enable for switch enable */
    /* MTL_RXP_INTERRUPT_CONTROL_STATUS register */ 
    ENET_MTL_RXP_INT_NVEOVIE        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 16U), /*!< number of valid entries overflow interrupt enable */
    ENET_MTL_RXP_INT_NPEOVIE        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 17U), /*!< number of parsable entries overflow interrupt enable */
    ENET_MTL_RXP_INT_FOOVIE         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 18U), /*!< frame offset overflow interrupt enable */
    ENET_MTL_RXP_INT_PDRFIE         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 19U), /*!< packet drop due to RF interrupt enable */
    
    /* MTL_ECC_INTERRUPT_ENABLE register */ 
    ENET_MTL_ECC_INT_RPCEIE         = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_ENABLE_REG_OFFSET, 12U), /*!< Rx parser memory correctable error interrupt enable */
    ENET_MTL_ECC_INT_ECEIE          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_ENABLE_REG_OFFSET, 8U), /*!< EST memory correctable error interrupt enable */
    ENET_MTL_ECC_INT_RXCEIE         = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_ENABLE_REG_OFFSET, 4U), /*!< Rx memory correctable error interrupt enable */
    ENET_MTL_ECC_INT_TXCEIE         = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_ENABLE_REG_OFFSET, 0U), /*!< Tx memory correctable error interrupt enable */
    /* MTL_Q0_INTERRUPT_CONTROL_STATUS register */
    ENET_MTL_Q0_INT_RXOIE           = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 24U), /*!< receive queue 0 overflow interrupt enable */
    ENET_MTL_Q0_INT_ABPSIE          = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 9U), /*!< queue 0 average bits per slot interrupt enable */
    ENET_MTL_Q0_INT_TXUIE           = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 8U), /*!< transmit queue 0 underflow interrupt enable */
    /* MTL_Q1_INTERRUPT_CONTROL_STATUS register */
    ENET_MTL_Q1_INT_RXOIE           = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 24U), /*!< receive queue 1 overflow interrupt enable */
    ENET_MTL_Q1_INT_ABPSIE          = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 9U), /*!< queue 1 average bits per slot interrupt enable */
    ENET_MTL_Q1_INT_TXUIE           = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 8U), /*!< transmit queue 1 underflow interrupt enable */
    /* DMA_CH0_INTERRRUPT_ENABLE register */
    ENET_DMA_CH0_INT_TIE                = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 0U),    /*!< channel 0 transmit interrupt enable */
    ENET_DMA_CH0_INT_TXSEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 1U),    /*!< channel 0 transmit process stopped interrupt enable */
    ENET_DMA_CH0_INT_TBUEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 2U),    /*!< channel 0 transmit buffer unavailable interrupt enable */
    ENET_DMA_CH0_INT_RIE                = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 6U),    /*!< channel 0 receive interrupt enable */
    ENET_DMA_CH0_INT_RBUEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 7U),    /*!< channel 0 receive buffer unavailable interrupt enable */
    ENET_DMA_CH0_INT_RSEIE              = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 8U),    /*!< channel 0 receive process stopped interrupt enable */
    ENET_DMA_CH0_INT_RWTEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 9U),    /*!< channel 0 receive watchdog timeout interrupt enable */
    ENET_DMA_CH0_INT_ETIE               = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 10U),   /*!< channel 0 early transmit interrupt enable */
    ENET_DMA_CH0_INT_ERIE               = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 11U),   /*!< channel 0 early receive interrupt enable */
    ENET_DMA_CH0_INT_FBEEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 12U),   /*!< channel 0 fatal bus error interrupt enable */
    ENET_DMA_CH0_INT_CDEEIE             = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 13U),   /*!< channel 0 the descriptor error interrupt enable */
    ENET_DMA_CH0_INT_AIE                = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 14U),   /*!< channel 0 abnormal interrupt summary enable */
    ENET_DMA_CH0_INT_NIE                = ENET_REGIDX_BIT(DMA_CH0_INTERRUPT_ENABLE_REG_OFFSET, 15U),   /*!< channel 0 normal interrupt summary enable */
    /* DMA_CH1_INTERRRUPT_ENABLE register */
    ENET_DMA_CH1_INT_TIE                = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 0U),    /*!< channel 1 transmit interrupt enable */
    ENET_DMA_CH1_INT_TXSEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 1U),    /*!< channel 1 transmit process stopped interrupt enable */
    ENET_DMA_CH1_INT_TBUEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 2U),    /*!< channel 1 transmit buffer unavailable interrupt enable */
    ENET_DMA_CH1_INT_RIE                = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 6U),    /*!< channel 1 receive interrupt enable */
    ENET_DMA_CH1_INT_RBUEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 7U),    /*!< channel 1 receive buffer unavailable interrupt enable */
    ENET_DMA_CH1_INT_RSEIE              = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 8U),    /*!< channel 1 receive process stopped interrupt enable */
    ENET_DMA_CH1_INT_RWTEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 9U),    /*!< channel 1 receive watchdog timeout interrupt enable */
    ENET_DMA_CH1_INT_ETIE               = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 10U),   /*!< channel 1 early transmit interrupt enable */
    ENET_DMA_CH1_INT_ERIE               = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 11U),   /*!< channel 1 early receive interrupt enable */
    ENET_DMA_CH1_INT_FBEEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 12U),   /*!< channel 1 fatal bus error interrupt enable */
    ENET_DMA_CH1_INT_CDEEIE             = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 13U),   /*!< channel 1 the descriptor error interrupt enable */
    ENET_DMA_CH1_INT_AIE                = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 14U),   /*!< channel 1 abnormal interrupt summary enable */
    ENET_DMA_CH1_INT_NIE                = ENET_REGIDX_BIT(DMA_CH1_INTERRUPT_ENABLE_REG_OFFSET, 15U),   /*!< channel 1 normal interrupt summary enable */
} enet_int_enum;

/* ENET interrupt flag get */
typedef enum
{
    /* MAC_INTERRUPT_STATUS register */
    ENET_MAC_INT_FLAG_PHYIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 3U),     /*!< PHY interrupt status flag */
    ENET_MAC_INT_FLAG_PMTIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 4U),     /*!< PMT interrupt status flag */
    ENET_MAC_INT_FLAG_LPIIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 5U),     /*!< LPI Interrupt status flag */
    ENET_MAC_INT_FLAG_MMCIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 8U),     /*!< MMC Interrupt status flag */
    ENET_MAC_INT_FLAG_MMCRXIS         = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 9U),     /*!< MMC receive interrupt status flag */
    ENET_MAC_INT_FLAG_MMCTXIS         = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 10U),    /*!< MMC transmit interrupt status flag */
    ENET_MAC_INT_FLAG_MMCRXIPIS       = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 11U),    /*!< MMC receive checksum offload interrupt status flag */
    ENET_MAC_INT_FLAG_TSIS            = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 12U),    /*!< timestamp interrupt status flag */
    ENET_MAC_INT_FLAG_TXSTSIS         = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 13U),    /*!< transmit status flag */
    ENET_MAC_INT_FLAG_RXSTSIS         = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 14U),    /*!< receive status interrupt flag */
    ENET_MAC_INT_FLAG_FPEIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 17U),    /*!< frame preemption interrupt status flag */
    ENET_MAC_INT_FLAG_MDIOIS          = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 18U),    /*!< MDIO interrupt status flag */
    ENET_MAC_INT_FLAG_MFTIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 19U),    /*!< MMC FPE transmit interrupt status flag */
    ENET_MAC_INT_FLAG_MFEIS           = ENET_REGIDX_BIT(MAC_INTERRUPT_STATUS_REG_OFFSET, 20U),    /*!< MMC FPE receive Interrupt status flag */
    
