sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
    /* MAC_DPP_FSM_INTERRUPT_STATUS register */
    ENET_MAC_DPP_FSM_INT_FLAG_ATPES   = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 0U),     /*!< application transmit interface parity checker status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_RDPES   = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 2U),     /*!< read descriptor parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MPES    = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 3U),     /*!< MTL data path parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MTSPES  = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 4U),     /*!< MTL Tx status data path parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_ARPES   = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 5U),     /*!< application receive interface data path parity error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_CWPES   = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 6U),     /*!< CSR write data path parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_TTES    = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 8U),     /*!< Tx FSM timeout Error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_RTES    = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 9U),     /*!< application transmit interface parity checker status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_ATES    = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 11U),    /*!< APP FSM timeout error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_PTES    = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 12U),    /*!< PTP FSM timeout error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MSTTES  = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 16U),    /*!< master read / write timeout error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_FSMPES  = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 24U),    /*!< FSM state parity error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MTBUPES = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 25U),    /*!< MAC TBU data path parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MTFCPES = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 26U),    /*!< MAC TFC data path parity checker error status flag */
    ENET_MAC_DPP_FSM_INT_FLAG_MRWCPES = ENET_REGIDX_BIT(MAC_DPP_FSM_INTERRUPT_STATUS_REG_OFFSET, 27U),    /*!< MTL RWC data path parity checker error status flag */
    
    /* MMC_RX_INTERRUPT register */
    ENET_MMC_RX_INT_FLAG_RXGBPKTIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 0U),                 /*!< MMC receive good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXGBOCTIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 1U),                 /*!< MMC receive good bad octet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXGOCTIS     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 2U),                 /*!< MMC receive good octet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXBCGPIS     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 3U),                 /*!< MMC receive broadcast good packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXMCGPIS     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 4U),                 /*!< MMC receive multicast good packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXCRCERPIS   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 5U),                 /*!< MMC receive crc error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXALGNERPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 6U),                 /*!< MMC receive alignment error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXRUNTPIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 7U),                 /*!< MMC receive runt packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXJABERPIS   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 8U),                 /*!< MMC receive jabber error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXUSIZEGPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 9U),                 /*!< MMC receive undersize good packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXOSIZEGPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 10U),                /*!< MMC receive oversize good packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX64OCTGBPIS = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 11U),                /*!< MMC receive 64 octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX65T127OCTGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 12U),           /*!< MMC receive 65 to 127 octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX128T255OCTGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 13U),          /*!< MMC receive 128 to 255 octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX256T511OCTGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 14U),          /*!< MMC receive 256 to 511 octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX512T1023OCTGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 15U),         /*!< MMC receive 512 to 1023 octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RX1024TMAXOCTGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 16U),         /*!< MMC receive 1024 to maximum octet good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXUCGPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 17U),                   /*!< MMC receive unicast good packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXLENERPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 18U),                 /*!< MMC receive length error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXORANGEPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 19U),                /*!< MMC receive out of range error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXPAUSPIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 20U),                /*!< MMC receive pause counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXFOVPIS     = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 21U),                /*!< MMC receive FIFO overflow packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXVLANGBPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 22U),                /*!< MMC receive VLAN good bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXWDOGPIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 23U),                /*!< MMC receive watchdog error bad packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXRCVERRPIS  = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 24U),                /*!< MMC receive error packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXCTRLPIS    = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 25U),                /*!< MMC receive control packet counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXLPIUSCIS   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 26U),                /*!< MMC receive LPI microsecond counter interrupt status flag */
    ENET_MMC_RX_INT_FLAG_RXLPITRCIS   = ENET_REGIDX_BIT(MMC_RX_INTERRUPT_REG_OFFSET, 27U),                /*!< MMC receive LPI transition counter interrupt status flag */
    
    /* MMC_TX_INTERRUPT register */
    ENET_MMC_TX_INT_FLAG_TXGBOCTIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 0U),                 /*!< MMC transmit good bad octet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXGBPKTIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 1U),                 /*!< MMC transmit good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXBCGPIS     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 2U),                 /*!< MMC transmit broadcast good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXMCGPIS     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 3U),                 /*!< MMC transmit multicast good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX64OCTGBPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 4U),                /*!< MMC transmit 64 Octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX65T127OCTGBPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 5U),            /*!< MMC transmit 65 to 127 octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX128T255OCTGBPIS = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 6U),            /*!< MMC transmit 128 to 255 octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX256T511OCTGBPIS = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 7U),            /*!< MMC transmit 256 to 511 octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX512T1023OCTGBPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 8U),          /*!< MMC transmit 512 to 1023 octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TX1024TMAXOCTGBPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 9U),          /*!< MMC transmit 1024 to maximum octet good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXUCGBPIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 10U),                /*!< MMC transmit unicast good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXMCGBPIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 11U),                /*!< MMC transmit multicast good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXBCGBPIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 12U),                /*!< MMC transmit broadcast good bad packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXUFLOWERPIS = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 13U),                /*!< MMC transmit underflow error packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXSCOLGPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 14U),                /*!< MMC transmit single collision good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXMCOLGPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 15U),                /*!< MMC transmit multiple collision good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXDEFPIS     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 16U),                /*!< MMC transmit deferred packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXLATCOLPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 17U),                /*!< MMC transmit late collision packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXEXCOLPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 18U),                /*!< MMC transmit excessive collision packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXCARERPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 19U),                /*!< MMC transmit carrier error packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXGOCTIS     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 20U),                /*!< MMC transmit good octet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXGPKTIS     = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 21U),                /*!< MMC transmit good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXEXDEFPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 22U),                /*!< MMC transmit excessive deferral packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXPAUSPIS    = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 23U),                /*!< MMC transmit pause packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXVLANGPIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 24U),                /*!< MMC transmit VLAN good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXOSIZEGPIS  = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 25U),                /*!< MMC transmit oversize good packet counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXLPIUSCIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 26U),                /*!< MMC transmit LPI microsecond counter interrupt status flag */
    ENET_MMC_TX_INT_FLAG_TXLPITRCIS   = ENET_REGIDX_BIT(MMC_TX_INTERRUPT_REG_OFFSET, 27U),                /*!< MMC transmit LPI transition counter interrupt status flag */
    
    /* MMC_IPC_RX_INTERRUPT register */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4GPIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 0U),      /*!< MMC receive IPV4 good packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4HERPIS    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 1U),      /*!< MMC receive IPV4 header error packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4NOPAYPIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 2U),      /*!< MMC receive IPV4 no payload packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4FRAGPIS   = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 3U),      /*!< MMC receive IPV4 fragmented packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4UDSBLPIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 4U),      /*!< MMC receive IPV4 UDP checksum disabled packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6GPIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 5U),      /*!< MMC receive IPV6 good packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6HERPIS    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 6U),      /*!< MMC receive IPV6 header error packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6NOPAYPIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 7U),      /*!< MMC receive IPV6 no payload packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXUDPGPIS       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 8U),      /*!< MMC receive UDP good packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXUDPERPIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 9U),      /*!< MMC receive UDP error packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXTCPGPIS       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 10U),     /*!< MMC receive TCP good packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXTCPERPIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 11U),     /*!< MMC receive TCP error packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXICMPGPIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 12U),     /*!< MMC receive ICMP good packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXICMPERPIS     = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 13U),     /*!< MMC receive ICMP error packet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4GOIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 16U),      /*!< MMC receive IPV4 good octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4HEROIS    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 17U),      /*!< MMC receive IPV4 header error octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4NOPAYOIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 18U),      /*!< MMC receive IPV4 no payload octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4FRAGOIS   = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 19U),      /*!< MMC receive IPV4 fragmented octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV4UDSBLOIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 20U),      /*!< MMC receive IPV4 UDP checksum disabled octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6GOIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 21U),      /*!< MMC receive IPV6 good octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6HEROIS    = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 22U),      /*!< MMC receive IPV6 header error octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXIPV6NOPAYOIS  = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 23U),      /*!< MMC receive IPV6 no payload octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXUDPGOIS       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 24U),      /*!< MMC receive UDP good octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXUDPEROIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 25U),      /*!< MMC receive UDP error octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXTCPGOIS       = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 26U),      /*!< MMC receive TCP good octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXTCPEROIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 27U),      /*!< MMC receive TCP error octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXICMPGOIS      = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 28U),      /*!< MMC receive ICMP good octet counter interrupt status flag */
    ENET_MMC_IPC_RX_INT_FLAG_RXICMPEROIS     = ENET_REGIDX_BIT(MMC_IPC_RX_INTERRUPT_REG_OFFSET, 29U),      /*!< MMC receive ICMP error octet counter interrupt status flag */
    
    /* MMC_FPE_TX_INTERRUPT register */
    ENET_MMC_FPE_TX_INT_FLAG_FCIS            = ENET_REGIDX_BIT(MMC_FPE_TX_INTERRUPT_REG_OFFSET, 0U),       /*!< MMC Tx FPE fragment counter interrupt status flag */
    ENET_MMC_FPE_TX_INT_FLAG_HRCIS           = ENET_REGIDX_BIT(MMC_FPE_TX_INTERRUPT_REG_OFFSET, 1U),       /*!< MMC Tx hold request counter interrupt status flag */
    
