sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
    /* MMC_FPE_RX_INTERRUPT register */
    ENET_MMC_FPE_RX_INT_FLAG_PAECIS          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_REG_OFFSET, 0U),       /*!< MMC Rx packet assembly error counter interrupt status flag */
    ENET_MMC_FPE_RX_INT_FLAG_PSECIS          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_REG_OFFSET, 1U),       /*!< MMC Rx packet SMD error counter interrupt status flag */
    ENET_MMC_FPE_RX_INT_FLAG_PAOCIS          = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_REG_OFFSET, 2U),       /*!< MMC Rx packet assembly OK counter interrupt status flag */
    ENET_MMC_FPE_RX_INT_FLAG_FCIS            = ENET_REGIDX_BIT(MMC_FPE_RX_INTERRUPT_REG_OFFSET, 3U),       /*!< MMC Rx FPE fragment counter interrupt status flag */
    /* MTL_INTERRUPT_STATUS register */
    ENET_MTL_INT_FLAG_Q0IS                   = ENET_REGIDX_BIT(MTL_INTERRUPT_STATUS_REG_OFFSET, 0U),       /*!< queue 0 interrupt status flag */
    ENET_MTL_INT_FLAG_Q1IS                   = ENET_REGIDX_BIT(MTL_INTERRUPT_STATUS_REG_OFFSET, 1U),       /*!< queue 1 interrupt status flag */
    ENET_MTL_INT_FLAG_DBGIS                  = ENET_REGIDX_BIT(MTL_INTERRUPT_STATUS_REG_OFFSET, 17U),      /*!< debug interrupt status flag */
    ENET_MTL_INT_FLAG_ESTIS                  = ENET_REGIDX_BIT(MTL_INTERRUPT_STATUS_REG_OFFSET, 18U),      /*!< EST (TAS- 802.1Qbv) interrupt status flag */
    ENET_MTL_INT_FLAG_MTLPIS                 = ENET_REGIDX_BIT(MTL_INTERRUPT_STATUS_REG_OFFSET, 23U),      /*!< MTL Rx parser interrupt status flag */
    /* MTL_RXP_INTERRUPT_CONTROL_STATUS register */ 
    ENET_MTL_RXP_INT_FLAG_NVEOVIS        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U), /*!< number of valid entries overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_NPEOVIS        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U), /*!< number of parsable entries overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_FOOVIS         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 2U), /*!< frame offset overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_PDRFIS         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 3U), /*!< packet drop due to RF interrupt status flag */
    /* MTL_SAFETY_INTERRUPT_STATUS_REG_OFFSET register */
    ENET_MTL_SAFETY_INT_FLAG_MECIS       = ENET_REGIDX_BIT(MTL_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 0U),     /*!< MTL ECC correctable error interrupt status flag */
    ENET_MTL_SAFETY_INT_FLAG_MEUIS       = ENET_REGIDX_BIT(MTL_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 1U),     /*!< MTL ECC uncorrectable error interrupt status flag */
    /* MTL_ECC_INTERRUPT_STATUS_REG_OFFSET register */
    ENET_MTL_ECC_INT_FLAG_TXCES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 0U),        /*!< MTL Tx memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_TXAMS          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 1U),        /*!< MTL Tx memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_TXUES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 2U),        /*!< MTL Tx memory uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_RXCES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 4U),        /*!< MTL Rx memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_RXAMS          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 5U),        /*!< MTL Rx memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_RXUES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 6U),        /*!< MTL Rx memory uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_ECES           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 8U),        /*!< MTL EST correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_EAMS           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 9U),        /*!< MTL EST address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_EUES           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 10U),       /*!< MTL EST uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_RPCES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 12U),       /*!< MTL Rx Parser memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_RPAMS          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 13U),       /*!< MTL Rx Parser memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_RPUES          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 14U),       /*!< MTL Rx Parser memory uncorrectable error status flag */
    /* MTL_Q0_INTERRUPT_CONTROL_STATUS register */ 
    ENET_MTL_Q0_INT_FLAG_RXOVFIS           = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 16U), /*!< receive queue 0 overflow status flag */
    ENET_MTL_Q0_INT_FLAG_ABPSIS            = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U),  /*!< queue 0 average bits per slot status flag */
    ENET_MTL_Q0_INT_FLAG_TQU               = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U),  /*!< transmit queue 0 underflow status flag */
    /* MTL_Q1_INTERRUPT_CONTROL_STATUS register */
    ENET_MTL_Q1_INT_FLAG_RXOVFIS           = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 16U), /*!< receive queue 1 overflow status flag */
    ENET_MTL_Q1_INT_FLAG_ABPSIS            = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U),  /*!< queue 1 average bits per slot status flag */
    ENET_MTL_Q1_INT_FLAG_TQU               = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U),  /*!< transmit queue 1 underflow status flag */
    /* DMA_INTERRUPT_STATUS register */
    ENET_DMA_INT_FLAG_DC0IS              = ENET_REGIDX_BIT(DMA_INTERRUPT_STATUS_REG_OFFSET, 0U),            /*!< DMA channel 0 interrupt status flag */
    ENET_DMA_INT_FLAG_DC1IS              = ENET_REGIDX_BIT(DMA_INTERRUPT_STATUS_REG_OFFSET, 1U),            /*!< DMA channel 1 interrupt status flag */
    ENET_DMA_INT_FLAG_MTLIS              = ENET_REGIDX_BIT(DMA_INTERRUPT_STATUS_REG_OFFSET, 16U),           /*!< MTL interrupt status flag */
    ENET_DMA_INT_FLAG_MACIS              = ENET_REGIDX_BIT(DMA_INTERRUPT_STATUS_REG_OFFSET, 17U),           /*!< MAC interrupt status flag */
    /* DMA_SAFETY_INTERRUPT_STATUS register */
    ENET_DMA_SAFETY_INT_FLAG_DECIS       = ENET_REGIDX_BIT(DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 0U),            /*!< DMA ECC correctable error interrupt status flag */
    ENET_DMA_SAFETY_INT_FLAG_DEUIS       = ENET_REGIDX_BIT(DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 1U),            /*!< DMA ECC uncorrectable error interrupt status flag */
    ENET_DMA_SAFETY_INT_FLAG_MSCIS       = ENET_REGIDX_BIT(DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 28U),           /*!< MTL safety correctable error interrupt status flag */
    ENET_DMA_SAFETY_INT_FLAG_MSUIS       = ENET_REGIDX_BIT(DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 29U),           /*!< MTL safety uncorrectable error interrupt status flag */
    ENET_DMA_SAFETY_INT_FLAG_MCSIS       = ENET_REGIDX_BIT(DMA_SAFETY_INTERRUPT_STATUS_REG_OFFSET, 31U),           /*!< MAC safety uncorrectable error interrupt status flag */
    /* DMA_CH0_STATUS register */
    ENET_DMA_CH0_INT_FLAG_TI            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 0U),     /*!< channel 0 transmit status flag */
    ENET_DMA_CH0_INT_FLAG_TPS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 1U),     /*!< channel 0 transmit process stopped status flag */
    ENET_DMA_CH0_INT_FLAG_TBU           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 2U),     /*!< channel 0 transmit buffer unavailable status flag */
    ENET_DMA_CH0_INT_FLAG_RI            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 6U),     /*!< channel 0 receive status flag */
    ENET_DMA_CH0_INT_FLAG_RBU           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 7U),     /*!< channel 0 receive buffer unavailable status flag */
    ENET_DMA_CH0_INT_FLAG_RPS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 8U),     /*!< channel 0 receive process stopped status flag */
    ENET_DMA_CH0_INT_FLAG_RWT           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 9U),     /*!< channel 0 receive watchdog timeout status flag */
    ENET_DMA_CH0_INT_FLAG_ETI           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 10U),    /*!< channel 0 early transmit status flag */
    ENET_DMA_CH0_INT_FLAG_ERIE          = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 11U),    /*!< channel 0 early receive status flag */
    ENET_DMA_CH0_INT_FLAG_FBE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 12U),    /*!< channel 0 fatal bus error status flag */
    ENET_DMA_CH0_INT_FLAG_CDE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 13U),    /*!< channel 0 context descriptor error status flag */
    ENET_DMA_CH0_INT_FLAG_AIE           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 14U),    /*!< channel 0 abnormal interrupt summary flag */
    ENET_DMA_CH0_INT_FLAG_NIS           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 15U),    /*!< channel 0 normal interrupt summary flag */
    /* DMA_CH1_STATUS register */
    ENET_DMA_CH1_INT_FLAG_TI            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 0U),     /*!< channel 1 transmit status flag */
    ENET_DMA_CH1_INT_FLAG_TPS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 1U),     /*!< channel 1 transmit process stopped status flag */
    ENET_DMA_CH1_INT_FLAG_TBU           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 2U),     /*!< channel 1 transmit buffer unavailable status flag */
    ENET_DMA_CH1_INT_FLAG_RI            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 6U),     /*!< channel 1 receive status flag */
    ENET_DMA_CH1_INT_FLAG_RBU           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 7U),     /*!< channel 1 receive buffer unavailable status flag */
    ENET_DMA_CH1_INT_FLAG_RPS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 8U),     /*!< channel 1 receive process stopped status flag */
    ENET_DMA_CH1_INT_FLAG_RWT           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 9U),     /*!< channel 1 receive watchdog timeout status flag */
    ENET_DMA_CH1_INT_FLAG_ETI           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 10U),    /*!< channel 1 early transmit status flag */
    ENET_DMA_CH1_INT_FLAG_ERIE          = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 11U),    /*!< channel 1 early receive status flag */
    ENET_DMA_CH1_INT_FLAG_FBE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 12U),    /*!< channel 1 fatal bus error status flag */
    ENET_DMA_CH1_INT_FLAG_CDE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 13U),    /*!< channel 1 context descriptor error status flag */
    ENET_DMA_CH1_INT_FLAG_AIE           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 14U),    /*!< channel 1 abnormal interrupt summary flag */
    ENET_DMA_CH1_INT_FLAG_NIS           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 15U),    /*!< channel 1 normal interrupt summary flag */
} enet_int_flag_enum;

/* ENET interrupt flag clear */
typedef enum
{
    
    /* MTL_RXP_INTERRUPT_CONTROL_STATUS register */ 
    ENET_MTL_RXP_INT_FLAG_NVEOVIS_CLR        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U), /*!< number of valid entries overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_NPEOVIS_CLR        = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U), /*!< number of parsable entries overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_FOOVIS_CLR         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 2U), /*!< frame offset overflow interrupt status flag */
    ENET_MTL_RXP_INT_FLAG_PDRFIS_CLR         = ENET_REGIDX_BIT(MTL_RXP_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 3U), /*!< packet drop due to RF interrupt status flag */

    /* MTL_ECC_INTERRUPT_STATUS_REG_OFFSET register */
    ENET_MTL_ECC_INT_FLAG_TXCES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 0U),        /*!< MTL Tx memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_TXAMS_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 1U),        /*!< MTL Tx memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_TXUES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 2U),        /*!< MTL Tx memory uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_RXCES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 4U),        /*!< MTL Rx memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_RXAMS_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 5U),        /*!< MTL Rx memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_RXUES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 6U),        /*!< MTL Rx memory uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_ECES_CLR           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 8U),        /*!< MTL EST correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_EAMS_CLR           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 9U),        /*!< MTL EST address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_EUES_CLR           = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 10U),       /*!< MTL EST uncorrectable error status flag */
    ENET_MTL_ECC_INT_FLAG_RPCES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 12U),       /*!< MTL Rx Parser memory correctable error status flag */
    ENET_MTL_ECC_INT_FLAG_RPAMS_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 13U),       /*!< MTL Rx Parser memory address mismatch status flag */
    ENET_MTL_ECC_INT_FLAG_RPUES_CLR          = ENET_REGIDX_BIT(MTL_ECC_INTERRUPT_STATUS_REG_OFFSET, 14U),       /*!< MTL Rx Parser memory uncorrectable error status flag */
    /* MTL_Q0_INTERRUPT_CONTROL_STATUS register */ 
    ENET_MTL_Q0_INT_FLAG_RXOVFIS_CLR         = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 16U), /*!< receive queue 0 overflow status flag */
    ENET_MTL_Q0_INT_FLAG_ABPSIS_CLR          = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U),  /*!< queue 0 average bits per slot status flag */
    ENET_MTL_Q0_INT_FLAG_TQU_CLR             = ENET_REGIDX_BIT(MTL_Q0_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U),  /*!< transmit queue 0 underflow status flag */
    /* MTL_Q1_INTERRUPT_CONTROL_STATUS register */
    ENET_MTL_Q1_INT_FLAG_RXOVFIS_CLR         = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 16U), /*!< receive queue 1 overflow status flag */
    ENET_MTL_Q1_INT_FLAG_ABPSIS_CLR          = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 1U),  /*!< queue 1 average bits per slot status flag */
    ENET_MTL_Q1_INT_FLAG_TQU_CLR             = ENET_REGIDX_BIT(MTL_Q1_INTERRUPT_CONTROL_STATUS_REG_OFFSET, 0U),  /*!< transmit queue 1 underflow status flag */
    /* DMA_CH0_STATUS register */
    ENET_DMA_CH0_INT_FLAG_TI_CLR            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 0U),     /*!< channel 0 transmit status flag */
    ENET_DMA_CH0_INT_FLAG_TPS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 1U),     /*!< channel 0 transmit process stopped status flag */
    ENET_DMA_CH0_INT_FLAG_TBU_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 2U),     /*!< channel 0 transmit buffer unavailable status flag */
    ENET_DMA_CH0_INT_FLAG_RI_CLR            = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 6U),     /*!< channel 0 receive status flag */
    ENET_DMA_CH0_INT_FLAG_RBU_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 7U),     /*!< channel 0 receive buffer unavailable status flag */
    ENET_DMA_CH0_INT_FLAG_RPS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 8U),     /*!< channel 0 receive process stopped status flag */
    ENET_DMA_CH0_INT_FLAG_RWT_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 9U),     /*!< channel 0 receive watchdog timeout status flag */
    ENET_DMA_CH0_INT_FLAG_ETI_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 10U),    /*!< channel 0 early transmit status flag */
    ENET_DMA_CH0_INT_FLAG_ERIE_CLR          = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 11U),    /*!< channel 0 early receive status flag */
    ENET_DMA_CH0_INT_FLAG_FBE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 12U),    /*!< channel 0 fatal bus error status flag */
    ENET_DMA_CH0_INT_FLAG_CDE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 13U),    /*!< channel 0 context descriptor error status flag */
    ENET_DMA_CH0_INT_FLAG_AIE_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 14U),    /*!< channel 0 abnormal interrupt summary flag */
    ENET_DMA_CH0_INT_FLAG_NIS_CLR           = ENET_REGIDX_BIT(DMA_CH0_STATUS_REG_OFFSET, 15U),    /*!< channel 0 normal interrupt summary flag */
    /* DMA_CH1_STATUS register */
    ENET_DMA_CH1_INT_FLAG_TI_CLR            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 0U),     /*!< channel 1 transmit status flag */
    ENET_DMA_CH1_INT_FLAG_TPS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 1U),     /*!< channel 1 transmit process stopped status flag */
    ENET_DMA_CH1_INT_FLAG_TBU_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 2U),     /*!< channel 1 transmit buffer unavailable status flag */
    ENET_DMA_CH1_INT_FLAG_RI_CLR            = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 6U),     /*!< channel 1 receive status flag */
    ENET_DMA_CH1_INT_FLAG_RBU_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 7U),     /*!< channel 1 receive buffer unavailable status flag */
    ENET_DMA_CH1_INT_FLAG_RPS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 8U),     /*!< channel 1 receive process stopped status flag */
    ENET_DMA_CH1_INT_FLAG_RWT_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 9U),     /*!< channel 1 receive watchdog timeout status flag */
    ENET_DMA_CH1_INT_FLAG_ETI_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 10U),    /*!< channel 1 early transmit status flag */
    ENET_DMA_CH1_INT_FLAG_ERIE_CLR          = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 11U),    /*!< channel 1 early receive status flag */
    ENET_DMA_CH1_INT_FLAG_FBE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 12U),    /*!< channel 1 fatal bus error status flag */
    ENET_DMA_CH1_INT_FLAG_CDE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 13U),    /*!< channel 1 context descriptor error status flag */
    ENET_DMA_CH1_INT_FLAG_AIE_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 14U),    /*!< channel 1 abnormal interrupt summary flag */
    ENET_DMA_CH1_INT_FLAG_NIS_CLR           = ENET_REGIDX_BIT(DMA_CH1_STATUS_REG_OFFSET, 15U),    /*!< channel 1 normal interrupt summary flag */
} enet_int_flag_clear_enum;

/* ENET MAC addresses */
typedef enum {
    ENET_MAC_ADDRESS0               = ((uint32_t)0x00000000),                       /*!< MAC address0 */
    ENET_MAC_ADDRESS1               = ((uint32_t)0x00000008),                       /*!< MAC address1 */
    ENET_MAC_ADDRESS2               = ((uint32_t)0x00000010)                        /*!< MAC address2 */
} enet_macaddress_enum;
/* descriptor information */
typedef enum {
    TXDESC_COLLISION_COUNT,                                                         /*!< the number of collisions occurred before the frame was transmitted */
    TXDESC_BUFFER_1_ADDR,                                                           /*!< transmit frame buffer 1 address */
    TXDESC_BUFFER_2_ADDR,                                                           /*!< transmit frame buffer 2 address */
    RXDESC_FRAME_LENGTH,                                                            /*!< the byte length of the received frame that was transferred to the buffer */
    RXDESC_BUFFER_1_ADDR,                                                           /*!< receive frame buffer 1 address */
    RXDESC_BUFFER_2_ADDR                                                            /*!< receive frame buffer 2 address */
} enet_descstate_enum;

