sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
typedef enum {
    ENET_TX_LPI_USEC_COUNTER_VAL             = ENET_TX_LPI_USEC_CNTR_REG_OFFSET,    /*!< transmit LPI microseconds counter */
    ENET_TX_LPI_TRAN_COUNTER_VAL             = ENET_TX_LPI_TRAN_CNTR_REG_OFFSET,    /*!< transmit LPI transition counter */
    ENET_RX_LPI_USEC_COUNTER_VAL             = ENET_RX_LPI_USEC_CNTR_REG_OFFSET,    /*!< receive LPI microseconds counter */
    ENET_RX_LPI_TRAN_COUNTER_VAL             = ENET_RX_LPI_TRAN_CNTR_REG_OFFSET     /*!< receive LPI transition counter */
} enet_lpi_counter_enum;

/* MMC counters preset mode */
typedef enum {
    ENET_MMC_PRESET_NONE            = 0U,                                                            /*!< do not preset MMC counter */
    ENET_MMC_PRESET_HALF            = ENET_MMC_CONTROL_CNTPRST,                                      /*!< preset all MMC counters to almost-half(0x7FFF FFF0) value */
    ENET_MMC_PRESET_FULL            = ENET_MMC_CONTROL_CNTPRST | ENET_MMC_CONTROL_CNTPRSTLVL         /*!< preset all MMC counters to almost-full(0xFFFF FFF0) value */
} enet_mmc_preset_enum;

/* MMC counters enum */
typedef enum {
    ENET_MMC_TX_OCTET_COUNT_GOOD_BAD               = MMC_TX_OCTET_COUNT_GOOD_BAD_REG_OFFSET,             /*!< ethernet transmit octet count good bad counter */
    ENET_MMC_TX_PACKET_COUNT_GOOD_BAD              = MMC_TX_PACKET_COUNT_GOOD_BAD_REG_OFFSET,            /*!< ethernet transmit packet count good bad counter */
    ENET_MMC_TX_BROADCAST_PACKETS_GOOD             = MMC_TX_BROADCAST_PACKETS_GOOD_REG_OFFSET,           /*!< ethernet transmit broadcast packets good counter */
    ENET_MMC_TX_MULTICAST_PACKETS_GOOD             = MMC_TX_MULTICAST_PACKETS_GOOD_REG_OFFSET,           /*!< ethernet transmit multicast packets good counter */
    ENET_MMC_TX_64OCTETS_PACKETS_GOOD_BAD          = MMC_TX_64OCTETS_PACKETS_GOOD_BAD_REG_OFFSET,        /*!< ethernet transmit 64 octet packets good bad counter */
    ENET_MMC_TX_65TO127OCTETS_PACKETS_GOOD_BAD     = MMC_TX_65TO127OCTET_PACKETS_GOOD_BAD_REG_OFFSET,    /*!< ethernet transmit 65 to 127 octet packets good bad counter */
    ENET_MMC_TX_128TO255OCTETS_PACKETS_GOOD_BAD    = MMC_TX_128TO255OCTET_PACKETS_GOOD_BAD_REG_OFFSET,   /*!< ethernet transmit 128 to 255 octet packets good bad counter */
    ENET_MMC_TX_256TO511OCTETS_PACKETS_GOOD_BAD    = MMC_TX_256TO511OCTET_PACKETS_GOOD_BAD_REG_OFFSET,   /*!< ethernet transmit 256 to 511 octet packets good bad counter */
    ENET_MMC_TX_512TO1023OCTETS_PACKETS_GOOD_BAD   = MMC_TX_512TO1023OCTET_PACKETS_GOOD_BAD_REG_OFFSET,  /*!< ethernet transmit 512 to 1023 octet packets good bad counter */
    ENET_MMC_TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD   = MMC_TX_1024TOMAXOCTET_PACKETS_GOOD_BAD_REG_OFFSET,  /*!< ethernet transmit 1024 to max octet packets good bad counter */
    ENET_MMC_TX_UNICAST_PACKETS_GOOD_BAD           = MMC_TX_UNICAST_PACKETS_GOOD_BAD_REG_OFFSET,         /*!< ethernet transmit unicast packets good bad counter */
    ENET_MMC_TX_MULTICAST_PACKETS_GOOD_BAD         = MMC_TX_MULTICAST_PACKETS_GOOD_BAD_REG_OFFSET,       /*!< ethernet transmit multicast packets good bad counter */
    ENET_MMC_TX_BROADCAST_PACKETS_GOOD_BAD         = MMC_TX_BROADCAST_PACKETS_GOOD_BAD_REG_OFFSET,       /*!< ethernet transmit broadcast packets good bad counter */
    ENET_MMC_TX_UNDERFLOW_ERROR_PACKETS            = MMC_TX_UNDERFLOW_ERROR_PACKETS_REG_OFFSET,          /*!< ethernet transmit underflow error packets counter */
    ENET_MMC_TX_SINGLE_COLLISION_GOOD_PACKETS      = MMC_TX_SINGLE_COLLISION_GOOD_PACKETS_REG_OFFSET,    /*!< ethernet transmit single collision good packets counter */
    ENET_MMC_TX_MULTIPLE_COLLISION_GOOD_PACKETS    = MMC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_REG_OFFSET,  /*!< ethernet transmit multiple collision good packets counter */
    ENET_MMC_TX_DEFERRED_PACKETS                   = MMC_TX_DEFERRED_PACKETS_REG_OFFSET,                 /*!< ethernet transmit deferred packets counter */
    ENET_MMC_TX_LATE_COLLISION_PACKETS             = MMC_TX_LATE_COLLISION_PACKETS_REG_OFFSET,           /*!< ethernet transmit late collision packets counter */
    ENET_MMC_TX_EXCESSIVE_COLLISION_PACKETS        = MMC_TX_EXCESSIVE_COLLISION_PACKETS_REG_OFFSET,      /*!< ethernet transmit excessive collision packets counter */
    ENET_MMC_TX_CARRIER_ERROR_PACKETS              = MMC_TX_CARRIER_ERROR_PACKETS_REG_OFFSET,            /*!< ethernet transmit carrier error packets counter */
    ENET_MMC_TX_OCTET_COUNT_GOOD                   = MMC_TX_OCTET_COUNT_GOOD_REG_OFFSET,                 /*!< ethernet transmit octet count good counter */
    ENET_MMC_TX_PACKET_COUNT_GOOD                  = MMC_TX_PACKET_COUNT_GOOD_REG_OFFSET,                /*!< ethernet transmit packet count good counter */
    ENET_MMC_TX_EXCESSIVE_DEFERRAL_ERROR           = MMC_TX_EXCESSIVE_DEFERRAL_ERROR_REG_OFFSET,         /*!< ethernet transmit excessive deferral error counter */
    ENET_MMC_TX_PAUSE_PACKETS                      = MMC_TX_PAUSE_PACKETS_REG_OFFSET,                    /*!< ethernet transmit pause packets counter */
    ENET_MMC_TX_VLAN_PACKETS_GOOD                  = MMC_TX_VLAN_PACKETS_GOOD_REG_OFFSET,                /*!< ethernet transmit vlan packets good counter */
    ENET_MMC_TX_OSIZE_PACKETS_GOOD                 = MMC_TX_OSIZE_PACKETS_GOOD_REG_OFFSET,               /*!< ethernet transmit oversize packets good counter */
    ENET_MMC_RX_PACKETS_COUNT_GOOD_BAD             = MMC_RX_PACKETS_COUNT_GOOD_BAD_REG_OFFSET,           /*!< ethernet receive packet count good bad counter */
    ENET_MMC_RX_OCTET_COUNT_GOOD_BAD               = MMC_RX_OCTET_COUNT_GOOD_BAD_REG_OFFSET,             /*!< ethernet receive octet count good bad counter */
    ENET_MMC_RX_OCTET_COUNT_GOOD                   = MMC_RX_OCTET_COUNT_GOOD_REG_OFFSET,                 /*!< ethernet receive octet count good counter */
    ENET_MMC_RX_BROADCAST_PACKETS_GOOD             = MMC_RX_BROADCAST_PACKETS_GOOD_REG_OFFSET,           /*!< ethernet receive broadcast packets good counter */
    ENET_MMC_RX_MULTICAST_PACKETS_GOOD             = MMC_RX_MULTICAST_PACKETS_GOOD_REG_OFFSET,           /*!< ethernet receive multicast packets good counter */
    ENET_MMC_RX_CRC_ERROR_PACKETS                  = MMC_RX_CRC_ERROR_PACKETS_REG_OFFSET,                /*!< ethernet receive crc error packets counter */
    ENET_MMC_RX_ALIGNMENT_ERROR_PACKETS            = MMC_RX_ALIGNMENT_ERROR_PACKETS_REG_OFFSET,          /*!< ethernet receive alignment error packets counter */
    ENET_MMC_RX_RUNT_ERROR_PACKETS                 = MMC_RX_RUNT_ERROR_PACKETS_REG_OFFSET,               /*!< ethernet receive runt error packets counter */
    ENET_MMC_RX_JABBER_ERROR_PACKETS               = MMC_RX_JABBER_ERROR_PACKETS_REG_OFFSET,             /*!< ethernet receive jabber error packets counter */
    ENET_MMC_RX_UNDERSIZE_PACKETS_GOOD             = MMC_RX_UNDERSIZE_PACKETS_GOOD_REG_OFFSET,           /*!< ethernet receive undersize packets good counter */
    ENET_MMC_RX_OVERSIZE_PACKETS_GOOD              = MMC_RX_OVERSIZE_PACKETS_GOOD_REG_OFFSET,            /*!< ethernet receive oversize packets good counter */
    ENET_MMC_RX_64OCTETS_PACKETS_GOOD_BAD          = MMC_RX_64OCTET_PACKETS_GOOD_BAD_REG_OFFSET,         /*!< ethernet receive 64 octet packets good bad counter */
    ENET_MMC_RX_65TO127OCTETS_PACKETS_GOOD_BAD     = MMC_RX_65TO127OCTET_PACKETS_GOOD_BAD_REG_OFFSET,    /*!< ethernet receive 65 to 127 octet packets good bad counter */
    ENET_MMC_RX_128TO255OCTETS_PACKETS_GOOD_BAD    = MMC_RX_128TO255OCTET_PACKETS_GOOD_BAD_REG_OFFSET,   /*!< ethernet receive 128 to 255 octet packets good bad counter */
    ENET_MMC_RX_256TO511OCTETS_PACKETS_GOOD_BAD    = MMC_RX_256TO511OCTET_PACKETS_GOOD_BAD_REG_OFFSET,   /*!< ethernet receive 256 to 511 octet packets good bad counter */
    ENET_MMC_RX_512TO1023OCTETS_PACKETS_GOOD_BAD   = MMC_RX_512TO1023OCTET_PACKETS_GOOD_BAD_REG_OFFSET,  /*!< ethernet receive 512 to 1023 octet packets good bad counter */
    ENET_MMC_RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD   = MMC_RX_1024TOMAXOCTET_PACKETS_GOOD_BAD_REG_OFFSET,  /*!< ethernet receive 1024 to max octet packets good bad counter */
    ENET_MMC_RX_UNICAST_PACKETS_GOOD               = MMC_RX_UNICAST_PACKETS_GOOD_REG_OFFSET,             /*!< ethernet receive unicast packets good counter */
    ENET_MMC_RX_LENGTH_ERROR_PACKETS               = MMC_RX_LENGTH_ERROR_PACKETS_REG_OFFSET,             /*!< ethernet receive length error packets counter */
    ENET_MMC_RX_OUT_OF_RANGE_TYPE_PACKETS          = MMC_RX_OUT_OF_RANGE_TYPE_PACKETS_REG_OFFSET,        /*!< ethernet receive out of range type packets counter */
    ENET_MMC_RX_PAUSE_PACKETS                      = MMC_RX_PAUSE_PACKETS_REG_OFFSET,                    /*!< ethernet receive pause packets counter */
    ENET_MMC_RX_FIFO_OVERFLOW_PACKETS              = MMC_RX_FIFO_OVERFLOW_PACKETS_REG_OFFSET,            /*!< ethernet receive fifo overflow packets counter */
    ENET_MMC_RX_VLAN_PACKETS_GOOD_BAD              = MMC_RX_VLAN_PACKETS_GOOD_BAD_REG_OFFSET,            /*!< ethernet receive vlan packets good bad counter */
    ENET_MMC_RX_WATCHDOG_ERROR_PACKETS             = MMC_RX_WATCHDOG_ERROR_PACKETS_REG_OFFSET,           /*!< ethernet receive watchdog error packets counter */
    ENET_MMC_RX_RECEIVE_ERROR_PACKETS              = MMC_RX_ERROR_PACKETS_REG_OFFSET,                    /*!< ethernet receive error packets counter */
    ENET_MMC_RX_CONTROL_PACKETS_GOOD               = MMC_RX_CONTROL_PACKETS_GOOD_REG_OFFSET,             /*!< ethernet receive control packets good counter */
    ENET_MMC_TX_LPI_USEC_CNTR                      = ENET_TX_LPI_USEC_CNTR_REG_OFFSET,                    /*!< ethernet transmit LPI microseconds counter register offset */
    ENET_MMC_TX_LPI_TRAN_CNTR                      = ENET_TX_LPI_TRAN_CNTR_REG_OFFSET,                    /*!< ethernet transmit LPI transition counter register offset */
    ENET_MMC_RX_LPI_USEC_CNTR                      = ENET_RX_LPI_USEC_CNTR_REG_OFFSET,                    /*!< ethernet receive LPI microseconds counter register offset */
    ENET_MMC_RX_LPI_TRAN_CNTR                      = ENET_RX_LPI_TRAN_CNTR_REG_OFFSET,                    /*!< ethernet receive LPI transition counter register offset */
    ENET_MMC_RXIPV4_GOOD_PACKETS                   = MMC_RXIPV4_GOOD_PACKETS_REG_OFFSET,                  /*!< ethernet receive ipv4 good packets register */
    ENET_MMC_RXIPV4_HEADER_ERROR_PACKETS           = MMC_RXIPV4_HEADER_ERROR_PACKETS_REG_OFFSET,          /*!< ethernet receive ipv4 header error packets register */
    ENET_MMC_RXIPV4_NO_PAYLOAD_PACKETS             = MMC_RXIPV4_NO_PAYLOAD_PACKETS_REG_OFFSET,            /*!< ethernet receive ipv4 no payload packets register */
    ENET_MMC_RXIPV4_FRAGMENTED_PACKETS             = MMC_RXIPV4_FRAGMENTED_PACKETS_REG_OFFSET,            /*!< ethernet receive ipv4 fragmented packets register */
    ENET_MMC_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS  = MMC_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_REG_OFFSET, /*!< ethernet receive ipv4 udp checksum disabled packets register */
    ENET_MMC_RXIPV6_GOOD_PACKETS                   = MMC_RXIPV6_GOOD_PACKETS_REG_OFFSET,                  /*!< ethernet receive ipv6 good packets register */
    ENET_MMC_RXIPV6_HEADER_ERROR_PACKETS           = MMC_RXIPV6_HEADER_ERROR_PACKETS_REG_OFFSET,          /*!< ethernet receive ipv6 header error packets register */
    ENET_MMC_RXIPV6_NO_PAYLOAD_PACKETS             = MMC_RXIPV6_NO_PAYLOAD_PACKETS_REG_OFFSET,            /*!< ethernet receive ipv6 no payload packets register */
    ENET_MMC_RXUDP_GOOD_PACKETS                    = MMC_RXUDP_GOOD_PACKETS_REG_OFFSET,                   /*!< ethernet receive udp good packets register */
    ENET_MMC_RXUDP_ERROR_PACKETS                   = MMC_RXUDP_ERROR_PACKETS_REG_OFFSET,                  /*!< ethernet receive udp error packets register */
    ENET_MMC_RXTCP_GOOD_PACKETS                    = MMC_RXTCP_GOOD_PACKETS_REG_OFFSET,                   /*!< ethernet receive tcp good packets register */
    ENET_MMC_RXTCP_ERROR_PACKETS                   = MMC_RXTCP_ERROR_PACKETS_REG_OFFSET,                  /*!< ethernet receive tcp error packets register */
    ENET_MMC_RXICMP_GOOD_PACKETS                   = MMC_RXICMP_GOOD_PACKETS_REG_OFFSET,                  /*!< ethernet receive icmp good packets register */
    ENET_MMC_RXICMP_ERROR_PACKETS                  = MMC_RXICMP_ERROR_PACKETS_REG_OFFSET,                 /*!< ethernet receive icmp error packets register */
    ENET_MMC_RXIPV4_GOOD_OCTETS                    = MMC_RXIPV4_GOOD_OCTETS_REG_OFFSET,                   /*!< ethernet receive ipv4 good octets register */
    ENET_MMC_RXIPV4_HEADER_ERROR_OCTETS            = MMC_RXIPV4_HEADER_ERROR_OCTETS_REG_OFFSET,           /*!< ethernet receive ipv4 header error octets register */
    ENET_MMC_RXIPV4_NO_PAYLOAD_OCTETS              = MMC_RXIPV4_NO_PAYLOAD_OCTETS_REG_OFFSET,             /*!< ethernet receive ipv4 no payload octets register */
    ENET_MMC_RXIPV4_FRAGMENTED_OCTETS              = MMC_RXIPV4_FRAGMENTED_OCTETS_REG_OFFSET,             /*!< ethernet receive ipv4 fragmented octets register */
    ENET_MMC_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS   = MMC_RXIPV4_UDP_CHECKSUM_DISABLED_OCTETS_REG_OFFSET,  /*!< ethernet receive ipv4 udp checksum disabled octets register */
    ENET_MMC_RXIPV6_GOOD_OCTETS                    = MMC_RXIPV6_GOOD_OCTETS_REG_OFFSET,                   /*!< ethernet receive ipv6 good octets register */
    ENET_MMC_RXIPV6_HEADER_ERROR_OCTETS            = MMC_RXIPV6_HEADER_ERROR_OCTETS_REG_OFFSET,           /*!< ethernet receive ipv6 header error octets register */
    ENET_MMC_RXIPV6_NO_PAYLOAD_OCTETS              = MMC_RXIPV6_NO_PAYLOAD_OCTETS_REG_OFFSET,             /*!< ethernet receive ipv6 no payload octets register */
    ENET_MMC_RXUDP_GOOD_OCTETS                     = MMC_RXUDP_GOOD_OCTETS_REG_OFFSET,                    /*!< ethernet receive udp good octets register */
    ENET_MMC_RXUDP_ERROR_OCTETS                    = MMC_RXUDP_ERROR_OCTETS_REG_OFFSET,                   /*!< ethernet receive udp error octets register */
    ENET_MMC_RXTCP_GOOD_OCTETS                     = MMC_RXTCP_GOOD_OCTETS_REG_OFFSET,                    /*!< ethernet receive tcp good octets register */
    ENET_MMC_RXTCP_ERROR_OCTETS                    = MMC_RXTCP_ERROR_OCTETS_REG_OFFSET,                   /*!< ethernet receive tcp error octets register */
    ENET_MMC_RXICMP_GOOD_OCTETS                    = MMC_RXICMP_GOOD_OCTETS_REG_OFFSET,                   /*!< ethernet receive icmp good octets register */
    ENET_MMC_RXICMP_ERROR_OCTETS                   = MMC_RXICMP_ERROR_OCTETS_REG_OFFSET,                  /*!< ethernet receive icmp error octets register */
    ENET_MMC_MMC_FPE_TX_FRAGMENT                   = MMC_MMC_FPE_TX_FRAGMENT_CNTR_REG_OFFSET,             /*!< ethernet MMC FPE transmit fragment counter register */
    ENET_MMC_MMC_TX_HOLD_REQ                       = MMC_MMC_TX_HOLD_REQ_CNTR_REG_OFFSET,                 /*!< ethernet MMC FPE hold request counter register */
    ENET_MMC_RX_PACKETS_ASSEMBLY_ERR               = MMC_RX_PACKETS_ASSEMBLY_ERR_CNTR_REG_OFFSET,         /*!< ethernet MMC receive packets assembly error counter register */
    ENET_MMC_RX_PACKETS_SMD_ERR                    = MMC_RX_PACKETS_SMD_ERR_CNTR_REG_OFFSET,              /*!< ethernet MMC receive packets SMD error counter register */
    ENET_MMC_RX_PACKETS_ASSEMBLY_OK                = MMC_RX_PACKETS_ASSEMBLY_OK_CNTR_REG_OFFSET,          /*!< ethernet MMC receive packets assembly ok counter register */
    ENET_MMC_RX_FPE_FRAGMENT                       = MMC_RX_FPE_FRAGMENT_CNTR_REG_OFFSET                  /*!< ethernet MMC receive FPE fragment counter register */
} enet_mmc_counter_enum;

/* current RX/TX descriptor/buffer/descriptor table address get */
typedef enum {
    ENET_CH0_RX_DESC_TABLE              = DMA_CH0_RDTADDR_REG_OFFSET,                       /*!< DMA channel 0 RX descriptor table */
    ENET_CH1_RX_DESC_TABLE              = DMA_CH1_RDTADDR_REG_OFFSET,                       /*!< DMA channel 1 RX descriptor table */
    ENET_CH0_RX_DESC_TAIL               = DMA_CH0_RDTAIL_REG_OFFSET,                        /*!< DMA channel 0 RX descriptor tail pointer */
    ENET_CH1_RX_DESC_TAIL               = DMA_CH1_RDTAIL_REG_OFFSET,                        /*!< DMA channel 1 RX descriptor tail pointer */
    ENET_CH0_RX_CURRENT_DESC            = DMA_CH0_CRDADDR_REG_OFFSET,                       /*!< DMA channel 0  current RX descriptor */
    ENET_CH1_RX_CURRENT_DESC            = DMA_CH1_CRDADDR_REG_OFFSET,                       /*!< DMA channel 1 current RX descriptor */
    ENET_CH0_RX_CURRENT_BUFFER          = DMA_CH0_CRBADDR_REG_OFFSET,                       /*!< DMA channel 0 current RX buffer */
    ENET_CH1_RX_CURRENT_BUFFER          = DMA_CH1_CRBADDR_REG_OFFSET,                       /*!< DMA channel 1 current RX buffer */
    ENET_CH0_TX_DESC_TABLE              = DMA_CH0_TDTADDR_REG_OFFSET,                       /*!< DMA channel 0 TX descriptor table */
    ENET_CH1_TX_DESC_TABLE              = DMA_CH1_TDTADDR_REG_OFFSET,                       /*!< DMA channel 1 TX descriptor table */
    ENET_CH0_TX_DESC_TAIL               = DMA_CH0_TDTAIL_REG_OFFSET,                        /*!< DMA channel 0 TX descriptor tail pointer */
    ENET_CH1_TX_DESC_TAIL               = DMA_CH1_TDTAIL_REG_OFFSET,                        /*!< DMA channel 1 TX descriptor tail pointer */
    ENET_CH0_TX_CURRENT_DESC            = DMA_CH0_CTDADDR_REG_OFFSET,                       /*!< DMA channel 0 current TX descriptor */
    ENET_CH1_TX_CURRENT_DESC            = DMA_CH1_CTDADDR_REG_OFFSET,                       /*!< DMA channel 1 current TX descriptor */
    ENET_CH0_TX_CURRENT_BUFFER          = DMA_CH0_CTBADDR_REG_OFFSET,                       /*!< DMA channel 0 current TX buffer */
    ENET_CH1_TX_CURRENT_BUFFER          = DMA_CH1_CTBADDR_REG_OFFSET,                       /*!< DMA channel 1 current TX buffer */
} enet_desc_reg_enum;

/* phy mode and mac loopback configurations */
typedef enum {
    ENET_AUTO_NEGOTIATION           = 0x01U,                                                         /*!< PHY auto negotiation */
    ENET_100M_FULLDUPLEX            = (ENET_MAC_CONFIGURATION_FES | ENET_MAC_CONFIGURATION_DM),      /*!< 100Mbit/s, full-duplex */
    ENET_100M_HALFDUPLEX            = ENET_MAC_CONFIGURATION_FES,                                    /*!< 100Mbit/s, half-duplex */
    ENET_10M_FULLDUPLEX             = ENET_MAC_CONFIGURATION_DM,                                     /*!< 10Mbit/s, full-duplex */
    ENET_10M_HALFDUPLEX             = (uint32_t)0x00000000U,                                         /*!< 10Mbit/s, half-duplex */
    ENET_LOOPBACKMODE               = (ENET_MAC_CONFIGURATION_LM | ENET_MAC_CONFIGURATION_DM)        /*!< MAC in loopback mode at the MII */
} enet_mediamode_enum;
