sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* IP frame checksum function */
typedef enum {
    ENET_NO_AUTOCHECKSUM                = (uint32_t)0x00000000U,                             /*!< disable IP frame checksum function */
    ENET_AUTOCHECKSUM_DROP_FAILFRAMES   = ENET_MAC_CONFIGURATION_IPC,                        /*!< enable IP frame checksum function */
    ENET_AUTOCHECKSUM_ACCEPT_FAILFRAMES = (ENET_MAC_CONFIGURATION_IPC | ENET_MTL_RXQ0_OPERATION_MODE_DIS_TCP_EF | ENET_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF) /*!< enable IP frame checksum function, and the received frame
                                                                                                                                                                with only payload error but no other errors will not be dropped */
} enet_chksumconf_enum;

typedef enum {
    DMA_TX_OVER_RX   = 0U,                    /*!< Tx DMA has priority over the Rx DMA */
    DMA_RX_OVER_TX = 1U                       /*!< Rx DMA has priority over the Tx DMA */
} enet_dmapriority_enum;

typedef enum {
    ARBITRATION_RXTX_1_1 = ENET_ARBITRATION_RXTX_1_1,                   /*!< receive and transmit priority ratio is 1:1*/
    ARBITRATION_RXTX_2_1 = ENET_ARBITRATION_RXTX_2_1,                   /*!< receive and transmit priority ratio is 2:1*/
    ARBITRATION_RXTX_3_1 = ENET_ARBITRATION_RXTX_3_1,                   /*!< receive and transmit priority ratio is 3:1*/
    ARBITRATION_RXTX_4_1 = ENET_ARBITRATION_RXTX_4_1,                   /*!< receive and transmit priority ratio is 4:1*/
    ARBITRATION_RXTX_5_1 = ENET_ARBITRATION_RXTX_5_1,                   /*!< receive and transmit priority ratio is 5:1*/
    ARBITRATION_RXTX_6_1 = ENET_ARBITRATION_RXTX_6_1,                   /*!< receive and transmit priority ratio is 6:1*/
    ARBITRATION_RXTX_7_1 = ENET_ARBITRATION_RXTX_7_1,                   /*!< receive and transmit priority ratio is 7:1*/
    ARBITRATION_RXTX_8_1 = ENET_ARBITRATION_RXTX_8_1,                   /*!< receive and transmit priority ratio is 8:1*/
    ARBITRATION_TXRX_1_1 = ENET_ARBITRATION_TXRX_1_1,                   /*!< transmit and receive priority ratio is 1:1*/
    ARBITRATION_TXRX_2_1 = ENET_ARBITRATION_TXRX_2_1,                   /*!< transmit and receive priority ratio is 2:1*/
    ARBITRATION_TXRX_3_1 = ENET_ARBITRATION_TXRX_3_1,                   /*!< transmit and receive priority ratio is 3:1*/
    ARBITRATION_TXRX_4_1 = ENET_ARBITRATION_TXRX_4_1,                   /*!< transmit and receive priority ratio is 4:1*/
    ARBITRATION_TXRX_5_1 = ENET_ARBITRATION_TXRX_5_1,                   /*!< transmit and receive priority ratio is 5:1*/
    ARBITRATION_TXRX_6_1 = ENET_ARBITRATION_TXRX_6_1,                   /*!< transmit and receive priority ratio is 6:1*/
    ARBITRATION_TXRX_7_1 = ENET_ARBITRATION_TXRX_7_1,                   /*!< transmit and receive priority ratio is 7:1*/
    ARBITRATION_TXRX_8_1 = ENET_ARBITRATION_TXRX_8_1                    /*!< transmit and receive priority ratio is 8:1*/
} enet_dmapriorityratio_enum;

/* received frame filter function */
typedef enum {
    ENET_PROMISCUOUS_MODE           = ENET_MAC_PACKET_FILTER_PR,                             /*!< promiscuous mode enabled */
    ENET_RECEIVEALL                 = (int32_t)ENET_MAC_PACKET_FILTER_RA,                    /*!< all received frame are forwarded to application */
    ENET_BROADCAST_FRAMES_PASS      = (uint32_t)0x00000000U,                                 /*!< the address filters pass all received broadcast frames */
    ENET_BROADCAST_FRAMES_DROP      = ENET_MAC_PACKET_FILTER_DBF                             /*!< the address filters filter all incoming broadcast frames */
} enet_frmrecept_enum;

/* received frame filter function */
typedef enum {
    ENET_MISMATCH_ARP_PACKET_DROP_ENABLE = 0U,           /*!< packet for which target protocol address does not match IPv4 address is dropped in the MTL layer */
    ENET_MISMATCH_ARP_PACKET_DROP_DISABLE,               /*!< when target protocol address does not match, packet is forwarded to MTL maintaining backward compatibility */
    ENET_PACKET_DUPLICATION_ENABLE,                      /*!< the received packet with multicast/broadcast destination address is routed to multiple receive DMA channels */
    ENET_PACKET_DUPLICATION_DISABLE,                     /*!< the received packet with multicast/broadcast destination address is not routed to multiple receive DMA channels */
    ENET_USP_PACKET_DETECT_ENABLE,                       /*!< the MAC detects the slow protocol packets with unicast address of the station */
    ENET_USP_PACKET_DETECT_DISABLE,                      /*!< the MAC detects only slow protocol packets with the slow protocol multicast address specified in the IEEE 802.3-2015, Section 5 */
    ENET_SLOW_PROTOCOL_DETECT_ENABLE,                    /*!< MAC processes the slow protocol packets (Ether Type 0x8809) and provides the slow protocol sub-type and code fields in Rx status */
    ENET_SLOW_PROTOCOL_DETECT_DISABLE,                   /*!< the MAC forwards all error-free slow protocol packets to the application. The MAC considers such packets as normal Type packets */
    ENET_CRC_CHECK_ENABLE,                               /*!< the MAC receiver always checks the CRC field in the received packets */
    ENET_CRC_CHECK_DISABLE                               /*!< the MAC receiver does not check the CRC field in the received packets */
} enet_extend_macconfig_enum;

/* function option, used for ENET initialization */
typedef enum {
    FORWARD_OPTION                  = BIT(0),                                       /*!< configure the frame forward related parameters */
    DMABUS_OPTION                   = BIT(1),                                       /*!< configure the DMA bus mode related parameters */
    DMACH0_MAXBURST_OPTION          = BIT(2),                                       /*!< configure the DMA channel 0 max burst related parameters */
    DMACH1_MAXBURST_OPTION          = BIT(3),                                       /*!< configure the DMA channel 1 max burst related parameters */
    DMA_ARBITRATION_OPTION          = BIT(4),                                       /*!< configure the DMA arbitration related parameters */
    TX0STORE_OPTION                 = BIT(5),                                       /*!< configure the transmit queue 0 store forward mode related parameters */
    RX0STORE_OPTION                 = BIT(6),                                       /*!< configure the receive queue 0 store forward mode related parameters */
    TX1STORE_OPTION                 = BIT(7),                                       /*!< configure the transmit queue 1 store forward mode related parameters */
    RX1STORE_OPTION                 = BIT(8),                                       /*!< configure the receive queue 1 store forward mode related parameters */
    VLAN_CONFIG_OPTION              = BIT(9),                                       /*!< configure the VLAN tag related parameters */
    VLAN_COMPARISON_OPTION          = BIT(10),                                      /*!< configure the VLAN tag related parameters */
    VLAN_INSERT_OPTION              = BIT(11),                                      /*!< configure the VLAN tag insertion or replacement related parameters */
    INNERVLAN_INSERT_OPTION         = BIT(12),                                      /*!< configure the INNER VLAN tag insertion or replacement related parameters */
    FLOWCTL_OPTION                  = BIT(13),                                      /*!< configure the flow control related parameters */
    HASHH_OPTION                    = BIT(14),                                      /*!< configure the hash list high 32-bit related parameters */
    HASHL_OPTION                    = BIT(15),                                      /*!< configure the hash list low 32-bit related parameters */
    FILTER_OPTION                   = BIT(16),                                      /*!< configure the frame filter control related parameters */
    HALFDUPLEX_OPTION               = BIT(17),                                      /*!< configure the halfduplex related parameters */
    FULLDUPLEX_OPTION               = BIT(18),                                      /*!< configure the fullduplex related parameters */
    PACKETSIZE_OPTION               = BIT(19),                                      /*!< configure the packet size related parameters */
    TIMER_OPTION                    = BIT(20),                                      /*!< configure the frame timer related parameters */
    MACCONTROL_OPTION               = BIT(21),                                      /*!< configure the frame timer related parameters */
    INTERFRAMEGAP_OPTION            = BIT(22),                                      /*!< configure the inter frame gap related parameters */
    ECCCONTROL_OPTION               = BIT(23),                                      /*!< configure the ECC control related parameters */
    DPPCONTROL_OPTION               = BIT(24),                                      /*!< configure the DPP control related parameters */
    FSMCONTROL_OPTION               = BIT(25),                                      /*!< configure the FSM control related parameters */
    ESTCONTROL_OPTION               = BIT(26),                                      /*!< configure the EST control related parameters */
    FPECONTROL_OPTION               = BIT(27)                                       /*!< configure the FPE control related parameters */
} enet_option_enum;

