sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
typedef enum {
    MTL0 = 0U,                          /*!< MAC transaction layer 0 */
    MTL1 = 1U                           /*!< MAC transaction layer 1 */
} enet_mtl_enum;

typedef enum {
    RMII_MODE = 0U,                     /*!< MAC PHY interface in RMII mode */
    MII_MODE = 1U                       /*!< MAC PHY interface in MII mode */
} enet_modetype_enum;

typedef enum {
    MAC_LAYER_SPEED_10M = 0U,           /*!< MAC PHY interface in 10M speed */
    MAC_LAYER_SPEED_100M = 1U           /*!< MAC PHY interface in 100M speed */
} enet_speedtype_enum;

typedef enum {
    ENET_HALF_DUPLEX = 0U,             /*!< MAC PHY interface in half-duplex mode */
    ENET_FULL_DUPLEX = 1U              /*!< MAC PHY interface in full-duplex mode */
} enet_duplextype_enum;


typedef enum {
    DMA_MISS_FRAME_COUNT = 0U,         /*!< missed frame counter */
    DMA_ACCEPT_FRAME_COUNT = 1U        /*!< received frame counter */
} enet_dmacounter_enum;

typedef enum {
    RXQ0 = 0U,                        /*!< receive queue channel 0 */
    RXQ1 = 1U                         /*!< receive queue channel 1 */
} enet_rxq_enum;

typedef enum {
    PREEMPTION_PACKET = 0U,                     /*!< preemption packet */
    EXPRESS_PACKET = 1U                         /*!< express packet */
} enet_packet_type_enum;

typedef enum {
    TXQ0 = 0U,                        /*!< transmit queue 0 */
    TXQ1 = 1U                         /*!< transmit queue 1 */
} enet_txq_enum;


typedef enum {
    DMACH0 = 0U,                      /*!< DMA channel 0 */
    DMACH1 = 1U                       /*!< DMA channel 1 */
} enet_dmach_enum;

typedef enum {
    PARSABLE_ENTRY = 0U,              /*!< parsable entries in the Instruction table */
    VALID_ENTRY = 1U                  /*!< valid entries in the Instruction table */
} enet_entry_type_enum;

typedef enum {
    MTL_PAESER_BYPASS_COUNTER = 0U,              /*!< parsable bypass counter */
    MTL_PAESER_ERROR_COUNTER = 1U,               /*!< parsable error counter */
    MTL_PAESER_DROP_COUNTER = 2U                 /*!< parsable drop counter */
} enet_parser_counter_enum;

/* structure for initialization of the ENET  */
typedef struct {
    uint32_t option_enable;                                                         /*!< select which function to configure */
    uint32_t forward_frame;                                                         /*!< frame forward related parameters */
    uint32_t dmabus_mode;                                                           /*!< DMA bus mode related parameters */
    uint32_t dmach0_maxburst;                                                       /*!< DMA channel 0 max burst related parameters */
    uint32_t dmach1_maxburst;                                                       /*!< DMA channel 1 max burst related parameters */
    uint32_t dma_arbitration;                                                       /*!< DMA Tx and Rx arbitration related parameters */
    uint32_t tx0store_forward_mode;                                                 /*!< transmit queue 0 store forward mode related parameters */
    uint32_t rx0store_forward_mode;                                                 /*!< receive queue 0 store forward mode related parameters */
    uint32_t tx1store_forward_mode;                                                 /*!< transmit queue 1 store forward mode related parameters */
    uint32_t rx1store_forward_mode;                                                 /*!< receive queue 1 store forward mode related parameters */
    uint32_t dma_function;                                                          /*!< DMA control related parameters */
    uint32_t vlan_config;                                                           /*!< VLAN tag related parameters */
    uint32_t vlan_compare;                                                          /*!< VLAN tag filter related parameters */
    uint32_t vlan_insert;                                                           /*!< VLAN tag insertion related parameters */
    uint32_t innervlan_insert;                                                      /*!< INNER VLAN tag insertion related parameters */
    uint32_t flow_control;                                                          /*!< flow control related parameters */
    uint32_t hashtable_high;                                                        /*!< hash list high 32-bit related parameters */
    uint32_t hashtable_low;                                                         /*!< hash list low 32-bit related parameters */
    uint32_t framesfilter_mode;                                                     /*!< frame filter control related parameters */
    uint32_t halfduplex_param;                                                      /*!< halfduplex related parameters */
    uint32_t fullduplex_param;                                                      /*!< halfduplex related parameters */
    uint32_t packetsize_config;                                                     /*!< halfduplex related parameters */
    uint32_t timer_config;                                                          /*!< frame timer related parameters */
    uint32_t maccontrol_param;                                                      /*!< halfduplex related parameters */
    uint32_t interframegap;                                                         /*!< inter frame gap related parameters */
    uint32_t ecccontrol;                                                            /*!< ecc control related parameters */
    uint32_t dppcontrol;                                                            /*!< dpp control related parameters */
    uint32_t fsmcontrol;                                                            /*!< fsm control related parameters */
    uint32_t estcontrol;                                                            /*!< est control related parameters */
    uint32_t fpecontrol;                                                            /*!< fpe control related parameters */
} enet_initpara_struct;

