sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* receive queue enable configuration */
typedef enum {
    QUE_OP_MODE_DISABLE        = 0U,                                             /*!< Queue not enabled */
    QUE_OP_MODE_AVB_ENABLE     = 1U,                                             /*!< Queue enabled for Audio-Video Bridging */
    QUE_OP_MODE_ENABLE         = 2U                                              /*!< Queue enabled for Data Center Bridging or Generic Traffic */
} enet_queopmode_enum;

/* L3/L4 filter selection */
typedef enum {
    L3L4_FILTER0      = 0U,                                   /*!< L3/L4 filter 0 */
    L3L4_FILTER1      = 1U,                                   /*!< L3/L4 filter 1 */
    L3L4_FILTER2      = 2U,                                   /*!< L3/L4 filter 2 */
    L3L4_FILTER3      = 3U                                    /*!< L3/L4 filter 3 */
} enet_l3l4_filter_enum;


/* PPS selection */
typedef enum {
    PPS0      = 0U,                                   /*!< pulse-per-second output 0 */
    PPS1      = 1U,                                   /*!< pulse-per-second output 1 */
    PPS2      = 2U,                                   /*!< pulse-per-second output 2 */
    PPS3      = 3U                                    /*!< pulse-per-second output 3 */
} enet_pps_enum;

/* MCGR selection */
typedef enum {
    MCGR0      = 0U,                                  /*!< media clock generation and recovery 0 */
    MCGR1      = 1U,                                  /*!< media clock generation and recovery 1 */
    MCGR2      = 2U,                                  /*!< media clock generation and recovery 2 */
    MCGR3      = 3U                                   /*!< media clock generation and recovery 3 */
} enet_mcgr_enum;

/* the Tx scheduling algorithm */
typedef enum {
    STRICT_PRIORITY_TX        = ENET_TX_SCHEDULING_ALGO_SP,                     /*!< SP arbitration mode */
    WEIGHTED_ROUND_ROBIN      = ENET_TX_SCHEDULING_ALGO_WRR                     /*!< WRR arbitration mode */
} enet_txqalgotype_enum;

/* the Rx scheduling algorithm */
typedef enum {
    STRICT_PRIORITY_RX            =  MTL_OPERATION_MODE_RAA(0U),               /*!< SP arbitration mode */
    WEIGHTED_STRICT_PRIORITY      =  MTL_OPERATION_MODE_RAA(1U)                /*!< WRR arbitration mode */
} enet_rxqalgotype_enum;

/* the DMA transmit arbitration algorithm */
typedef enum {
    FIXED_PRIORITY_DMA_TX             = ENET_TX_CHANNEL_ARBITRATION_FP,                /*!< FP arbitration mode */
    WEIGHTED_STRICT_PRIORITY_DMA_TX   = ENET_TX_CHANNEL_ARBITRATION_WSP,               /*!< weighted strict priority arbitration mode */
    WEIGHTED_ROUND_ROBIN_DMA_TX       = ENET_TX_CHANNEL_ARBITRATION_WRR                /*!< WRR arbitration mode */
} enet_dmaalgotype_enum;

/* the DMA scheduling algorithm */
typedef enum {
    FIXED_PRIORITY_DMA_SCHEME            = ENET_TXRX_FP,                         /*!< FP arbitration scheme */
    WEIGHTED_ROUND_ROBIN_DMA_SCHEME      = ENET_TXRX_WRR                         /*!< WRR arbitration scheme */
} enet_dmaarbi_scheme_enum;

/* Tx threshold level configuration */
typedef enum {
    TX_THRESHOLD_32BYTES      = 0U,                   /*!< threshold level is 32 Bytes */
    TX_THRESHOLD_64BYTES      = 1U,                   /*!< threshold level is 64 Bytes */
    TX_THRESHOLD_96BYTES      = 2U,                   /*!< threshold level is 96 Bytes */
    TX_THRESHOLD_128BYTES     = 3U,                   /*!< threshold level is 128 Bytes */
    TX_THRESHOLD_192BYTES     = 4U,                   /*!< threshold level is 192 Bytes */
    TX_THRESHOLD_256BYTES     = 5U,                   /*!< threshold level is 256 Bytes */
    TX_THRESHOLD_284BYTES     = 6U,                   /*!< threshold level is 284 Bytes */
    TX_THRESHOLD_512BYTES     = 7U                    /*!< threshold level is 512 Bytes */
} enet_txqthresholdtype_enum;

/* TxFIFO operation mode */
typedef enum {
    TX_MODE_CUTTHROUGH      = 0U,                     /*!< TxFIFO operates in cut-through mode */
    TX_MODE_STOREFORWARD    = 1U                      /*!< TxFIFO operates in store-and-forward mode */
} enet_txqmodetype_enum;

/* LPI timer selection */
typedef enum {
    LPI_LS_TIMER      = 0U,                           /*!< specifie the minimum time (in milliseconds) for which the link status from the PHY should be up */
    LPI_TW_TIMER      = 1U,                           /*!< specifies the minimum time (in microseconds) for which the MAC waits after it stops transmitting the LPI pattern to the PHY */
    LPI_ENTRY_TIMER   = 2U                            /*!< specifies the time in microseconds the MAC waits to enter LPI mode */
} enet_lpitimer_enum;

/* select the FSM and Interface Timeout type */
typedef enum {
    ENET_LARGE_MODE_TIMEOUT           = 0U,           /*!< Large Mode Timeout Value */
    ENET_NORMAL_MODE_TIMEOUT          = 1U,           /*!< Normal Mode Timeout Value */
    ENET_CSR_CLOCK_VAL                = 2U            /*!< CSR Clocks for 1us Tic */
} enet_fsmtimeout_enum;

/* Rx threshold level configuration */
typedef enum {
    RX_THRESHOLD_32BYTES     = 0U,                   /*!< threshold level is 32 Bytes */
    RX_THRESHOLD_64BYTES     = 1U,                   /*!< threshold level is 64 Bytes */
    RX_THRESHOLD_96BYTES     = 2U,                   /*!< threshold level is 96 Bytes */
    RX_THRESHOLD_128BYTES    = 3U                    /*!< threshold level is 128 Bytes */
} enet_rxqthresholdtype_enum;

/* RxFIFO operation mode */
typedef enum {
    RX_MODE_CUTTHROUGH      = 0U,                    /*!< RxFIFO operates in cut-through mode */
    RX_MODE_STOREFORWARD    = 1U                     /*!< RxFIFO operates in store-and-forward mode */
} enet_rxqmodetype_enum;

/* PHY operation direction select */
typedef enum {
    ENET_PHY_READ           = 0U,                    /*!< read PHY */
    ENET_PHY_WRITE          = 1U                     /*!< write PHY */
} enet_phydirection_enum;

/* ENET initialization related parameters */
typedef enum {
    ENET_MAC_INIT_STRUCT          = 0U,               /*!< ENET MAC initiliaze parameters struct */
    ENET_DMA_CH0_INIT_STRUCT      = 1U,               /*!< ENET DMA channel 0 initiliaze parameters struct */
    ENET_DMA_CH1_INIT_STRUCT      = 2U,               /*!< ENET DMA channel 0 initiliaze parameters struct */
    ENET_MTL0_INIT_STRUCT         = 3U,               /*!< ENET MTL0 initiliaze parameters struct */
    ENET_MTL1_INIT_STRUCT         = 4U,               /*!< ENET MTL1 initiliaze parameters struct */
    ENET_TXQ1_CBS_INIT_STRUCT     = 5U,               /*!< ENET TX queue1 CBS initiliaze parameters struct */
    ENET_PHY_CFG_INIT_STRUCT      = 6U,               /*!< ENET PHY config initiliaze parameters struct */
    ENET_EST_CFG_INIT_STRUCT      = 7U,               /*!< ENET EST config initiliaze parameters struct */
    ENET_GCL_CFG_INIT_STRUCT      = 8U,               /*!< ENET GCL config initiliaze parameters struct */
    ENET_FPE_CFG_INIT_STRUCT      = 9U                /*!< ENET FPE config initiliaze parameters struct */
} enet_struct_type_enum;

/* ENET initialization related parameters */
typedef enum {
    INT_MODE0      = ENET_INTERRUPT_MODE0,            /*!< interrupt mode 0 */
    INT_MODE1      = ENET_INTERRUPT_MODE1,            /*!< interrupt mode 1 */
    INT_MODE2      = ENET_INTERRUPT_MODE2,            /*!< interrupt mode 2 */
} enet_dma_intmode_enum;

/* ENET one-step timestamp related parameters */
typedef enum {
    TIMESTAMP_EGRESS      = 0U,                       /*!< timestamp egress */
    TIMESTAMP_INGRESS     = 1U                        /*!< timestamp ingress */
} enet_timestamp_type_enum;

