sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
typedef enum {
    LATENCY_NANOSECOND      = 0U,                     /*!< timestamp egress */
    LATENCY_SUBNANOSECOND   = 1U                      /*!< timestamp ingress */
} enet_timestamp_latency_enum;

/* ENET initialization related parameters */
typedef enum {
    MAC_AV_TAG_PACKET_QUEUE          = 0U,            /*!< AV untagged control packets queue */
    MAC_PTP_PACKET_QUEUE             = 4U,            /*!< PTP packets queue */
    MAC_UNTAGGED_PACKET_QUEUE        = 12U,           /*!< untagged packet queue */
    MAC_MULTI_BROAD_PACKET_QUEUE     = 16U,           /*!< multicast and broadcast queue */
    MAC_FPE_RESIDUE_PACKET_QUEUE     = 24U            /*!< frame preemption residue queue */
} enet_frame_type_enum;

/* ENET MTL GCL list related parameters */
typedef enum {
    GCL_LIST0          = 0U,                          /*!< Gate control list number 0 */
    GCL_LIST1          = 1U                           /*!< Gate control list number 1 */
} enet_gcl_enum;

/* ENET MTL EST error related parameters */
typedef enum {
    SCHEDULE_ERROR          = 0U,                     /*!< schedule error */
    FRAME_SIZE_ERROR        = 1U                      /*!< frame size error */
} enet_est_error_enum;

/* structure for phy configuration */
typedef struct {
    uint8_t PhyAddr;                                  /*!< the phy address */
    uint16_t RegAddr;                                 /*!< the phy register address */
    uint16_t DevAddr;                                 /*!< the device address */
    uint16_t PhyValue;                                /*!< the value of phy */
} enet_phyconfig_struct;

/* structure for EST configuration */
typedef struct {
    uint32_t BTRinsecond;                            /*!< the second value of base time */
    uint32_t BTRinnanosecond;                        /*!< the nanosecond value of base time */
    uint32_t CTRinsecond;                            /*!< the second value of cycle time */
    uint32_t CTRinnanosecond;                        /*!< the nanosecond value of cycle time */
    uint32_t TERtime;                                /*!< the value of extension time */
    uint16_t LLRdepth;                               /*!< the value of list length */
} enet_ESTConfig_struct;

/* structure for FPE configuration */
typedef struct {
    ControlStatus FPEenable;                         /*!< configure the FPE function to make it possible */
    uint32_t Relasetime;                             /*!< the value of relase time */
    uint16_t Holdtime;                               /*!< the value of hold time */
} enet_FPEConfig_struct;

/* structure for FPE configuration */
typedef struct {
    uint8_t Ctrlconfig;                              /*!< configure the gate control */
    uint32_t Ethtimeinterval;                        /*!< the value of time interval */
} enet_GCLConfig_struct;

/* structure for CBS configuration */
typedef struct {
    uint32_t IdleSlopeCredit;                        /*!< the value of idleSlopeCredit */
    uint32_t SendSlopeCredit;                        /*!< the value of sendSlopeCredit, */
    uint32_t loCredit;                               /*!< the value of loCredit */
    uint32_t HiCredit;                               /*!< the value of hiCredit */
    ControlStatus CreditControl;                     /*!< the configuration of Credit control */
} enet_cbs_config_struct;

/* structure for MTL configuration */
typedef struct {
    enet_txqalgotype_enum TxqAlgo;                   /*!< the Tx scheduling algorithm */
    enet_txqthresholdtype_enum Txqthreshold;         /*!< the threshold of Tx queue */
    enet_txqmodetype_enum Txqforwardmode;            /*!< the forward mode of Tx queue */
    uint32_t Txweight;                               /*!< the weight of Tx queue */
    uint32_t Txprioritysel;                          /*!< the priority selection of Tx queue */
    enet_queopmode_enum Txqmode;                     /*!< the mode of Tx queue */
    enet_rxqalgotype_enum RxqAlgo;                   /*!< the Rx scheduling algorithm */
    enet_rxqthresholdtype_enum Rxqthreshold;         /*!< the threshold of Rx queue */
    enet_rxqmodetype_enum Rxqforwardmode;            /*!< the forward mode of Rx queue */
    uint32_t Rxweight;                               /*!< the weight of Rx queue */
    uint32_t Rxprioritysel;                          /*!< the priority selection of Rx queue */
    enet_queopmode_enum Rxqmode;                     /*!< the mode of Rx queue */
    enet_dmach_enum dmachsel;                        /*!< the DMA channel selection of queue */
} enet_mtl_config_struct;

/* structure for DMA configuration */
typedef struct {
    enet_dma_intmode_enum interruptmode;             /*!< the DMA interrupt mode */
    uint8_t addrbeats;                               /*!< the configuration of address beats */
    uint32_t burstlength;                            /*!< the burst length */
    uint32_t bufsize;                                /*!< the buffer size */
    enet_dmapriorityratio_enum priorityratio;        /*!< the DMA priority ratio */
    enet_dmaalgotype_enum DmaTxAlgo;                 /*!< the Tx scheduling algorithm */
    enet_dmaarbi_scheme_enum DmaScheme;              /*!< the threshold of Tx queue */
} enet_dma_config_struct;

/* structure for MAC configuration */
typedef struct {
    enet_speedtype_enum Speedstatus;                 /*!< the speed selection of MAC PHY interface */
    enet_duplextype_enum Duplexstatus;               /*!< the duplex selection of MAC PHY interface */
    uint32_t MacConfig;                              /*!< the configuration of MAC */
    uint32_t FilterConfig;                           /*!< the configuration of MAC filter */
    uint32_t Txqflowctrl;                            /*!< the configuration of TXQ0 flow control */
} enet_mac_config_struct;                     

/* structure for ENET DMA desciptors */
typedef struct {
    uint32_t DES0;                                   /*!< the ENET DMA desciptors 0 */
    uint32_t DES1;                                   /*!< the ENET DMA desciptors 1 */
    uint32_t DES2;                                   /*!< the ENET DMA desciptors 2 */
    uint32_t DES3;                                   /*!< the ENET DMA desciptors 3 */
    uint32_t buffer_address;                         /*!< store the buffer address */
    uint32_t bkp_info;                               /*!< backup infomation */
} enet_descriptors_struct;

