sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* structure for ENET DMA enhanced desciptors */
typedef struct {
    uint32_t ETDES0;                                 /*!< the ENET DMA enhanced desciptors 0 */
    uint32_t ETDES1;                                 /*!< the ENET DMA enhanced desciptors 1 */
    uint32_t ETDES2;                                 /*!< the ENET DMA enhanced desciptors 2 */
    uint32_t ETDES3;                                 /*!< the ENET DMA enhanced desciptors 3 */
    uint32_t DES0;                                   /*!< the ENET DMA desciptors 0 */
    uint32_t DES1;                                   /*!< the ENET DMA desciptors 1 */
    uint32_t DES2;                                   /*!< the ENET DMA desciptors 2 */
    uint32_t DES3;                                   /*!< the ENET DMA desciptors 3 */
    uint32_t buffer_address;
    uint32_t reversed;
} enet_tbs_enhanced_descriptors_struct;

/* dma direction select */
typedef enum {
    ENET_DMA_TX      = ENET_DMA_DEBUG_STATUS0_TPS0,  /*!< DMA transmit direction */
    ENET_DMA_RX      = ENET_DMA_DEBUG_STATUS0_RPS0   /*!< DMA receive direction */
} enet_dmadirection_enum;

/* mtl receive queue debug related stste select */
typedef enum {
    RXQ_FILL_LEVEL_STATE          = ENET_MTL_RXQ0_DEBUG_RXQSTS,                  /*!< MTL Rx queue fill-level status */
    RXQ_READ_CONTROLLER_STATE     = ENET_MTL_RXQ0_DEBUG_RRCSTS,                  /*!< MTL Rx queue read controller state */
    RXQ_WRITE_CONTROLLER_STATE    = ENET_MTL_RXQ0_DEBUG_RWCSTS                   /*!< MTL Rx queue write controller active status */
} enet_mtl_rxq_state_enum;

/* mtl transmit queue debug related stste select */
typedef enum {
    TXQ_FIFO_FULL_STATE           = ENET_MTL_TXQ0_DEBUG_TXSTSFSTS,               /*!< MTL Tx status FIFO full status */
    TXQ_NOT_EMPTY_STATE           = ENET_MTL_TXQ0_DEBUG_TXQSTS,                  /*!< MTL Tx queue not empty status */
    TXQ_WRITE_CONTROLLER_STATE    = ENET_MTL_TXQ0_DEBUG_TWCSTS,                  /*!< MTL Tx queue write controller status */
    TXQ_READ_CONTROLLER_STATE     = ENET_MTL_TXQ0_DEBUG_TRCSTS,                  /*!< MTL Tx queue read controller status */
    TXQ_IN_PAUSE_STATE            = ENET_MTL_TXQ0_DEBUG_TXQPAUSED                /*!< transmit queue in pause */
} enet_mtl_txq_state_enum;


/* register group value get */

typedef enum {
    ALL_MAC_REG                     = 0U,                                            /*!< MAC register group */
    ALL_MTL_REG                     = 190U,                                          /*!< MTL register group */
    ALL_MTL_Q0_REG                  = 224U,                                          /*!< MTL queue 0 register group */
    ALL_MTL_Q1_REG                  = 234U,                                          /*!< MTL queue 1 register group */
    ALL_DMA_REG                     = 248U,                                          /*!< DMA register group */
    ALL_DMA_CH0_REG                 = 254U,                                          /*!< DMA channel 0 register group */
    ALL_DMA_CH1_REG                 = 273U,                                          /*!< DMA channel 1 register group */
} enet_registers_type_enum;

typedef enum {
    ENET_CKNT_END_TO_END_0                            = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(0),      /*!< type of end-to-end transparent clock node type for timestamp */
    ENET_CKNT_ORDINARY_BOUNDARY_SLAVE                 = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(0)\
            | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA,                                               /*!< type of ordinary or boundary slave clock node type for timestamp */
    ENET_CKNT_ORDINARY_BOUNDARY_MASTER                = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(0) \
            | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA \
            | ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA,                                               /*!< type of ordinary or boundary master clock node type for timestamp */
    ENET_CKNT_END_TO_END_PEER_DELAY                   = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(1),      /*!< type of End-to-End Transparent with support for peer delay clock node type for timestamp */
    ENET_CKNT_ORDINARY_BOUNDARY_SLAVE_PEER_TO_PEER    = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(1)\
            | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA,                                               /*!< type of Ordinary or Boundary Slave with support for peer delay mechanism or Peer to Peer Transpare clock node type for timestamp */
    ENET_CKNT_ORDINARY_BOUNDARY_MASTER_PEER_DELAY     = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(1) \
            | ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA \
            | ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA,                                                /*!< type of Ordinary or BoundaryMaster with support for peer delay clock node type for timestamp */
    ENET_CKNT_END_TO_END              = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(2),                       /*!< type of end-to-end transparent clock node type for timestamp */
    ENET_CKNT_PEER_TO_PEER            = MAC_TIMESTAMP_CONTROL_SNAPTYPSEL(3),                       /*!< type of peer-to-peer transparent clock node type for timestamp */
    ENET_PTP_SYSTIME_INIT             = ENET_MAC_TIMESTAMP_CONTROL_TSINIT,                         /*!< timestamp initialize */
    ENET_PTP_SYSTIME_UPDATE           = ENET_MAC_TIMESTAMP_CONTROL_TSUPDT,                         /*!< timestamp update */
    ENET_PTP_ADDEND_UPDATE            = ENET_MAC_TIMESTAMP_CONTROL_TSADDREG,                       /*!< addend register update */
    ENET_PTP_FINEMODE                 = (int32_t)(ENET_MAC_TIMESTAMP_CONTROL_TSCFUPDT | BIT(31)),  /*!< the system timestamp uses the fine method for updating */
    ENET_PTP_COARSEMODE               = ENET_MAC_TIMESTAMP_CONTROL_TSCFUPDT,                       /*!< the system timestamp uses the coarse method for updating */
    ENET_SUBSECOND_DIGITAL_ROLLOVER   = (int32_t)(ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR | BIT(31)), /*!< digital rollover mode */
    ENET_SUBSECOND_BINARY_ROLLOVER    = ENET_MAC_TIMESTAMP_CONTROL_TSCTRLSSR,                      /*!< binary rollover mode */
    ENET_SNOOPING_PTP_VERSION_2       = (int32_t)(ENET_MAC_TIMESTAMP_CONTROL_TSVER2ENA | BIT(31)), /*!< version 2 */
    ENET_SNOOPING_PTP_VERSION_1       = ENET_MAC_TIMESTAMP_CONTROL_TSVER2ENA,                      /*!< version 1 */
    ENET_EVENT_TYPE_MESSAGES_SNAPSHOT = (int32_t)(ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA | BIT(31)), /*!< only event type messages are taken snapshot */
    ENET_ALL_TYPE_MESSAGES_SNAPSHOT   = (ENET_MAC_TIMESTAMP_CONTROL_TSEVNTENA | BIT(30)),          /*!< all type messages are taken snapshot except announce, management and signaling message */
    ENET_MASTER_NODE_MESSAGE_SNAPSHOT = (int32_t)(ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA | BIT(31)), /*!< snapshot is only take for master node message */
    ENET_SLAVE_NODE_MESSAGE_SNAPSHOT  = ENET_MAC_TIMESTAMP_CONTROL_TSMSTRENA,                      /*!< snapshot is only taken for slave node message */
} enet_ptp_function_enum;

