sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* structure of PTP system time */
typedef struct {
    uint32_t secondHi;                                                              /*!< The 16 leastmost significant bits of the 48 bits second of system time */
    uint32_t second;                                                                /*!< The 32 least significant bits of the 48 bits second of system time */
    uint32_t subsecond;                                                             /*!< subsecond of system time */
} enet_ptp_systime_struct;

/* ENET remote wake-up frame register (MAC_RWK_Packet_Filter) length */
#define ENET_WAKEUP_PACKET_REGISTER_LENGTH                8U                        /*!< remote wake-up frame register (MAC_RWK_Packet_Filter) length */

/* MAC_PMT_CONTROL_STATUS register value */
#define GET_MAC_PMT_CONTROL_RWKPTR(regval)       GET_BITS((uint32_t)(regval),24,28)             /*!< get value of MAC_PMT_CONTROL_STATUS_RWKPTR bit field */
#define MAC_PMT_CONTROL_RWKFILTRST               ENET_MAC_PMT_CONTROL_STATUS_RWKFILTRST         /*!< wakeup frame filter register poniter reset */
#define MAC_PMT_STATUS_RWKPRCVD                  ENET_MAC_PMT_CONTROL_STATUS_RWKPRCVD           /*!< wakeup frame received */
#define MAC_PMT_STATUS_MGKPRCVD                  ENET_MAC_PMT_CONTROL_STATUS_MGKPRCVD           /*!< magic packet received */
#define MAC_PMT_POWER_DOWN                       ENET_MAC_PMT_CONTROL_STATUS_PWRDWN             /*!< power down mode */
#define MAC_PMT_MAGIC_PACKET_FRAME               ENET_MAC_PMT_CONTROL_STATUS_MGKPKTEN           /*!< enable a wakeup event due to magic packet reception */
#define MAC_PMT_WAKE_UP_FRAME                    ENET_MAC_PMT_CONTROL_STATUS_RWKPKTEN           /*!< enable a wakeup event due to wakeup frame reception */
#define MAC_PMT_WAKE_UP_FRAME_FORWARD            ENET_MAC_PMT_CONTROL_STATUS_RWKPFE             /*!< enable remote wakeup frame forwarding */
#define MAC_PMT_GLOBAL_UNICAST                   ENET_MAC_PMT_CONTROL_STATUS_GLBLUCAST          /*!< any received unicast frame passed filter is considered to be a wakeup frame */

/* MAC_LPI_Control_Status register value */
#define ENET_LPI_TXCLK_STOP_ENABLE                ENET_MAC_LPI_CONTROL_STATUS_LPITCSE           /*!< LPI Tx clock stop is enabled */
#define ENET_LPI_TXCLK_STOP_DISABLE               ((uint32_t)0x00000000U)                       /*!< LPI Tx clock stop is disabled */
#define ENET_LPI_TXCLK_STOP                       ENET_LPI_TXCLK_STOP_ENABLE                    /*!< LPI Tx clock stop is enabled */
#define ENET_LPI_TIMER_ENABLE                     ENET_MAC_LPI_CONTROL_STATUS_LPIATE            /*!< LPI timer is enabled */
#define ENET_LPI_TIMER_DISABLE                    ((uint32_t)0x00000000U)                       /*!< LPI timer is disabled */
#define ENET_LPI_TIMER                            ENET_LPI_TIMER_ENABLE                         /*!< LPI timer is enabled */
#define ENET_LPI_TXAUTOMATE_ENABLE                ENET_MAC_LPI_CONTROL_STATUS_LPITXA            /*!< LPI Tx automate is enabled */
#define ENET_LPI_TXAUTOMATE_DISABLE               ((uint32_t)0x00000000U)                       /*!< LPI Tx automate is disabled */
#define ENET_LPI_TXAUTOMATE                       ENET_LPI_TXAUTOMATE_ENABLE                    /*!< LPI Tx automate is enabled */
#define ENET_LPI_PHYLINK_UP                       ENET_MAC_LPI_CONTROL_STATUS_PLS               /*!< link is okay (UP) */
#define ENET_LPI_PHYLINK_DOWN                     ((uint32_t)0x00000000U)                       /*!< link is down */
#define ENET_LPI_ENABLE                           ENET_MAC_LPI_CONTROL_STATUS_LPIEN             /*!< it instructs the MAC transmitter to enter the LPI state */
#define ENET_LPI_DISABLE                          ((uint32_t)0x00000000U)                       /*!< it instructs the MAC to exit the LPI state and resume normal transmission */
#define ENET_LPI_TRANSMIT_AUTO_ENTRY              (ENET_MAC_LPI_CONTROL_STATUS_LPIEN|ENET_LPI_TXAUTOMATE_ENABLE)          /*!< the MAC enters the LPI mode only after all outstanding packetsand pending packets have been transmitted */
#define ENET_LPI_TRANSMIT_AUTO_ENTRY_WITH_TIMER   (ENET_MAC_LPI_CONTROL_STATUS_LPIATE | ENET_MAC_LPI_CONTROL_STATUS_LPIEN|ENET_LPI_TXAUTOMATE_ENABLE)      /*!< the MAC transmitter enters LPI state only when the complete MAC TX data path is IDLE for a period indicated by the MAC_LPI_Entry_Timer register */

#define ENET_LPI_RX_STATE             ENET_MAC_LPI_CONTROL_STATUS_RLPIST                            /*!< receive LPI state */
#define ENET_LPI_TX_STATE             ENET_MAC_LPI_CONTROL_STATUS_TLPIST                            /*!< transmit LPI state */
#define ENET_LPI_RX_EXIT              ENET_MAC_LPI_CONTROL_STATUS_RLPIEX                            /*!< receive LPI exit */
#define ENET_LPI_RX_ENTRY             ENET_MAC_LPI_CONTROL_STATUS_RLPIEN                            /*!< receive LPI entry */
#define ENET_LPI_TX_EXIT              ENET_MAC_LPI_CONTROL_STATUS_TLPIEX                            /*!< transmit LPI exit */
#define ENET_LPI_TX_ENTRY             ENET_MAC_LPI_CONTROL_STATUS_TLPIEN                            /*!< transmit LPI entry */

/* MAC_VLAN_TAG_DATA register value */
#define ENET_VLANTAGCOMPARISON_INNER              ENET_MAC_VLAN_TAG_DATA_ERIVLT                  /*!< enable inner VLAN tag comparison */
#define ENET_VLANTAGCOMPARISON_OUTER              ((uint32_t)0x00000000U)                        /*!< enable outer VLAN tag comparison */
#define ENET_SVLANTAGMATCH_ENABLE                 ENET_MAC_VLAN_TAG_DATA_ERSVLM                  /*!< enable S-VLAN match for received frames */
#define ENET_SVLANTAGMATCH_DISABLE                ((uint32_t)0x00000000U)                        /*!< disable S-VLAN match for received frames */
#define ENET_VLANTYPECOMPARISON_ENABLE            ((uint32_t)0x00000000U)                        /*!< enable VLAN type comparison */
#define ENET_VLANTYPECOMPARISON_DISABLE           ENET_MAC_VLAN_TAG_DATA_DOVLTC                  /*!< disable VLAN type comparison */
#define ENET_VLANTAGCOMPARISON_12BIT              ENET_MAC_VLAN_TAG_DATA_ETV                     /*!< only low 12 bits of the VLAN tag are used for comparison */
#define ENET_VLANTAGCOMPARISON_16BIT              ((uint32_t)0x00000000U)                        /*!< all 16 bits of the VLAN tag are used for comparison */
#define ENET_VLANTAGCOMPARISON_ENABLE             ENET_MAC_VLAN_TAG_DATA_VEN                     /*!< VLAN tag enable */
#define ENET_VLANTAGCOMPARISON_DISABLE            ((uint32_t)0x00000000U)                        /*!< VLAN tag disable */



/* MAC_VLAN_INCL register value */
#define MAC_VLAN_INCL_VLT(regval)                        (BITS(0,15) & ((uint32_t)(regval) << 0))
#define MAC_VLAN_INCL_VLC(regval)                        (BITS(16,17) & ((uint32_t)(regval) << 16))
#define ENET_VLANTAG_INSERT_CHANNEL_BASED_ENABNLE        ENET_MAC_VLAN_INCL_CBTI                            /*!< outer VLAN tag is inserted for every packets transmitted by the MAC.*/
#define ENET_VLANTAG_INSERT_CHANNEL_BASED_DISABNLE       ((uint32_t)0x00000000U)                            /*!< outer VLAN operation is based on the setting of VLTI, VLP, VLC and VLT fields of this register*/
#define ENET_VLANTAG_FROM_DES                            ENET_MAC_VLAN_INCL_VLTI                            /*!< VLAN Tag Input is enabled */
#define ENET_VLANTAG_FROM_REG                            ((uint32_t)0x00000000U)                            /*!< VLAN Tag Input is disabled */
#define ENET_VLANTAG_INSERT_REPLACE_SVLAN                ENET_MAC_VLAN_INCL_CSVL                            /*!< C-VLAN type (0x8100) is inserted or replaced */
#define ENET_VLANTAG_INSERT_REPLACE_CVLAN                ((uint32_t)0x00000000U)                            /*!< S-VLAN type (0x88A8) is inserted or replaced */
#define ENET_VLANTAG_PRIORITY_ENABLE                     ENET_MAC_VLAN_INCL_VLP                             /*!< VLAN Priority Control is enabled */
#define ENET_VLANTAG_PRIORITY_DISABLE                    ((uint32_t)0x00000000U)                            /*!< VLAN Priority Control is disabled */
#define ENET_VLANTAG_NO_OPERATIOM                        MAC_VLAN_INCL_VLC(0)                               /*!< No VLAN tag deletion, insertion, or replacement */
#define ENET_VLANTAG_DELETION                            MAC_VLAN_INCL_VLC(1)                               /*!< VLAN tag deletion */
#define ENET_VLANTAG_INSERTATION                         MAC_VLAN_INCL_VLC(2)                               /*!< VLAN tag insertion */
#define ENET_VLANTAG_REPLACEMENT                         MAC_VLAN_INCL_VLC(3)                               /*!< VLAN tag replacement */

/* MAC_INNER_VLAN_INCL register value */
#define MAC_INNER_VLAN_TAG_DATA_VID(regval)              (BITS(0,15) & ((uint32_t)(regval) << 0))           /*!< VLAN tag ID */

#define MAC_INNER_VLAN_INCL_VLC(regval)                  (BITS(16,17) & ((uint32_t)(regval) << 16))
#define ENET_INNER_VLANTAG_FROM_DES                       ENET_MAC_INNER_VLAN_INCL_VLTI                     /*!< Inner VLAN Tag Input is enabled */
#define ENET_INNER_VLANTAG_FROM_REG                      ((uint32_t)0x00000000U)                            /*!< Inner VLAN Tag Input is disabled */
#define ENET_INNER_VLANTAG_INSERT_REPLACE_SVLAN           ENET_MAC_INNER_VLAN_INCL_CSVL                     /*!< Inner C-VLAN type (0x8100) is inserted or replaced */
#define ENET_INNER_VLANTAG_INSERT_REPLACE_CVLAN          ((uint32_t)0x00000000U)                            /*!< Inner S-VLAN type (0x88A8) is inserted or replaced */
#define ENET_INNER_VLANTAG_PRIORITY_ENABLE                ENET_MAC_INNER_VLAN_INCL_VLP                      /*!< Inner VLAN Priority Control is enabled */
#define ENET_INNER_VLANTAG_PRIORITY_DISABLE              ((uint32_t)0x00000000U)                            /*!< Inner VLAN Priority Control is disabled */
#define ENET_INNER_VLANTAG_NO_OPERATIOM                   MAC_INNER_VLAN_INCL_VLC(0)                        /*!< No Inner VLAN tag deletion, insertion, or replacement */
#define ENET_INNER_VLANTAG_DELETION                       MAC_INNER_VLAN_INCL_VLC(1)                        /*!< Inner VLAN tag deletion */
#define ENET_INNER_VLANTAG_INSERTATION                    MAC_INNER_VLAN_INCL_VLC(2)                        /*!< Inner VLAN tag insertion */
#define ENET_INNER_VLANTAG_REPLACEMENT                    MAC_INNER_VLAN_INCL_VLC(3)                        /*!< Inner VLAN tag replacement */

