sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* MAC_CONFIGURATION register value */
#define MAC_CONFIGURATION_FES(regval)                     (BIT(14) & ((uint32_t)(regval) << 14))            /*!< write value to MAC_CONFIGURATION_FES bit field */
#define MAC_CONFIGURATION_DM(regval)                      (BIT(13) & ((uint32_t)(regval) << 13))            /*!< write value to MAC_CONFIGURATION_FDM bit field */

/* MTL_RXQ_OPERATION_MODE register value */
#define MTL_RXQ_OPERATION_MODE_RSF(regval)                      (BIT(5) & ((uint32_t)(regval) << 5))        /*!< write value to MTL_TXQ_OPERATION_MODE_RSF bit field */


/* MTL_TXQ_OPERATION_MODE register value */
#define MTL_TXQ_OPERATION_MODE_TXQEN(regval)      (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define MTL_TXQ_OPERATION_MODE_TSF(regval)        (BIT(1) & ((uint32_t)(regval) << 1))                      /*!< write value to MTL_TXQ_OPERATION_MODE_TSF bit field */


#define MAC_RXQ_CTRL0_RXQ0EN(regval)              (BITS(0,1) & ((uint32_t)(regval) << 0U))                  /*!< write value to MAC_RXQ_CTRL0_RXQ0EN bit field */
#define MAC_RXQ_CTRL0_RXQ1EN(regval)              (BITS(2,3) & ((uint32_t)(regval) << 2U))                  /*!< write value to MAC_RXQ_CTRL0_RXQ1EN bit field */
#define MAC_RXQ_CTRL2_PSRQ0(regval)               (BITS(0,7) & ((uint32_t)(regval) << 0U))                  /*!< write value to MAC_RXQ_CTRL2_PSRQ0 bit field */
#define MAC_RXQ_CTRL2_PSRQ1(regval)               (BITS(8,15) & ((uint32_t)(regval) << 8U))                 /*!< write value to MAC_RXQ_CTRL2_PSRQ1 bit field */

/* DMA_DEBUG_STATUS0 register value */
#define ENET_RX_STATE_STOPPED                     ((uint32_t)0x00000000)                        /*!< reset or stop rx command issued */
#define ENET_RX_STATE_FETCHING                    BIT(8)                                        /*!< fetching the Rx descriptor */
#define ENET_RX_STATE_WAITING                     (BIT(8)|BIT(9))                               /*!< waiting for receive packet */
#define ENET_RX_STATE_SUSPENDED                   BIT(10)                                       /*!< Rx descriptor unavailable */
#define ENET_RX_STATE_CLOSING                     (BIT(8)|BIT(10))                              /*!< closing receive descriptor */
#define ENET_RX_STATE_WRITING                     (BIT(9)|BIT(10))                              /*!< writing timestamp */
#define ENET_RX_STATE_QUEUING                     (BIT(8)|BIT(9)|BIT(10))                       /*!< transferring the receive packet data from recevie buffer to host memory */

#define ENET_TX_STATE_STOPPED                     ((uint32_t)0x00000000)                        /*!< reset or stop Tx Command issued  */
#define ENET_TX_STATE_FETCHING                    BIT(12)                                       /*!< fetching the Tx descriptor */
#define ENET_TX_STATE_WAITING                     BIT(13)                                       /*!< waiting for status */
#define ENET_TX_STATE_READING                     (BIT(12)|BIT(13))                             /*!< reading the data from host memory buffer and queuing it to transmit buffer */
#define ENET_TX_STATE_WRITING                     BIT(14)                                       /*!< writing timestamp */
#define ENET_TX_STATE_SUSPENDED                   (BIT(13)|BIT(14))                             /*!< Tx descriptor unavailabe or transmit buffer underflow */
#define ENET_TX_STATE_CLOSING                     (BIT(12)|BIT(13)|BIT(14))                     /*!< closing Tx descriptor */

/* ENET_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS register value */
#define MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN           BIT(16)                             /*!< read write control */

/* ENET register mask value */
#define ENET_MMC_PRESET_MASK                      (~(ENET_MMC_CONTROL_CNTPRST | ENET_MMC_CONTROL_CNTPRSTLVL ))    /*!< ENET_MMC_CONTROL preset mask */
/* DMA_SYSBUS_MODE register value */
#define DMA_SYSBUS_MODE_AAL(regval)               (BIT(12) & ((uint32_t)(regval) << 12))                          /*!< write value to DMA_SYSBUS_MODE_AAL bit field */

/* mtl receive parser count related register value */
#define GET_PARSER_OVERFLOW_FLAG(regval)            (BIT(31) & ((uint32_t)(regval))) >> 31U    /*!< get receive parser overflow flag */
#define GET_PARSER_COUNT(regval)                    GET_BITS((uint32_t)(regval), 0U, 30U)      /*!< get receive parser count */

/* dma_mfbocnt register value */
#define GET_DMA_CH_MISS_FRAME_CNT_MSFC(regval)               GET_BITS((regval),0,10)           /*!< get value of ENET_DMA_CH(#i)_MISS_FRAME_CNT_MSFC bit field */

/* dma tx descriptor tdes2 register value */
#define TDES2_B1L(regval)                        (BITS(0,13) & ((uint32_t)(regval) << 0))      /*!< write value to ENET DMA TDES2 B1L bit field */

#define TDES2_B2L(regval)                        (BITS(16,29) & ((uint32_t)(regval) << 29))    /*!< write value to ENET DMA TDES2 B2L bit field */
/* dma tx descriptor tdes3 register value */
#define TDES3_CC(regval)                        (BITS(4,7) & ((uint32_t)(regval) << 4))        /*!< write value to ENET DMA TDES3 CC bit field */
#define GET_TDES3_COCNT(regval)                   GET_BITS((regval),4,7)                       /*!< get value of ENET DMA TDES3 CC bit field */

#define TDES3_CIC(regval)                        (BITS(16,17) & ((uint32_t)(regval) << 16))    /*!< write value to ENET DMA TDES3 CIC bit field */
#define ENET_CHECKSUM_DISABLE                     TDES3_CIC(0)                                 /*!< checksum insertion disabled */
#define ENET_CHECKSUM_IPV4HEADER                  TDES3_CIC(1)                                 /*!< only IP header checksum calculation and insertion are enabled */
#define ENET_CHECKSUM_TCPUDPICMP_SEGMENT          TDES3_CIC(2)                                 /*!< TCP/UDP/ICMP checksum insertion calculated but pseudo-header */
#define ENET_CHECKSUM_TCPUDPICMP_FULL             TDES3_CIC(3)                                 /*!< TCP/UDP/ICMP checksum insertion fully calculated */

