sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#define TDES3_SAIC(regval)                        (BITS(23,25) & ((uint32_t)(regval) << 23))   /*!< write value to ENET DMA TDES3 SAIC bit field */
#define ENET_NO_SA_INCLUDE                        TDES3_SAIC(0)                                /*!< do not include the source address */
#define ENET_MAC0_SA_INCLUDE_INSERT               TDES3_SAIC(1)                                /*!< include or insert the source MAC Address 0 */
#define ENET_MAC0_SA_REPLACE                      TDES3_SAIC(2)                                /*!< replace the source MAC Address 0 */
#define ENET_MAC1_SA_INCLUDE_INSERT               TDES3_SAIC(5)                                /*!< include or insert the source MAC Address 1 */
#define ENET_MAC1_SA_REPLACE                      TDES3_SAIC(6)                                /*!< replace the source MAC Address 1 */

#define TDES3_CPC(regval)                        (BITS(26,27) & ((uint32_t)(regval) << 26))    /*!< write value to ENET DMA TDES3 CPC bit field */
#define ENET_CRC_PAD_INSERT                 TDES3_CPC(0)                                       /*!< CRC and pad insertion */
#define ENET_CRC_INSERT                     TDES3_CPC(1)                                       /*!< CRC insertion */
#define ENET_CRC_INSERT_DISABLE             TDES3_CPC(2)                                       /*!< disable CRC Insertion */
#define ENET_CRC_REPLACE                    TDES3_CPC(3)                                       /*!< CRC replacement */

/* dma rx descriptor rdes3 register value */
#define RDES3_PL(regval)                        (BITS(0,14) & ((uint32_t)(regval) << 0))       /*!< write value to ENET DMA RDES0 FRML bit field */
#define GET_RDES3_PL(regval)                    GET_BITS((regval),0,14)                        /*!< get value of ENET DMA RDES0 FRML bit field */


#define ETH_DMATXDESC_SIZE                        ((uint32_t)0x00000018U)                       /*!< TxDMA descriptor size */
#define ETH_DMARXDESC_SIZE                        ((uint32_t)0x00000018U)                       /*!< RxDMA descriptor size */
#define ENET_ENHANCED_DMATXDESC_SIZE              ((uint32_t)0x00000028U)                       /*!< enhanced TxDMA descriptor size */

/* ENET frame size */
#define ENET_MAX_FRAME_SIZE                       1528U                                         /*!< header + frame_extra + payload + CRC */

/* ENET delay timeout */
#define ENET_DELAY_TO                             ((uint32_t)0x00FFFFFFU)                       /*!< ENET delay timeout */
#define ENET_RESET_TO                             ((uint32_t)0x000004FFU)                       /*!< ENET reset timeout */
#define PHY_DELAY_TO                              ((uint32_t)0x000FFFFFU)                       /*!< ENET delay timeout */

/* ENET MAC version */
#define MAC_VERSION                               ((uint32_t)0x00001053U)                       /*!< ENET delay timeout */

/* the reset value of ENET registers */
#define ENET_RESET_VALUE                          ((uint32_t)0x00000000U)                       /*!< the reset value of register */

/* ENNT operation timeout */
#define ENET_OPERATION_TIMEROUT                   ((uint32_t)0x00FFFFFFU)                       /*!< ENET software operation delay timeout */
#define ENET_SWR_DELAY_TO                         ((uint32_t)0x00000FFFU)                       /*!< ENET software reset delay timeout */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check ENET forward options */
#define ENET_FORWARD_OPTION_BITS                               (ENET_AUTO_PADCRC_STRIP_ENABLE | ENET_TYPEPACKET_CRC_STRIP_ENABLE | ENET_RXQ0_FORWARD_ERRFRAMES_ENABLE | \
                                                               ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES_ENABLE | ENET_RXQ1_FORWARD_ERRFRAMES_ENABLE | \
                                                               ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES_ENABLE )
#define NOT_ENET_FORWARD_OPTION(para)                          ((uint32_t)0x0U != ((para)&(~ENET_FORWARD_OPTION_BITS)))

/* check ENET dma bus options */
#define ENET_DMABUS_OPTION_BITS                               (ENET_ADDRESS_ALIGN_ENABLE | ENET_FIXED_BURST_ENABLE | ENET_MIXED_BURST_ENABLE)
#define NOT_ENET_DMABUS_OPTION(para)                          ((uint32_t)0x0U != ((para)&(~ENET_DMABUS_OPTION_BITS)))

/* check ENET dma channel maxburst options */
#define ENET_DMACH_MAXBURST_OPTION_BITS                        (BITS(16,22) | (ENET_DMA_CH_CONTROL_PBLx8<<7) | (BITS(16,21)>>8))
#define NOT_ENET_DMACH_MAXBURST_OPTION(para)                    ((uint32_t)0x0U != ((para)&(~ENET_DMACH_MAXBURST_OPTION_BITS)))

/* check ENET dma arbitration options */
#define NOT_ENET_DMA_ARBITRATION_OPTION(para)                 (((para) != ENET_ARBITRATION_RXTX_1_1) && ((para) != ENET_ARBITRATION_RXTX_2_1) && \
                                                              ((para) != ENET_ARBITRATION_RXTX_3_1) && ((para) != ENET_ARBITRATION_RXTX_4_1) && ((para) != ENET_ARBITRATION_RXTX_5_1) && \
                                                              ((para) != ENET_ARBITRATION_RXTX_6_1) && ((para) != ENET_ARBITRATION_RXTX_7_1) && ((para) != ENET_ARBITRATION_RXTX_8_1) && \
                                                              ((para) != ENET_ARBITRATION_TXRX_1_1) && ((para) != ENET_ARBITRATION_TXRX_2_1) && ((para) != ENET_ARBITRATION_TXRX_3_1) && \
                                                              ((para) != ENET_ARBITRATION_TXRX_4_1) && ((para) != ENET_ARBITRATION_TXRX_5_1) && ((para) != ENET_ARBITRATION_TXRX_6_1) && \
                                                              ((para) != ENET_ARBITRATION_TXRX_7_1) && ((para) != ENET_ARBITRATION_TXRX_8_1))

/* check ENET Tx store-forward options */
#define ENET_TXSTORE_OPTION_BITS                              (ENET_TX_MODE_STOREFORWARD | (BITS(4,6)))
#define NOT_ENET_TXSTORE_OPTION(para)                         ((uint32_t)0x0U != ((para)&(~ENET_TXSTORE_OPTION_BITS)))

/* check ENET Rx store-forward options */
#define ENET_RXSTORE_OPTION_BITS                              (ENET_RX_MODE_STOREFORWARD | (BITS(0,1)))
#define NOT_ENET_RXSTORE_OPTION(para)                         ((uint32_t)0x0U != ((para)&(~ENET_RXSTORE_OPTION_BITS)))

/* check ENET vlan configure options */
#define ENET_VLAN_CONFIG_OPTION_BITS                          (ENET_RXINVLAN_ENABLE | BITS(28,29) | ENET_INVLANCOMPARISON_ENABLE | \
                                                              ENET_DOUBLEVLAN_ENABLE | ENET_VLANHASHMATCH_ENABLE | ENET_RXOUTVLAN_ENABLE | \
                                                              BITS(21,22) | ENET_VLANTYPECHECK_DISABLE | ENET_SVLANHASHMATCH_ENABLE | ENET_SVLAN_ENABLE | \
                                                              ENET_VLANINVERSEMATCH_ENABLE | ENET_VLANTAGHASHCOMPARISON_12BIT)
#define NOT_ENET_VLAN_CONFIG_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_VLAN_CONFIG_OPTION_BITS)))

