sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check ENET vlan comparision options */
#define ENET_VLAN_COMPARISON_OPTION_BITS                      (ENET_VLANTAGCOMPARISON_INNER | ENET_SVLANTAGMATCH_ENABLE | ENET_VLANTYPECOMPARISON_DISABLE | \
                                                              ENET_VLANTAGCOMPARISON_12BIT | ENET_VLANTAGCOMPARISON_ENABLE | BITS(0,15))
#define NOT_ENET_VLAN_COMPARISON_OPTION(para)                 ((uint32_t)0x0U != ((para)&(~ENET_VLAN_COMPARISON_OPTION_BITS)))

/* check ENET vlan insert options */
/* check ENET vlan insert options */
#define ENET_VLAN_INSERT_OPTION_BITS                          BITS(0, 20)
#define NOT_ENET_VLAN_INSERT_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_VLAN_INSERT_OPTION_BITS)))

/* check ENET inner vlan insert options */
#define ENET_INNERVLAN_INSERT_OPTION_BITS                     BITS(0, 20)
#define NOT_ENET_INNERVLAN_INSERT_OPTION(para)                ((uint32_t)0x0U != ((para)&(~ENET_INNERVLAN_INSERT_OPTION_BITS)))

/* check ENET flowctl options */
#define ENET_FLOWCTL_OPTION_BITS                              (ENET_ZERO_QUANTA_PAUSE_DISABLE | BITS(4,6) | ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT)
#define NOT_ENET_FLOWCTL_OPTION(para)                         ((uint32_t)0x0U != ((para)&(~ENET_FLOWCTL_OPTION_BITS)))

/* check ENET filter options */
#define ENET_FILTER_OPTION_BITS                              (ENET_SRC_FILTER_NORMAL_ENABLE | ENET_SRC_FILTER_INVERSE_ENABLE | ENET_DEST_FILTER_INVERSE_ENABLE | \
                                                              ENET_MULTICAST_FILTER_HASH_OR_PERFECT | ENET_MULTICAST_FILTER_HASH | ENET_MULTICAST_FILTER_NONE | \
                                                              ENET_MULTICAST_FILTER_PASS | ENET_DROP_NONTCPUDP_ENABLE | ENET_VLAN_FILTER_ENABLE | ENET_L3L4_FILTER_ENABLE | \
                                                              ENET_UNICAST_FILTER_EITHER | ENET_UNICAST_FILTER_HASH | BITS(6,7))
#define NOT_ENET_FILTER_OPTION(para)                         ((uint32_t)0x0U != ((para)&(~ENET_FILTER_OPTION_BITS)))

/* check ENET halfduplex options */
#define ENET_HALFDUPLEX_OPTION_BITS                          (ENET_CARRIERSENSE_DISABLE | ENET_RECEIVEOWN_DISABLE | ENET_RETRYTRANSMISSION_DISABLE | \
                                                             BITS(5,6) | ENET_DEFERRALCHECK_ENABLE)
#define NOT_ENET_HALFDUPLEX_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_HALFDUPLEX_OPTION_BITS)))

/* check ENET fullduplex options */
#define ENET_FULLDUPLEX_OPTION_BITS                          (ENET_FULLDUPLEX_CARRIERSENSE_ENABLE | BITS(2,3))
#define NOT_ENET_FULLDUPLEX_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_FULLDUPLEX_OPTION_BITS)))

/* check ENET packet size options */
#define ENET_PACKETSIZE_OPTION_BITS                          (ENET_2KMAX_PACKET_ENABLE | ENET_JUMBO_PACKET_DISABLE | ENET_GIANT_PACKET_LIMIT_ENABLE)
#define NOT_ENET_PACKETSIZE_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_PACKETSIZE_OPTION_BITS)))

/* check ENET timer options */
#define ENET_TIMER_OPTION_BITS                               (ENET_WATCHDOG_DISABLE | ENET_JABBER_DISABLE)
#define NOT_ENET_TIMER_OPTION(para)                          ((uint32_t)0x0U != ((para)&(~ENET_TIMER_OPTION_BITS)))

/* check ENET mac control options */
#define ENET_MACCONTROL_OPTION_BITS                          (ENET_ARP_OFFLOAD_ENABLE | BITS(28,29))
#define NOT_ENET_MACCONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_MACCONTROL_OPTION_BITS)))

/* check ENET inter frame gap options */
#define ENET_INTERFRAMEGAP_OPTION_BITS                       (BITS(24,26))
#define NOT_ENET_INTERFRAMEGAP_OPTION(para)                  ((uint32_t)0x0U != ((para)&(~ENET_INTERFRAMEGAP_OPTION_BITS)))

/* check ENET ecc control options */
#define ENET_ECCCONTROL_OPTION_BITS                          (ENET_MTL_TXFIFO_ECC_ENABLE | ENET_MTL_RXFIFO_ECC_ENABLE | ENET_MTL_EST_ECC_ENABLE | \
                                                             ENET_MTL_RXP_ECC_ENABLE | ENET_MTL_EXX_ERR_ADDR_STATUS_OVERRIDE_ENABLE)
#define NOT_ENET_ECCCONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_ECCCONTROL_OPTION_BITS)))

/* check ENET dpp control options */
#define ENET_DPPCONTROL_OPTION_BITS                          (ENET_DATA_PATH_PARITY_PROTECTION_ENABLE | ENET_DPP_ODD_PARITY_ENABLE | ENET_DPP_PARITY_ON_SLAVE_INTERFACE_ENABLE | \
                                                             ENET_DPP_IPETID_ENABLE | ENET_DPP_IPETRD_ENABLE | ENET_DPP_IPEMTF_ENABLE | \
                                                             ENET_DPP_IPEMTS_ENABLE | ENET_DPP_IPERID_ENABLE | ENET_DPP_IPEMTBU_ENABLE | \
                                                             ENET_DPP_IPEMTFC_ENABLE | ENET_DPP_IPEMRWC_ENABLE)
#define NOT_ENET_DPPCONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_DPPCONTROL_OPTION_BITS)))

/* check ENET fsm control options */
#define ENET_FSMCONTROL_OPTION_BITS                          (ENET_PTP_DOMAIN_LARGE_MODE | ENET_APP_DOMAIN_LARGE_MODE | ENET_CSR_DOMAIN_LARGE_MODE | \
                                                             ENET_RX_DOMAIN_LARGE_MODE | ENET_TX_DOMAIN_LARGE_MODE | ENET_PTP_FSM_PARITY_ERROR_INJECTION_ENABLE | \
                                                             ENET_APP_FSM_PARITY_ERROR_INJECTION_ENABLE | ENET_CSR_FSM_ONEHOTPROTECTION_ERROR_INJECTION_ENABLE | ENET_RX_FSM_PARITY_ERROR_INJECTION_ENABLE | \
                                                             ENET_TX_FSM_PARITY_ERROR_INJECTION_ENABLE | ENET_PTP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE | ENET_APP_FSM_TIMEOUT_ERROR_INJECTION_ENABLE | \
                                                             ENET_CSR_FSM_TIMEOUT_ERROR_INJECTION_ENABLE | ENET_RX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE | ENET_TX_FSM_TIMEOUT_ERROR_INJECTION_ENABLE | \
                                                             ENET_FSM_PARITY_FEATURE_ENABLE | ENET_FSM_TIMEOUT_FEATURE_ENABLE)
#define NOT_ENET_FSMCONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_FSMCONTROL_OPTION_BITS)))

/* check ENET est control options */
#define ENET_ESTCONTROL_OPTION_BITS                          (ENET_MTL_EST_CONTROL_EEST | ENET_MTL_EST_CONTROL_SSWL | ENET_MTL_EST_CONTROL_QHLBF | \
                                                             ENET_MTL_EST_CONTROL_DDBF | ENET_MTL_EST_CONTROL_DFBS | ENET_MTL_EST_CONTROL_LCSE | \
                                                             ENET_MTL_EST_CONTROL_TILS | ENET_MTL_EST_CONTROL_CTOV | ENET_MTL_EST_CONTROL_PTOV)
#define NOT_ENET_ESTCONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_ESTCONTROL_OPTION_BITS)))

/* check ENET fpe control options */
#define ENET_FPECONTROL_OPTION_BITS                          (ENET_GCL_LEVEL_BASED_HOLD_TRANSITION_ENABLE | (ENET_MTL_FPE_CTRL_STS_PEC << 4U) | (ENET_MTL_FPE_CTRL_STS_AFSZ << 4U))
#define NOT_ENET_FPECONTROL_OPTION(para)                     ((uint32_t)0x0U != ((para)&(~ENET_FPECONTROL_OPTION_BITS)))

/* check ENET buffer size value */
#define BUFSIZE_HIGH_VAL                                      ENET_RXBUF_SIZE
#define NOT_ENET_BUFSIZE(bufsize)                             (BUFSIZE_HIGH_VAL < (bufsize))

