sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check ENET IP checksum configuration */
#define NOT_ENET_CHECKSUM(checksum)                           (((checksum) != ENET_CHECKSUM_DISABLE) && ((checksum) != ENET_CHECKSUM_IPV4HEADER) && \
                                                              ((checksum) != ENET_CHECKSUM_TCPUDPICMP_SEGMENT) && ((checksum) != ENET_CHECKSUM_TCPUDPICMP_FULL))

/* check ENET transmit source address control */
#define NOT_ENET_TXSRCADDR_CONTROL(control)                   (((control) != ENET_NO_SA_INCLUDE) && ((control) != ENET_MAC0_SA_INCLUDE_INSERT) && \
                                                              ((control) != ENET_MAC0_SA_REPLACE) && ((control) != ENET_MAC1_SA_INCLUDE_INSERT)&& \
                                                              ((control) != ENET_MAC1_SA_REPLACE))

/* check ENET transmit crc / pad control */
#define NOT_ENET_TXCRCPAD_CONTROL(control)                    (((control) != ENET_CRC_PAD_INSERT) && ((control) != ENET_CRC_INSERT) && \
                                                              ((control) != ENET_CRC_INSERT_DISABLE) && ((control) != ENET_CRC_REPLACE))

/* check ENET extend packet gap value */
#define EXT_PACKET_GAP_HIGH_VAL                              ((uint32_t)2144U)
#define EXT_PACKET_GAP_LOW_VAL                               ((uint32_t)104U)
#define NOT_EXT_PACKET_GAP_VALUE(packet_gap)                 ((EXT_PACKET_GAP_HIGH_VAL < (packet_gap)) || (EXT_PACKET_GAP_LOW_VAL > (packet_gap)))

/* check ENET giant packet size value */
#define GIANT_PACKET_SIZE_HIGH_VAL                           ((uint32_t)0x3FFFU)
#define NOT_GIANT_PACKET_SIZE_VALUE(size)                    (GIANT_PACKET_SIZE_HIGH_VAL < (size))

/* check ENET jabber programmable timeout */
#define NOT_ENET_JABBER_TIMEOUT(val)                         (((val) != ENET_JABBER_TIMEOUT_2KB) && ((val) != ENET_JABBER_TIMEOUT_3KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_4KB) && ((val) != ENET_JABBER_TIMEOUT_5KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_6KB) && ((val) != ENET_JABBER_TIMEOUT_7KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_8KB) && ((val) != ENET_JABBER_TIMEOUT_9KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_10KB) && ((val) != ENET_JABBER_TIMEOUT_11KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_12KB) && ((val) != ENET_JABBER_TIMEOUT_13KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_14KB) && ((val) != ENET_JABBER_TIMEOUT_15KB) && \
                                                             ((val) != ENET_JABBER_TIMEOUT_16KB))

/* check ENET watchdog programmable timeout */
#define NOT_ENET_WATCHDOG_TIMEOUT(val)                       (((val) != ENET_WATCHDOG_TIMEOUT_2KB) && ((val) != ENET_WATCHDOG_TIMEOUT_3KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_4KB) && ((val) != ENET_WATCHDOG_TIMEOUT_5KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_6KB) && ((val) != ENET_WATCHDOG_TIMEOUT_7KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_8KB) && ((val) != ENET_WATCHDOG_TIMEOUT_9KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_10KB) && ((val) != ENET_WATCHDOG_TIMEOUT_11KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_12KB) && ((val) != ENET_WATCHDOG_TIMEOUT_13KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_14KB) && ((val) != ENET_WATCHDOG_TIMEOUT_15KB) && \
                                                             ((val) != ENET_WATCHDOG_TIMEOUT_16KB))

/* check ENET mac register number */
#define MAC_REG_NUM_HIGH_VAL                                  ((uint32_t)190U)
#define NOT_ENET_MAC_REG_NUM(num)                             (MAC_REG_NUM_HIGH_VAL < (num))

/* check ENET mtl register number */
#define MTL_REG_NUM_HIGH_VAL                                  ((uint32_t)34U)
#define NOT_ENET_MTL_REG_NUM(num)                            (MTL_REG_NUM_HIGH_VAL < (num))

/* check ENET mtl queue 0 register number */
#define MTL_Q0_REG_NUM_HIGH_VAL                               ((uint32_t)10U)
#define NOT_ENET_MTL_Q0_REG_NUM(num)                          (MTL_Q0_REG_NUM_HIGH_VAL < (num))

/* check ENET mtl queue 1 register number */
#define MTL_Q1_REG_NUM_HIGH_VAL                               ((uint32_t)14U)
#define NOT_ENET_MTL_Q1_REG_NUM(num)                          (MTL_Q1_REG_NUM_HIGH_VAL < (num))

/* check ENET dma register number */
#define DMA_REG_NUM_HIGH_VAL                                  ((uint32_t)6U)
#define NOT_ENET_DMA_REG_NUM(num)                             (DMA_REG_NUM_HIGH_VAL < (num))

/* check ENET dma channel 0 register number */
#define DMA_CH0_REG_NUM_HIGH_VAL                              ((uint32_t)19U)
#define NOT_ENET_DMA_CH0_REG_NUM(num)                         (DMA_CH0_REG_NUM_HIGH_VAL < (num))

/* check ENET dma channel 1 register number */
#define DMA_CH1_REG_NUM_HIGH_VAL                              ((uint32_t)19U)
#define NOT_ENET_DMA_CH1_REG_NUM(num)                         (DMA_CH1_REG_NUM_HIGH_VAL < (num))

/* check ENET mac address mask */
#define NOT_ENET_ADDR_MASK(addr_mask)                        ((uint32_t)0x0U != ((addr_mask)&(~ENET_MAC_ADDRESS1_HIGH_MBC)))

/* check ENET mac filter type */
#define NOT_ENET_MAC_FILTER_TYPE(filter_type)                (((filter_type) != ENET_ADDRESS_FILTER_SA) && ((filter_type) != ENET_ADDRESS_FILTER_DA))

/* check ENET forward feature */
#define NOT_ENET_FORWARD_FEATURE(feature)                    (((feature) != ENET_AUTO_PADCRC_DROP) && ((feature) != ENET_TYPEFRAME_CRC_DROP) && \
                                                             ((feature) != ENET_RXQ0_FORWARD_ERRFRAMES) && ((feature) != ENET_RXQ0_FORWARD_UNDERSZ_GOODFRAMES) && \
                                                             ((feature) != ENET_RXQ1_FORWARD_ERRFRAMES) && ((feature) != ENET_RXQ1_FORWARD_UNDERSZ_GOODFRAMES))

/* check ENET filter feature */
#define ENET_FILTER_BITS                                     (ENET_L3L4_FILTER | ENET_VLAN_FILTER | ENET_SRC_FILTER | ENET_SRC_FILTER_INVERSE | \
                                                              ENET_BROADCASTFRAMES_FILTER | ENET_DEST_FILTER_INVERSE | ENET_MULTICAST_FILTER_PASS | \
                                                              ENET_MULTICAST_FILTER_HASH_MODE | ENET_UNICAST_FILTER_HASH_MODE | ENET_FILTER_MODE_EITHER)
#define NOT_ENET_FILTER_FEATURE(feature)                     ((uint32_t)0x0U != ((feature)&(~ENET_FILTER_BITS)) || ((uint32_t)0U == (feature)))

/* check the type of filter fail packet */
#define NOT_ENET_FILTER_FAIL_PACKET_TYPE(type)               (((type) != MAC_UNICAST_ADDRESS_FLITER_FAIL) && ((type) != MAC_MULTICAST_ADDRESS_FLITER_FAIL) && \
                                                             ((type) != MAC_VLAN_TAG_FLITER_FAIL))

/* check normal packets queue related configuration */
#define NOT_ENET_PACKET_QUEUE_CFG(config)                    (((config) != MAC_RXQ_MCBC_PRIORITY_ENABLE) && ((config) != MAC_RXQ_MCBC_PRIORITY_DISABLE) && \
                                                             ((config) != MAC_RXQ_PTPOE_AS_GENERIC_VLAN) && ((config) != MAC_RXQ_PTPOE_TO_PTPQ) && \
                                                             ((config) != MAC_RXQ_PTPOE_TO_PSRQ) && ((config) != MAC_AV_TAG_PACKET_QUEUE_ENABLE) && \
                                                             ((config) != MAC_AV_TAG_PACKET_QUEUE_DISABLE) && ((config) != MAC_RXQ_MCBC_PRIORITY_OVER_ENABLE) && \
                                                             ((config) != MAC_RXQ_MCBC_PRIORITY_OVER_DISABLE) && ((config) != MAC_RXQ_TYPE_BASED_ENABLE) && \
                                                             ((config) != MAC_RXQ_TYPE_BASED_DISABLE))

/* check normal packets queue related configuration */
#define NOT_ENET_FSM_TIMEOUT_VALUE(val)                      (((val) != ENET_FSM_TIMEOUT_DISABLE) && ((val) != ENET_FSM_TIMEOUT_1US) && \
                                                             ((val) != ENET_FSM_TIMEOUT_4MS) && ((val) != ENET_FSM_TIMEOUT_16MS) && \
                                                             ((val) != ENET_FSM_TIMEOUT_64MS) && ((val) != ENET_FSM_TIMEOUT_256MS) && \
                                                             ((val) != ENET_FSM_TIMEOUT_1SEC) && ((val) != ENET_FSM_TIMEOUT_4SEC) && \
                                                             ((val) != ENET_FSM_TIMEOUT_16SEC) && ((val) != ENET_FSM_TIMEOUT_32SEC) && \
                                                             ((val) != ENET_FSM_TIMEOUT_64SEC))

/* check ENET pauseframe detect */
#define NOT_ENET_PAUSEFRAME_DETECT(detect)                   (((detect) != ENET_MAC0_AND_UNIQUE_ADDRESS_PAUSEDETECT) && ((detect) != ENET_UNIQUE_PAUSEDETECT))

