sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check ENET pause threshold */
#define NOT_ENET_PAUSE_THRESHOLD(pause_threshold)            (((pause_threshold) != ENET_PAUSETIME_MINUS4) && ((pause_threshold) != ENET_PAUSETIME_MINUS28) && \
                                                             ((pause_threshold) != ENET_PAUSETIME_MINUS36) && ((pause_threshold) != ENET_PAUSETIME_MINUS144) && \
                                                             ((pause_threshold) != ENET_PAUSETIME_MINUS256) && ((pause_threshold) != ENET_PAUSETIME_MINUS256_2))

/* check ENET deactive threshold */
#define NOT_ENET_DEACTIVE_THRESHOLD(deactive)                (((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_1_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_2_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_3_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_4_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_5_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_6_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_7_5K) && \
                                                             ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8K) && ((deactive) != ENET_DEACTIVE_THRESHOLD_FULL_MINUS_8_5K))

/* check ENET active threshold */
#define NOT_ENET_ACTIVE_THRESHOLD(active)                    (((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_1K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_1_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_2K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_2_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_3K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_3_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_4K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_4_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_5K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_5_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_6K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_6_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_7K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_7_5K) && \
                                                             ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_8K) && ((active) != ENET_ACTIVE_THRESHOLD_FULL_MINUS_8_5K))

/* check ENET flow control feature */
#define NOT_ENET_FLOWCONTROL_FEATURE(feature)                (((feature) != ENET_ZERO_QUANTA_PAUSE) && ((feature) != ENET_TX_FLOWCONTROL) && \
                                                             ((feature) != ENET_RX_FLOWCONTROL) && ((feature) != ENET_BACK_PRESSURE))

/* check ENET frame preemption feature */
#define NOT_ENET_FRAMEPREEMPTION_FEATURE(feature)            (((feature) != ENET_SEND_RESPOND_FRAME) && ((feature) != ENET_SEND_VERIFY_FRAME) && \
                                                             ((feature) != ENET_AUTOGENERATE_RESPOND_MPACKET) && \
                                                             ((feature) != ENET_TX_FRAME_PREEMPTION))

#define NOT_ENET_FRAMEPREEMPTION_FEATURE1(feature)            (((feature) != ENET_AUTOGENERATE_RESPOND_MPACKET) && \
                                                             ((feature) != ENET_TX_FRAME_PREEMPTION))

/* check ENET dma slot interval value */
#define DMA_SLOT_INTERVAL_HIGH_VAL                           ((uint32_t)0xFFFU)
#define NOT_DMA_SLOT_INTERVAL_VALUE(slot_interval)           (DMA_SLOT_INTERVAL_HIGH_VAL < (slot_interval))

/* check dma slot function */
#define ENET_DMA_SLOT_FUNCTION_BITS                          (ENET_DMA_ADVANCE_SLOT_CHECK | ENET_DMA_SLOT_COMPARISON)
#define NOT_DMA_SLOT_FUNCTION(function)                      ((0U != ((function)&(~ENET_DMA_SLOT_FUNCTION_BITS))) || ((uint32_t)0U == (function)))

/* check watchdog timer count units */
#define NOT_ENET_WATCHDOG_TIMER_COUNT_UNIT(count_uint)       (((count_uint) != ENET_RX_INT_WATCHDOG_TIMER_COUNT_256) && ((count_uint) != ENET_RX_INT_WATCHDOG_TIMER_COUNT_512) && \
                                                             ((count_uint) != ENET_RX_INT_WATCHDOG_TIMER_COUNT_1024) && ((count_uint) != ENET_RX_INT_WATCHDOG_TIMER_COUNT_2048))

/* check the value of watchdog timer count */
#define DMA_ALTER_RXBUF_SIZE_HIGH_VAL                        ((uint32_t)0x3F8U)
#define NOT_DMA_ALTER_RXBUF_SIZE(size)                       (DMA_ALTER_RXBUF_SIZE_HIGH_VAL < (size))

/* check MAC_TMRQ_Regs selection */
#define NOT_ENET_MAC_TMRQ_REG_NUM(reg_num)                   (((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG0) && ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG1) && \
                                                             ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG2) && ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG3) && \
                                                             ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG4) && ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG5) && \
                                                             ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG6) && ((reg_num) != ENET_INDIR_ACCESS_MAC_TMRQ_REG7))
/* check the packet type selection */
#define PACKET_TYPE_LOW_VAL                                  ((uint32_t)0x600U)
#define NOT_PACKET_TYPE(type)                                (PACKET_TYPE_LOW_VAL > (type))

/* check the tbs mode */
#define NOT_ENET_TBS_MODE(mode)                              (((mode) != ENET_TBS_NORMAL_ABSOLUTE_MODE) && ((mode) != ENET_TBS_EST_OFFSET_MODE))

/* check the launch expiry offset */
#define LAUNCH_EXPIRY_OFFSET_HIGH_VAL                        ((uint32_t)0xFFFFFFU)
#define NOT_LAUNCH_EXPIRY_OFFSET(offset)                     (LAUNCH_EXPIRY_OFFSET_HIGH_VAL < (offset))

/* check the launch expiry offset */
#define LAUNCH_EXPIRY_GSN_OFFSET_HIGH_VAL                     ((uint32_t)0x7U)
#define NOT_LAUNCH_EXPIRY_GSN_OFFSET(gsn_offset)              (LAUNCH_EXPIRY_GSN_OFFSET_HIGH_VAL < (gsn_offset))

/* check the fetch offset */
#define FETCH_OFFSET_HIGH_VAL                                 ((uint32_t)0xFFFFFFU)
#define NOT_FETCH_OFFSET(offset)                              (LAUNCH_EXPIRY_OFFSET_HIGH_VAL < (offset))

