sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check the fetch gsn offset */
#define FETCH_GSN_OFFSET_HIGH_VAL                             ((uint32_t)0x7U)
#define NOT_FETCH_GSN_OFFSET(gsn_offset)                      (FETCH_GSN_OFFSET_HIGH_VAL < (gsn_offset))

/* check ENET mtl transmit queue ets configuration */

/* check ENET mtl transmit queue ets configuration */
#define NOT_ENET_TXQ1_ETS_CFG(cfg)                          (((cfg) != ENET_CBS_1SLOT) && ((cfg) != ENET_CBS_2SLOT) && \
                                                            ((cfg) != ENET_CBS_4SLOT) && ((cfg) != ENET_CBS_8SLOT) && \
                                                            ((cfg) != ENET_CBS_16SLOT) && ((cfg) != ENET_TXQ1_CREDIT_CONTROL_ENABLE) && \
                                                            ((cfg) != ENET_TXQ1_CREDIT_CONTROL_DISABLE) && ((cfg) != ENET_TXQ1_AV_ALGO_ENABLE) && \
                                                            ((cfg) != ENET_TXQ1_AV_ALGO_DISABLE))

/* check the fetch gsn offset */
#define OVERHEAD_BYTES_HIGH_VAL                               ((uint32_t)0x3FU)
#define NOT_OVERHEAD_BYTES_VALUE(val)                         (OVERHEAD_BYTES_HIGH_VAL < (val))

/* check the filter register selection */
#define NOT_ENET_MAC_VLAN_TAG_FILTER(filter)                  (((filter) != MAC_VLAN_TAG_FILTER0) && ((filter) != MAC_VLAN_TAG_FILTER1) && \
                                                              ((filter) != MAC_VLAN_TAG_FILTER2) && ((filter) != MAC_VLAN_TAG_FILTER3))

/* check ENET pmt feature */
#define NOT_ENET_VLAN_FILTER_FEATURE(feature)                 (((feature) != ENET_VLANTAGCOMPARISON_INNER) && ((feature) != ENET_SVLANTAGMATCH_ENABLE) && \
                                                              ((feature) != ENET_VLANTYPECOMPARISON_DISABLE) && ((feature) != ENET_VLANTAGCOMPARISON_12BIT) && \
                                                              ((feature) != ENET_VLANTAGCOMPARISON_ENABLE))

/* check ENET transmit algorithm type */
#define NOT_ENET_TX_ALGO_TYPE(SchedAlgo)                     (((SchedAlgo) != STRICT_PRIORITY_TX) && ((SchedAlgo) != WEIGHTED_ROUND_ROBIN))

/* check ENET mtl transmit queue weight */
#define MTL_TXQ_WEIGHT_HIGH_VAL                                ((uint8_t)0x64U)
#define NOT_ENET_MTL_TXQ_WEIGHT(weight)                        (MTL_TXQ_WEIGHT_HIGH_VAL < (weight))


/* check ENET mtl receive queue weight */
#define MTL_RXQ_WEIGHT_HIGH_VAL                                ((uint8_t)0x7U)
#define NOT_ENET_MTL_RXQ_WEIGHT(weight)                        (MTL_RXQ_WEIGHT_HIGH_VAL < (weight))

/* check ENET idleSlope credit */
#define IDLE_SLOPE_CREDIT_HIGH_VAL                             ((uint32_t)0x1000U)
#define NOT_ENET_IDLE_SLOPE_CREDIT(credit)                     (IDLE_SLOPE_CREDIT_HIGH_VAL < (credit))

/* check ENET sendSlope credit */
#define SEND_SLOPE_CREDIT_HIGH_VAL                             ((uint32_t)0x1000U)
#define NOT_ENET_SEND_SLOPE_CREDIT(credit)                     (SEND_SLOPE_CREDIT_HIGH_VAL < (credit))

/* check ENET hiSlope credit */
#define HIGH_SLOPE_CREDIT_HIGH_VAL                             ((uint32_t)0x08000000U)
#define NOT_ENET_HIGH_SLOPE_CREDIT(credit)                     (HIGH_SLOPE_CREDIT_HIGH_VAL < (credit))

/* check ENET loSlope credit */
#define LOW_SLOPE_CREDIT_HIGH_VAL                              ((uint32_t)0x18000000U)
#define NOT_ENET_LOW_SLOPE_CREDIT(credit)                      (LOW_SLOPE_CREDIT_HIGH_VAL < (credit))

/* check ENET mtl queue size */
#define NOT_ENET_TXQ_SIZE(size)                              (((size) != ENET_TXQ_SIZE_256BYTES) && ((size) != ENET_TXQ_SIZE_512BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_768BYTES) && ((size) != ENET_TXQ_SIZE_1024BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_1280BYTES) && ((size) != ENET_TXQ_SIZE_1536BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_1792BYTES) && ((size) != ENET_TXQ_SIZE_2048BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_2304BYTES) && ((size) != ENET_TXQ_SIZE_2560BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_2816BYTES) && ((size) != ENET_TXQ_SIZE_3072BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_3328BYTES) && ((size) != ENET_TXQ_SIZE_3584BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_3840BYTES) && ((size) != ENET_TXQ_SIZE_4096BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_4352BYTES) && ((size) != ENET_TXQ_SIZE_4608BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_4864BYTES) && ((size) != ENET_TXQ_SIZE_5120BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_5376BYTES) && ((size) != ENET_TXQ_SIZE_5632BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_5888BYTES) && ((size) != ENET_TXQ_SIZE_6144BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_6400BYTES) && ((size) != ENET_TXQ_SIZE_6656BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_6912BYTES) && ((size) != ENET_TXQ_SIZE_7168BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_7424BYTES) && ((size) != ENET_TXQ_SIZE_7680BYTES) && \
                                                               ((size) != ENET_TXQ_SIZE_7936BYTES) && ((size) != ENET_TXQ_SIZE_8192BYTES))
                                                               
#define NOT_ENET_RXQ_SIZE(size)                              (((size) != ENET_RXQ_SIZE_256BYTES) && ((size) != ENET_RXQ_SIZE_512BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_768BYTES) && ((size) != ENET_RXQ_SIZE_1024BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_1280BYTES) && ((size) != ENET_RXQ_SIZE_1536BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_1792BYTES) && ((size) != ENET_RXQ_SIZE_2048BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_2304BYTES) && ((size) != ENET_RXQ_SIZE_2560BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_2816BYTES) && ((size) != ENET_RXQ_SIZE_3072BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_3328BYTES) && ((size) != ENET_RXQ_SIZE_3584BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_3840BYTES) && ((size) != ENET_RXQ_SIZE_4096BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_4352BYTES) && ((size) != ENET_RXQ_SIZE_4608BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_4864BYTES) && ((size) != ENET_RXQ_SIZE_5120BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_5376BYTES) && ((size) != ENET_RXQ_SIZE_5632BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_5888BYTES) && ((size) != ENET_RXQ_SIZE_6144BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_6400BYTES) && ((size) != ENET_RXQ_SIZE_6656BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_6912BYTES) && ((size) != ENET_RXQ_SIZE_7168BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_7424BYTES) && ((size) != ENET_RXQ_SIZE_7680BYTES) && \
                                                               ((size) != ENET_RXQ_SIZE_7936BYTES) && ((size) != ENET_RXQ_SIZE_8192BYTES))

