sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check the TER value */
#define TER_REG_HIGH_VAL                                     ((uint32_t)0x7FFFFFFFU)
#define NOT_TER_REG_VAL(value)                               (TER_REG_HIGH_VAL < (value))
/* check ENET gcl length */
#define GCL_LENGTH_HIGH_VAL                                    ((uint32_t)127U)
#define NOT_ENET_GCL_LENGTH(length)                            (GCL_LENGTH_HIGH_VAL < (length))

/* check ENET Rx parser entry number */
#define ENTRY_NUMBER_HIGH_VAL                                  ((uint32_t)63U)
#define NOT_ENET_ENTRY_NUMBER(number)                          (ENTRY_NUMBER_HIGH_VAL < (number))

/* check the related configuration of L3_L4 filter */
#define NOT_ENET_L3_L4_FILTER_CFG(function)                    (((function) != ENET_L4_DEST_PORT_NORMAL_MATCH) && ((function) != ENET_L4_DEST_PORT_INVERSE_MATCH) && \
                                                               ((function) != ENET_L4_SRC_PORT_NORMAL_MATCH) && ((function) != ENET_L4_SRC_PORT_INVERSE_MATCH) && \
                                                               ((function) != ENET_L4_PROTOCOL_MATCH_UDP) && ((function) != ENET_L3_DEST_IPADDR_NORMAL_MATCH) && \
                                                               ((function) != ENET_L3_DEST_IPADDR_INVERSE_MATCH) && ((function) != ENET_L3_SRC_IPADDR_NORMAL_MATCH) && \
                                                               ((function) != ENET_L3_SRC_IPADDR_INVERSE_MATCH) && ((function) != ENET_L3_PROTOCOL_MATCH_IPV6))

/* check ENET descriptor flag get */
#define ENET_DESC_FLAG_GET_BITS                                (ENET_NORMAL_TDES3_WF_IHE | ENET_NORMAL_TDES3_WF_DB | ENET_NORMAL_TDES3_WF_UF | \
                                                               ENET_NORMAL_TDES3_WF_ED | ENET_NORMAL_TDES3_WF_EC | \
                                                               ENET_NORMAL_TDES3_WF_LC | ENET_NORMAL_TDES3_WF_NC | \
                                                               ENET_NORMAL_TDES3_WF_LOC | ENET_NORMAL_TDES3_WF_PCE | \
                                                               ENET_NORMAL_TDES3_WF_FF | ENET_NORMAL_TDES3_WF_JT | \
                                                               ENET_NORMAL_TDES3_WF_ES | ENET_NORMAL_TDES3_WF_TTSS | \
                                                               ENET_NORMAL_TDES3_WF_DE | ENET_NORMAL_TDES3_WF_FD | \
                                                               ENET_NORMAL_TDES3_WF_CTXT | ENET_NORMAL_TDES3_WF_LD | \
                                                               ENET_NORMAL_TDES3_WF_OWN | ENET_NORMAL_RDES3_WF_RWT | \
                                                               ENET_NORMAL_RDES3_WF_OE | ENET_NORMAL_RDES3_WF_RE | \
                                                               ENET_NORMAL_RDES3_WF_RS0V | ENET_NORMAL_RDES3_WF_RS1V | \
                                                               ENET_NORMAL_RDES3_WF_RS2V | ENET_NORMAL_RDES3_WF_CE | \
                                                               ENET_NORMAL_RDES3_WF_DE )
#define NOT_ENET_DESC_FLAG_GET(para)                          ((uint32_t)0x0U != ((para)&(~ENET_DESC_FLAG_GET_BITS)))

/* check ENET descriptor flag clear */
#define ENET_DESC_FLAG_SET_BITS                                (ENET_NORMAL_TDES3_RF_FD | ENET_NORMAL_TDES3_RF_LD | ENET_NORMAL_TDES3_RF_CTXT | \
                                                               ENET_NORMAL_TDES3_RF_OWN | ENET_NORMAL_RDES3_RF_BUF1V | ENET_NORMAL_RDES3_RF_BUF2V)
#define NOT_ENET_DESC_FLAG_SET(para)                          ((uint32_t)0x0U != ((para)&(~ENET_DESC_FLAG_SET_BITS)))

/* check ENET dma feature */
#define ENET_DMA_FEATURE_BITS                                  (ENET_FLUSH_RXFRAME | ENET_SECONDFRAME_OPT)
#define NOT_ENET_DMA_FEATURE(feature)                          (((uint32_t)0x0U != ((feature)&(~ENET_DMA_FEATURE_BITS))) || ((uint32_t)0U != (feature)))

/* check ENET pmt feature */
#define ENET_PMT_ENABLE_BITS                                   (MAC_PMT_POWER_DOWN | MAC_PMT_MAGIC_PACKET_FRAME | MAC_PMT_WAKE_UP_FRAME | \
                                                               MAC_PMT_WAKE_UP_FRAME_FORWARD | MAC_PMT_GLOBAL_UNICAST)
#define NOT_ENET_PMT_ENABLE_FEATURE(feature)                   (((uint32_t)0x0U != ((feature)&(~ENET_PMT_ENABLE_BITS))) || ((uint32_t)0U != (feature)))

#define ENET_PMT_DISABLE_BITS                                  (MAC_PMT_MAGIC_PACKET_FRAME | MAC_PMT_WAKE_UP_FRAME | \
                                                               MAC_PMT_GLOBAL_UNICAST)
#define NOT_ENET_PMT_DISABLE_FEATURE(feature)                  (((uint32_t)0x0U != ((feature)&(~ENET_PMT_DISABLE_BITS))) || ((uint32_t)0U != (feature)))

/* check ENET 1us tick */
#define US_TICK_HIGH_VAL                                       ((uint32_t)0xFFFU)
#define NOT_ENET_US_TICK(tick)                                 (US_TICK_HIGH_VAL < (tick))

/* check ENET lpi timer value */
#define LPI_LS_TIMER_HIGH_VAL                                  ((uint32_t)0x3FFU)
#define NOT_ENET_LPI_LS_TIMER_VALUE(val)                       (LPI_LS_TIMER_HIGH_VAL < (val))

#define LPI_TW_TIMER_HIGH_VAL                                  ((uint32_t)0xFFFFU)
#define NOT_ENET_LPI_TW_TIMER_VALUE(val)                       (LPI_TW_TIMER_HIGH_VAL < (val))

#define LPI_ENTRY_TIMER_HIGH_VAL                               ((uint32_t)0xFFFFFU)
#define NOT_ENET_LPI_ENTRY_TIMER_VALUE(val)                    (LPI_ENTRY_TIMER_HIGH_VAL < (val))

/* check ENET lpi feature */
#define NOT_ENET_LPI_FEATURE(feature)                          (((feature) != ENET_LPI_TXCLK_STOP) && ((feature) != ENET_LPI_TIMER) && \
                                                               ((feature) != ENET_LPI_TXAUTOMATE) && ((feature) != ENET_LPI_PHYLINK_UP) && \
                                                               ((feature) != ENET_LPI_ENABLE) && ((feature) != ENET_LPI_TRANSMIT_AUTO_ENTRY) && \
                                                               ((feature) != ENET_LPI_TRANSMIT_AUTO_ENTRY_WITH_TIMER))

/* check ENET lpi status */
#define NOT_ENET_LPI_STATUS(state)                             (((state) != ENET_LPI_RX_STATE) && ((state) != ENET_LPI_TX_STATE) && \
                                                               ((state) != ENET_LPI_RX_EXIT) && ((state) != ENET_LPI_RX_ENTRY) && \
                                                               ((state) != ENET_LPI_TX_EXIT) && ((state) != ENET_LPI_TX_ENTRY))

/* check ENET mmc feature */
#define ENET_MMC_FEATURE_BITS                                  (ENET_MMC_DROPPED_BROADCAST_UPDATE | ENET_MMC_COUNTER_STOP_ROLLOVER | ENET_MMC_RESET_ON_READ | \
                                                               ENET_MMC_COUNTERS_FREEZE)
#define NOT_ENET_MMC_FEATURE(feature)                          (((uint32_t)0x0U != ((feature)&(~ENET_MMC_FEATURE_BITS))) || (0U == (feature)))

