sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* check ENET ptp feature */
#define NOT_ENET_PTP_FEATURE(feature)                          (((0x00000000U != (0xEEFBC6BE & (feature)))) || (0U == (feature)))

/* check ENET ptp sign */
#define NOT_ENET_PTP_SIGN(sign)                                (((sign) != ENET_PTP_ADD_TO_TIME) && ((sign) != ENET_PTP_SUBSTRACT_FROM_TIME))

/* check ENET ptp nanosecond value */

#define NANOSECOND_HIGH_VAL                                    ((uint32_t)0x7FFFFFFFU)
#define NOT_ENET_NANOSECOND_VALUE(val)                         (NANOSECOND_HIGH_VAL < (val))

/* check ENET pps output frequece */
#define NOT_ENET_PPS_FREQ(freq)                                (((freq) != ENET_PPSOFC_1HZ) && ((freq) != ENET_PPSOFC_2HZ) && \
                                                               ((freq) != ENET_PPSOFC_4HZ) && ((freq) != ENET_PPSOFC_8HZ) && \
                                                               ((freq) != ENET_PPSOFC_16HZ) && ((freq) != ENET_PPSOFC_32HZ) && \
                                                               ((freq) != ENET_PPSOFC_64HZ) && ((freq) != ENET_PPSOFC_128HZ) && \
                                                               ((freq) != ENET_PPSOFC_256HZ) && ((freq) != ENET_PPSOFC_512HZ) && \
                                                               ((freq) != ENET_PPSOFC_1024HZ) && ((freq) != ENET_PPSOFC_2048HZ) && \
                                                               ((freq) != ENET_PPSOFC_4096HZ) && ((freq) != ENET_PPSOFC_8192HZ) && \
                                                               ((freq) != ENET_PPSOFC_16384HZ) && ((freq) != ENET_PPSOFC_32768HZ))

/* check ENET pps command */
#define NOT_ENET_PPS_COMMAND(command)                          (((command) != ENET_FLEXIBLE_PPS0_START_SINGLE_PULSE) && ((command) != ENET_FLEXIBLE_PPS0_START_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS0_CANCEL_START) && ((command) != ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_AT_TIME) && \
                                                               ((command) != ENET_FLEXIBLE_PPS0_STOP_PULSE_TRAIN_NOW) && ((command) != ENET_FLEXIBLE_PPS0_CANCEL_STOP_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS1_START_SINGLE_PULSE) && ((command) != ENET_FLEXIBLE_PPS1_START_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS1_CANCEL_START) && ((command) != ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_AT_TIME) && \
                                                               ((command) != ENET_FLEXIBLE_PPS1_STOP_PULSE_TRAIN_NOW) && ((command) != ENET_FLEXIBLE_PPS1_CANCEL_STOP_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS2_START_SINGLE_PULSE) && ((command) != ENET_FLEXIBLE_PPS2_START_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS2_CANCEL_START) && ((command) != ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_AT_TIME) && \
                                                               ((command) != ENET_FLEXIBLE_PPS2_STOP_PULSE_TRAIN_NOW) && ((command) != ENET_FLEXIBLE_PPS2_CANCEL_STOP_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS3_START_SINGLE_PULSE) && ((command) != ENET_FLEXIBLE_PPS3_START_PULSE_TRAIN) && \
                                                               ((command) != ENET_FLEXIBLE_PPS3_CANCEL_START) && ((command) != ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_AT_TIME) && \
                                                               ((command) != ENET_FLEXIBLE_PPS3_STOP_PULSE_TRAIN_NOW) && ((command) != ENET_FLEXIBLE_PPS3_CANCEL_STOP_PULSE_TRAIN))

/* check ENET mcgr mode */
#define ENET_MCGR_MODE_BITS                                    (ENET_MAC_PPS_CONTROL_PPSCTRL_PPSCMD | ENET_MAC_PPS_CONTROL_PPSCMD1 | ENET_MAC_PPS_CONTROL_PPSCMD2 | \
                                                               ENET_MAC_PPS_CONTROL_PPSCMD3 )
#define NOT_ENET_MCGR_MODE(para)                               ((uint32_t)0x0U != ((para)&(~ENET_MCGR_MODE_BITS)))

/* check ENET asym latency value */
#define ASYM_LATENCY_NANOSECOND_HIGH_VAL                       ((uint16_t)0xFFFU)
#define NOT_ASYM_LATENCY_NANOSECOND_VALUE(val)                 (ASYM_LATENCY_NANOSECOND_HIGH_VAL < (val))

/* check ENET ecc memory */
#define NOT_ENET_ECC_MEMORY(memory)                            (((memory) != ENET_MTL_ECC_SELECT_TX_MEM) && ((memory) != ENET_MTL_ECC_SELECT_RX_MEM) && \
                                                               ((memory) != ENET_MTL_ECC_SELECT_EST_MEM) && ((memory) != ENET_MTL_ECC_SELECT_RXP_MEM))

/* check the ecc error status related configuration */
#define NOT_ENET_ECC_ERR_STATUS_CFG(config)                    (((config) != ENET_MTL_ECC_ERR_STATUS_READ_ENABLE) && ((config) != ENET_MTL_UNCORRECTABLE_ERR_STATUS_CLEAR) && \
                                                               ((config) != ENET_MTL_CORRECTABLE_ERR_STATUS_CLEAR))

/* check the ecc error status related configuration */
#define NOT_ENET_ECC_ERR_ADDRESS(type)                         (((type) != ENET_MTL_UNCORRECTABLE_ERR_ADDRESS) && ((type) != ENET_MTL_CORRECTABLE_ERR_ADDRESS))

/* check the ecc error count related configuration */
#define NOT_ENET_ECC_ERR_COUNT(type)                           (((type) != ENET_MTL_UNCORRECTABLE_ERR_COUNT) && ((type) != ENET_MTL_CORRECTABLE_ERR_COUNT))
/* check the mtl error injection mode */
#define NOT_ENET_MTL_ERR_INJECTION_MODE(mode)                  (((mode) != ENET_ERR_INJTECTION_ON_ECC_PARITY) && ((mode) != ENET_ERR_INJTECTION_ON_DATA))

/* check the MTL error injection configuration */
#define NOT_ENET_MTL_ERR_INJECTION_CFG(config)                 (((config) != ENET_RXP_INSERT_ECC_ERR_1BIT) && ((config) != ENET_RXP_INSERT_ECC_ERR_2BIT) && \
                                                               ((config) != ENET_RXP_INSERT_ECC_ADDR_ERR_1BIT) && ((config) != ENET_RXP_INSERT_ECC_ADDR_ERR_2BIT))

