sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
#endif /* FW_DEBUG_ERR_REPORT */
/* global transmit and receive descriptors pointers */
extern enet_descriptors_struct  *dma_current_txdesc;
extern enet_descriptors_struct  *dma_current_rxdesc;
/* structure pointer of enhanced descriptor for TBS */
extern enet_tbs_enhanced_descriptors_struct  *dma_current_tbs_txdesc;

/* global transmit and receive descriptors pointers */
extern enet_descriptors_struct  *dma_current_txdesc1;
extern enet_descriptors_struct  *dma_current_rxdesc1;
/* structure pointer of enhanced descriptor for TBS */
extern enet_tbs_enhanced_descriptors_struct  *dma_current_tbs_txdesc1;

extern enet_descriptors_struct  txdesc_tab[ENET_TXBUF_NUM];                       /*!< ENET TxDMA descriptor */
extern enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab[ENET_TXBUF_NUM];      /*!< ENET TxDMA enhanced descriptor */
extern enet_descriptors_struct  rxdesc_tab[ENET_RXBUF_NUM];                       /*!< ENET RxDMA descriptor */
extern uint8_t rx_buff[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                          /*!< ENET receive buffer */
extern uint8_t tx_buff[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                          /*!< ENET transmit buffer */

extern enet_descriptors_struct  txdesc_tab1[ENET_TXBUF_NUM];                      /*!< ENET TxDMA descriptor */
extern enet_tbs_enhanced_descriptors_struct  tbs_txdesc_tab1[ENET_TXBUF_NUM];     /*!< ENET TxDMA enhanced descriptor */
extern enet_descriptors_struct  rxdesc_tab1[ENET_RXBUF_NUM];                      /*!< ENET RxDMA descriptor */
extern uint8_t rx_buff1[ENET_RXBUF_NUM][ENET_RXBUF_SIZE];                         /*!< ENET receive buffer */
extern uint8_t tx_buff1[ENET_TXBUF_NUM][ENET_TXBUF_SIZE];                         /*!< ENET transmit buffer */

/* function declarations */
/* main function */
/* deinitialize the ENET module */
void enet_deinit(void);
/* configure the parameters which are usually less cared for initialization */
void enet_initpara_config(enet_option_enum option, uint32_t para);
/* initialize ENET parameter structure with a default value */
void enet_struct_para_init(enet_struct_type_enum type, void *p_struct);
/* initialize ENET MAC module */
void enet_mac_init(enet_mac_config_struct *Config);
/* initialize ENET DMA module */
void enet_dma_init(enet_dmach_enum dmach, enet_dma_config_struct *Config);
/* initialize ENET MTL module */
void enet_mtl_init(enet_mtl_enum Instance, enet_mtl_config_struct *Config);
/* initialize ENET peripheral with generally concerned parameters and the less cared parameters */
ErrStatus enet_init(enet_mediamode_enum mediamode, enet_chksumconf_enum checksum, enet_frmrecept_enum recept);
/* reset all core internal registers located in CLK_TX and CLK_RX */
ErrStatus enet_software_reset(void);
/* check receive frame valid and return frame size */
uint32_t enet_rxframe_size_get(enet_dmach_enum dmach);
/* initialize the dma tx/rx descriptors's parameters in ring mode */
void enet_descriptors_ring_init(enet_dmach_enum dmach, enet_dmadirection_enum direction);

/* handle current received frame data to application buffer */
ErrStatus enet_frame_receive(enet_dmach_enum dmach, uint8_t *buffer, uint32_t bufsize);
/* handle current received frame but without data copy to application buffer */
#define ENET_NOCOPY_FRAME_RECEIVE(dmach)         enet_frame_receive(dmach, NULL, 0U)
/* handle application buffer data to transmit it */
ErrStatus enet_frame_transmit(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length);
/* handle current transmit frame but without data copy from application buffer */
#define ENET_NOCOPY_FRAME_TRANSMIT(dmach, len)     enet_frame_transmit(dmach, NULL, (len))

ErrStatus enet_frame_transmit_tbs(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length, uint32_t launch_time, uint32_t gsn_num);
/* configure the transmit IP frame checksum offload calculation and insertion */
void enet_transmit_checksum_config(enet_descriptors_struct *desc, uint32_t checksum);
/* configure MAC to add or replace the Source Address field in the Ethernet packet */
void enet_transmit_sourceaddr_insert_config(enet_descriptors_struct *desc, uint32_t control);
/* configure the CRC and pad insertion for Tx packet */
void enet_transmit_crc_pad_config(enet_descriptors_struct *desc, uint32_t control);
/* configure MAC address */
void enet_mac_address_set(enet_macaddress_enum mac_addr, uint8_t paddr[]);
/* get MAC address */
void enet_mac_address_get(enet_macaddress_enum mac_addr, uint8_t paddr[]);
/* configure ARP IP address */
void enet_arp_ip_address_set(uint8_t ipaddr[]);
/* get the ENET MAC/MSC/PTP/DMA status flag */
FlagStatus enet_flag_get(enet_flag_enum enet_flag);
/* clear the ENET DMA status flag */
void enet_flag_clear(enet_flag_clear_enum enet_flag);
/* enable ENET MAC/MSC/DMA interrupt */
void enet_interrupt_enable(enet_int_enum enet_int);
/* disable ENET MAC/MSC/DMA interrupt */
void enet_interrupt_disable(enet_int_enum enet_int);
/* get ENET MAC/MSC/DMA interrupt flag */
FlagStatus enet_interrupt_flag_get(enet_int_flag_enum int_flag);
/* clear ENET DMA interrupt flag */
void enet_interrupt_flag_clear(enet_int_flag_clear_enum int_flag_clear);

/* MAC function */
/* enable the Tx MAC */
void enet_tx_mac_enable(void);
/* disable the Tx MAC */
void enet_tx_mac_disable(void);
/* enable the Rx MAC */
void enet_rx_mac_enable(void);
/* disable the Rx MAC */
void enet_rx_mac_disable(void);
/* set the MAC extended configuration */
void enet_mac_extend_config(enet_extend_macconfig_enum func);
/* set the MAC extend Inter-Packet Gap */
void enet_mac_extend_gap_set(uint32_t packet_gap);
/* set the MAC giant packet size limit */
void enet_mac_giant_packetsize_set(uint32_t size);
/* set the MAC jabber programmable timeout */
void enet_mac_jabber_timeout_set(uint32_t val);
/* set the MAC watchdog programmable timeout */
void enet_mac_watchdog_timeout_set(uint32_t val);
/* check the mac version */
ErrStatus enet_mac_version_check(void);
/* put registers value into the application buffer */
void enet_registers_get(enet_registers_type_enum type, uint32_t *preg, uint32_t num);
/* set the mode and priority for Rx queue */
void enet_rxq_mode_set(enet_rxq_enum enet_rxq, enet_queopmode_enum queuemode, uint8_t priosel);
/* enable the MAC address filter */
void enet_address_filter_enable(enet_macaddress_enum mac_addr);
/* disable the MAC address filter */
void enet_address_filter_disable(enet_macaddress_enum mac_addr);
/* configure the MAC address filter */
void enet_address_filter_config(enet_macaddress_enum mac_addr, uint32_t addr_mask, uint32_t filter_type);
/* PHY interface configuration (configure SMI clock and reset PHY chip) */
ErrStatus enet_phy_config(void);
/* get PHY interface mode */
enet_modetype_enum enet_phy_interface_get(void);
/* write to/read from a PHY register */
ErrStatus enet_phy_write_read(enet_phyconfig_struct *ConfigInfo, enet_phydirection_enum direction, ControlStatus Clause45Enable);
/* enable the loopback function of phy chip */
ErrStatus enet_phyloopback_enable(void);
/* disable the loopback function of phy chip */
ErrStatus enet_phyloopback_disable(void);
/* enable ENET forward feature */
void enet_forward_feature_enable(uint32_t feature);
/* disable ENET forward feature */
void enet_forward_feature_disable(uint32_t feature);
/* enable ENET fliter feature */
void enet_fliter_feature_enable(uint32_t feature);
/* disable ENET fliter feature */
void enet_fliter_feature_disable(uint32_t feature);
/* set the filter fail packets queue */
void enet_fliterfail_queue_set(enet_rxq_enum enet_rxq, uint32_t type);
/* set the normal packets queue */
void enet_normal_frame_queue_set(enet_rxq_enum enet_rxq, enet_frame_type_enum type);
/* set the normal packets queue related configuration */
void enet_normal_frame_queue_config(uint32_t config);
/* set the the FSM and interface timeout values */
void enet_fsm_timeout_set(enet_fsmtimeout_enum type, uint32_t val);

/* flow control function */
/* start the Rx DMA */
void enet_rx_dma_start(enet_dmach_enum dmach);
/* start the Tx DMA */
void enet_tx_dma_start(enet_dmach_enum dmach);
/* generate the pause frame, ENET will send pause frame after enable transmit flow control */
ErrStatus enet_pauseframe_generate(void);
/* configure the pause frame detect type */
void enet_pauseframe_detect_config(uint32_t detect);
/* configure the pause frame parameters */
void enet_pauseframe_config(uint16_t pausetime, uint32_t pause_threshold);
/* configure the threshold of the flow control(deactive and active threshold) */
void enet_flowcontrol_threshold_config(enet_rxq_enum rxq, uint32_t deactive, uint32_t active);
/* enable ENET flow control feature */
void enet_flowcontrol_feature_enable(uint32_t feature);
/* disable ENET flow control feature */
void enet_flowcontrol_feature_disable(uint32_t feature);
/* config ENET frame preemption feature */
void enet_framepreemption_feature_enable(uint32_t feature);
/* disable ENET frame preemption feature */
void enet_framepreemption_feature_disable(uint32_t feature);

/* DMA function */
/* get the dma transmit/receive process state */
uint32_t enet_dmaprocess_state_get(enet_dmach_enum dmach, enet_dmadirection_enum direction);
/* start/stop the DMA transmission/reception */
void enet_dmaprocess_config(enet_dmach_enum dmach, enet_dmadirection_enum direction, ControlStatus status);
/* check and recover the Rx process */
void enet_rxprocess_check_recovery(enet_dmach_enum dmach);
/* get the transmit/receive address of current descriptor, or current buffer, or descriptor table */
uint32_t enet_dma_desc_address_get(enet_desc_reg_enum addr_get);
/* get the Tx or Rx descriptor information */
uint32_t enet_desc_information_get(enet_descriptors_struct *desc, enet_descstate_enum info_get);
/* get the number of missed frames during receiving */
void enet_missed_frame_counter_get(enet_dmach_enum dmach, uint32_t *rxdma_received, uint32_t *rxdma_drop);
/* get the overflow status of missed/received frame counter */
FlagStatus enet_counter_overflow_status_get(enet_dmach_enum dmach, enet_dmacounter_enum counter);
/* get the DMA slot number value */
uint16_t enet_dma_slot_value_get(enet_dmach_enum dmach);
/* set the DMA slot interval value */
void enet_dma_slot_interval_set(enet_dmach_enum dmach, uint16_t slot_interval);
/* set the DMA slot check related function parameters */
void enet_dma_slot_config(enet_dmach_enum dmach, uint32_t function, ControlStatus status);
/* set the watchdog timeout for receive interrupt from the DMA */
void enet_dma_rxinterrupt_watchdog_timer_set(enet_dmach_enum dmach, uint32_t count_uint, uint8_t count_val);
/* set the DMA alternate receive buffer size */
void enet_rxbuf_alternate_size_set(enet_dmach_enum dmach, uint16_t size);

/* MTL function */
/* set the algorithm for Tx scheduling */
void enet_schedalg_set(enet_txqalgotype_enum SchedAlgo);
/* set the weight for Tx queue */
void enet_txq_weight_set(enet_txq_enum enet_txq, uint32_t weight);
/* set the weight for Rx queue */
void enet_rxq_weight_set(enet_rxq_enum enet_rxq, uint32_t weight);
/* config the arbitration for Rx queue */
void enet_rxq_packet_arbitration_config(enet_rxq_enum enet_rxq, ControlStatus status);
/* enable dynamic mapping for Rx queue */
void enet_dynamic_mapping_set(enet_rxq_enum enet_rxq);
/* set the type, associated queue number and paket type */
ErrStatus enet_rxq_type_match_set(uint16_t reg_num, enet_rxq_enum enet_rxq, uint16_t typ_val, enet_packet_type_enum packet_type);
/* set the credit value for Tx queue 1 */
void enet_txq1_credit_set(enet_cbs_config_struct creditval);
/* set the mode and size for Tx queue */
void enet_txq_mode_size_set(enet_txq_enum enet_txq, enet_queopmode_enum queuemode, uint32_t queuesize);
/* set the size for Rx queue */
void enet_rxq_size_set(enet_rxq_enum enet_rxq, uint32_t queuesize);
/* select the dma channel for Rx queue */
void enet_rxq_dma_select(enet_rxq_enum enet_rxq, enet_dmach_enum dmach);
/* set the base time of GCL */
void enet_est_gcl_basetime_set(uint32_t second, uint32_t nanosecond);
/* get the base time of GCL */
void enet_est_gcl_basetime_get(enet_ESTConfig_struct *time_struct);
/* set the cycle time of GCL */
void enet_est_gcl_cycletime_set(uint8_t second, uint32_t nanosecond);
/* get the cycle time of GCL */
void enet_est_gcl_cycletime_get(enet_ESTConfig_struct *time_struct);
/* set the extension time of GCL */
void enet_est_gcl_extensiontime_set(uint32_t nanosecond);
/* get the extension time of GCL */
void enet_est_gcl_extensiontime_get(enet_ESTConfig_struct *time_struct);
/* set the length of GCL */
void enet_est_gcl_length_set(uint32_t length);
/* get the length of GCL */
void enet_est_gcl_length_get(enet_ESTConfig_struct *time_struct);
/* set the related parameter of GCL */
void enet_est_gcl_para_set(uint8_t addr, enet_GCLConfig_struct *gcl_struct);
/* get the related parameter of GCL */
void enet_est_gcl_para_get(uint8_t addr, enet_GCLConfig_struct *gcl_struct);
/* enable switching to S/W owned list */
void enet_est_gcl_switch_enable(void);
/* get the S/W owned list */
enet_gcl_enum enet_gcl_softwore_list_get(void);
/* get the current gcl slot number */
uint8_t enet_gcl_current_slot_get(void);
/* get the BTR error loop count */
uint8_t enet_btr_error_loop_get(void);
/* clear the queue number that have experienced error */
void enet_est_error_queue_clear(enet_est_error_enum err, enet_txq_enum enet_txq);
/* get the queue number that have experienced error */
FlagStatus enet_est_error_queue_satus_get(enet_est_error_enum err, enet_txq_enum enet_txq);
/* get the first queue number experience HLBF error */
enet_txq_enum enet_est_first_error_queue_get(void);
/* get the frame size of the first queue which experience HLBF error */
uint16_t enet_est_error_framesize_get(void);

/* config FPE related parameter */
void enet_fpe_advance_time_set(enet_FPEConfig_struct *fpe_struct);
/* get FPE related parameter */
void enet_fpe_advance_time_get(enet_FPEConfig_struct *fpe_struct);
/* set the launch expiry time */
void enet_launch_expiry_time_set(uint32_t mode, uint32_t offset, uint32_t gsn_offset);
/* set the fetch time */
void enet_fetch_time_set(uint32_t mode, uint32_t offset, uint32_t gsn_offset);
/* get the transmit queue debug state state */
uint32_t enet_txq_debug_state_get(enet_txq_enum enet_txq, enet_mtl_txq_state_enum state);
/* get the count of transmit queue packets */
uint32_t enet_txq_packet_count_get(enet_txq_enum enet_txq);
/* get the number of transmit queue status word */
uint32_t enet_txq_status_word_num_get(enet_txq_enum enet_txq);
/* get the receive queue debug state state */
uint32_t enet_rxq_debug_state_get(enet_rxq_enum enet_rxq, enet_mtl_rxq_state_enum state);
/* get the count of receive queue packets */
uint32_t enet_rxq_packet_count_get(enet_rxq_enum enet_rxq);
/* get the number of average bits per slot */
uint32_t enet_slot_average_bits_get(enet_txq_enum enet_txq);
/* config the transmit queue 1 ETS control related parameter */
void enet_txq1_ets_control(uint32_t config);
/* set the overhead bytes value */
void enet_overhead_value_set(uint8_t val);

/* special enhanced mode function */
/* configure descriptor to work in enhanced mode */
void enet_desc_select_enhanced_mode(enet_dmach_enum dmach);


