sorosaulong-ux/gd32-test-project/Library/gd32a7xx_enet.h
/* configure descriptor to work in normal mode */
void enet_desc_select_normal_mode(enet_dmach_enum dmach);
/* configure enhanced descriptor  */
void enet_tbs_descriptors_ring_init(enet_dmach_enum dmach);
/* receive a packet data with timestamp values to application buffer, when the DMA is in normal mode */
ErrStatus enet_ptpframe_receive_normal_mode(enet_dmach_enum dmach, uint8_t *buffer, uint32_t bufsize, uint32_t timestamp[]);
/* handle current received frame but without data copy to application buffer in PTP normal mode */
#define ENET_NOCOPY_PTPFRAME_RECEIVE_NORMAL_MODE(dmach, ptr)             enet_ptpframe_receive_normal_mode(dmach, NULL, 0U, (ptr))
/* send data with timestamp values in application buffer as a transmit packet, when the DMA is in normal mode */
ErrStatus enet_ptpframe_transmit_normal_mode(enet_dmach_enum dmach, uint8_t *buffer, uint32_t length, uint32_t timestamp[]);
/* handle current transmit frame but without data copy from application buffer in PTP normal mode */
#define ENET_NOCOPY_PTPFRAME_TRANSMIT_NORMAL_MODE(dmach, len, ptr)       enet_ptpframe_transmit_normal_mode(dmach, NULL, (len), (ptr))

/* VLAN tag function */
/* compute the CRC of a hardware address */
uint32_t enet_crc_compute(uint8_t *mac, uint8_t size);
/* bitwise reversal on a 32 bit value */
uint32_t enet_value_reverse(uint32_t val);
/* set the vlan filter dma selection */
void enet_vlantag_filter_dmach_select(uint32_t filter, enet_dmach_enum dmach);
/* set up vlan filter feature */
void enet_vlantag_filter_feature_set(uint32_t filter, uint32_t feature);
/* set up vlan filter tag ID */
void enet_vlantag_filter_vid_set(uint32_t filter, uint32_t val);
/* add an address entry to the hash table filter */
void enet_add_dstaddr_hashfilter(uint8_t *macaddr);
/* remove an address entry to the hash table filter */
void enet_remove_dstaddr_hashfilter(uint8_t *macaddr);
/* add a vlan tag entry to the hash table filter */
void enet_add_vlantag_hashtable(uint32_t tagval);
/* remove a vlan tag entry to the hash table filter */
void enet_remove_vlantag_hashtable(uint32_t tagval);

/* flexible Rx parser function */
/* enable flexible Rx parser */
void enet_parser_enable(void);
/* disable flexible Rx parser */
void enet_parser_disable(void);
/* set the number of entries in the Instruction table */
void enet_parser_entry_number_set(enet_entry_type_enum type, uint32_t value);
/* config the instruction table entry */
void enet_parser_table_entry_config(uint32_t *value, uint8_t addr);
/* get the value of instruction table entry */
void enet_parser_table_entry_get(uint32_t *value, uint32_t addr);
/* get MTL parser overflow flag */
FlagStatus enet_parser_overflow_flag_get(enet_parser_counter_enum counter);
/* get MTL parser related count */
uint32_t enet_parser_count_get(enet_parser_counter_enum counter);

/* L3/L4 filter function */
/* select the DMA channel number for the packet that is passed by this L3_L4 filter */
void enet_l3l4_filter_dmach_select(enet_l3l4_filter_enum filter, enet_dmach_enum dmach);
/* config the L3_L4 filter related function */
void enet_l3l4_filter_config(enet_l3l4_filter_enum filter, uint32_t function, ControlStatus status);
/* set the L4 filter port number */
void enet_l4_port_num_set(enet_l3l4_filter_enum filter, uint16_t src_port, uint16_t dst_port);
/* configure L3 filter IPv4 address */
void enet_l3_ipv4_address_set(enet_l3l4_filter_enum filter, uint8_t src_ipaddr[], uint8_t dst_ipaddr[]);
/* configure L3 filter IPv6 address */
void enet_l3_ipv6_address_set(enet_l3l4_filter_enum filter, uint32_t ipaddr[]);

/* descriptor function */
/* get the bit flag of ENET dma descriptor */
FlagStatus enet_desc_flag_get(enet_descriptors_struct *desc, uint32_t desc_flag);
/* set the bit flag of ENET dma tx descriptor */
void enet_desc_flag_set(enet_descriptors_struct *desc, uint32_t desc_flag);
/* clear the bit flag of ENET dma tx descriptor */
void enet_desc_flag_clear(enet_descriptors_struct *desc, uint32_t desc_flag);
/* drop current receive frame */
void enet_rxframe_drop(enet_dmach_enum dmach);
/* enable DMA feature */
void enet_dma_feature_enable(enet_dmach_enum dmach, uint32_t feature);
/* disable DMA feature */
void enet_dma_feature_disable(enet_dmach_enum dmach, uint32_t feature);

/* PMT function */
/* wakeup packet filter register pointer reset */
void enet_pmt_filter_register_pointer_reset(void);
/* get the current value of the wakeup Packet Filter register pointer */
uint32_t enet_pmt_filter_register_pointer_get(void);
/* set the remote wakeup packet registers */
void enet_pmt_filter_config(uint32_t pdata[]);
/* enable wakeup management features */
void enet_pmt_feature_enable(uint32_t feature);
/* disable wakeup management features */
void enet_pmt_feature_disable(uint32_t feature);

/* EEE function */
/* set this counter so that the number of clock cycles of CSR clock is 1us */
void enet_eee_ustick_set(uint32_t tick);
/* set the value of LPI ralated timers */
void enet_eee_lpi_timer_set(enet_lpitimer_enum type, uint32_t val);
/* enable energy efficient ethernet features */
void enet_eee_lpi_feature_enable(uint32_t feature);
/* disable energy efficient ethernet features */
void enet_eee_lpi_feature_disable(uint32_t feature);
/* get lpi state */
FlagStatus enet_lpi_status_get(uint16_t state);
/* get LPI related counter */
uint32_t enet_lpi_counters_get(enet_lpi_counter_enum counter);

/* MMC function */
/* reset the MAC statistics counters */
void enet_mmc_counters_reset(void);
/* enable the MAC statistics counter features */
void enet_mmc_feature_enable(uint32_t feature);
/* disable the MAC statistics counter features */
void enet_mmc_feature_disable(uint32_t feature);
/* configure MAC statistics counters preset mode */
void enet_mmc_counters_preset_config(enet_mmc_preset_enum mode);
/* get MAC statistics counter */
uint32_t enet_mmc_counters_get(enet_mmc_counter_enum counter);

/* PTP function */
/* enable the PTP features */
void enet_ptp_feature_enable(uint32_t feature);
/* disable the PTP features */
void enet_ptp_feature_disable(uint32_t feature);
/* configure the PTP timestamp function */
ErrStatus enet_ptp_timestamp_function_config(enet_ptp_function_enum func);
/* configure the PTP system time subsecond and nanosubsecond increment value */
void enet_ptp_subsecond_increment_config(uint8_t subsecond, uint8_t nanosubsecond);
/* adjusting the PTP clock frequency only in fine update mode */
void enet_ptp_timestamp_addend_config(uint32_t add);
/* initializing or adding/subtracting to second of the PTP system time */
void enet_ptp_timestamp_update_config(uint32_t sign, uint16_t secondHi, uint32_t second, uint32_t subsecond);
/* get the PTP current system time */
void enet_ptp_system_time_get(enet_ptp_systime_struct *systime_struct);
/* configure the PPS output frequency */
void enet_ptp_pps_output_frequency_config(uint32_t freq);
/* configure the PPS single pulse output */
void enet_flexible_pps_singlepulse_output(enet_pps_enum pps, uint32_t second, uint32_t nanosubsecond, uint32_t width, ControlStatus interrupt);
/* configure the PPS train pulse output */
void enet_flexible_pps_trainpulse_output(enet_pps_enum pps, uint32_t second, uint32_t nanosubsecond, uint32_t width, uint32_t interval,
        ControlStatus interrupt);
/* configure the PPS output related command */
void enet_flexible_pps_command_config(enet_pps_enum pps, uint32_t stopsecond, uint32_t stopnanosubsecond, uint32_t command);
/* set the value of presentation time */
void enet_mcgr_present_time_set(enet_mcgr_enum mcgr, uint32_t seconds);
/* set the value of current presentation time */
uint32_t enet_mcgr_current_present_time_get(void);
/* configure the update value of presentation time */
void enet_mcgr_present_time_update(uint32_t nanosubsecond);
/* configure the mcgr related command */
void enet_mcgr_media_clock_config(enet_mcgr_enum mcgr, uint32_t mode);
/* set the timestamp asymmetry correction value */
void enet_timestamp_asym_correction_set(enet_timestamp_type_enum type, uint32_t val);
/* set the timestamp correction value */
void enet_timestamp_correction_value_set(enet_timestamp_type_enum type, uint32_t nanosecond, uint8_t nanosubsecond);
/* get the timestamp latency value */
uint16_t enet_timestamp_asym_latency_get(enet_timestamp_type_enum type, enet_timestamp_latency_enum latency);

/* VLAN Inclusion function */
/* writing to the per queue/channel VLAN inclusion */
void enet_queue_based_vlan_write(enet_vlantype_enum vlantype, uint16_t vlantag, enet_txq_enum queue);
/* read the type of the queue/channel VLAN */
enet_vlantype_enum enet_queue_based_vlan_type_read(enet_txq_enum queue);
/* read the vlan tag of the queue/channel VLAN */
uint16_t enet_queue_based_vlan_tagvid_read(enet_txq_enum queue);

/* ECC error function */
/* select the MTL ECC memory */
void enet_ecc_memory_select(uint32_t memory);
/* set the ECC error status related configuration */
void enet_ecc_status_clear_read(uint32_t config);
/* get the MTL ECC error address */
uint16_t enet_ecc_error_address_get(uint32_t type);
/* get the MTL ECC error counter */
uint16_t enet_ecc_error_count_get(uint32_t type);
/* set the MTL error injection mode */
void enet_error_injection_mode_set(uint32_t mode);
/* get the bit location of error injection */
uint16_t enet_error_injection_location_get(void);
/* set the MTL error injection configuration */
void enet_error_injection_config(uint32_t config);
#ifndef USE_DELAY
static void enet_delay(uint32_t ncount);
#endif
#endif /* GD32A7XX_ENET_H */
